{
  "head": {
    "title": ".NET, Java, Cloud API และแอปการแปลงเอกสารโดย GroupDocs",
    "description": "แปลงรูปแบบไฟล์เอกสารและรูปภาพยอดนิยมบนทุกแพลตฟอร์มด้วยแอพและโซลูชันที่ใช้ API"
  },
  "header": {
    "title": "โซลูชันการแปลงเอกสารและรูปภาพ",
    "description": "แปลงรูปแบบไฟล์เอกสารและรูปภาพยอดนิยมบนทุกแพลตฟอร์มด้วยแอพและโซลูชันที่ใช้ API"
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API รวม",
      "label": "ดู High Code API ทั้งหมด",
      "product1_content": "Native .NET API เพื่อแปลงเอกสารและรูปแบบไฟล์รูปภาพอย่างแม่นยำในแอปพลิเคชัน .NET ทุกประเภท รองรับการเพิ่มลายน้ำรูปภาพขณะแปลง",
      "product2_content": "เปิดใช้งานแอปพลิเคชัน Java ของคุณเพื่อแปลงระหว่างรูปแบบเอกสารมาตรฐานอุตสาหกรรมทั้งหมดอย่างง่ายดาย รวมถึง Microsoft Office, PDF, HTML, รูปภาพ และอื่นๆ อีกมากมาย"
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API รวม",
      "label": "ดู Low Code API ทั้งหมด",
      "product1_content": "ทำงานร่วมกับ API การแปลงไฟล์ cURL RESTful เพื่อแปลง Microsoft Office, PDF, อีเมล, โครงการ, HTML และรูปแบบไฟล์ทั่วไปอื่นๆ ในแอปพลิเคชันของคุณ",
      "product2_content": "การแปลงไฟล์ .NET REST API เพื่อแปลง Microsoft Office, PDF, อีเมล, โครงการ, HTML และรูปแบบไฟล์ทั่วไปอื่นๆ บนแพลตฟอร์มใดๆ ได้อย่างง่ายดายโดยใช้ Cloud SDK",
      "product3_content": "เติมเต็มแอปพลิเคชัน Java บนคลาวด์ของคุณด้วยคุณสมบัติการแปลงเอกสารขั้นสูงบนแพลตฟอร์มใดๆ ที่สามารถเรียก REST API ได้"
    },
    "api3": {
      "title": "GroupDocs.Conversion ไม่รวมแอปโค้ด",
      "label": "ดูทั้งหมด No Code Apps",
      "product1_content": "แปลงรูปแบบเอกสารมากกว่า 50 รูปแบบเป็น PDF, XLSX, DOCX, XPS, HTML และอื่นๆ",
      "product2_content": "แอพฟรีเพื่อแปลงรูปแบบ DOC เป็น XLS จากเว็บเบราว์เซอร์ใดก็ได้",
      "product3_content": "อัปโหลดเอกสาร PDF ของคุณเพื่อแปลงเป็นรูปแบบ Word (DOCX) ได้อย่างราบรื่น"
    }
  },
  "testimonial": {
    "designation": "นักจิตวิทยา",
    "content": "ฉันตื่นเต้นที่ได้เห็นการเติบโตของ GroupDocs การตอบสนองของทั้งทีมของคุณช่วยฉันได้มาก เมื่อฉันพูดคุยกับใครบางคนที่ GroupDocs ฉันสามารถรับประกันได้ว่ามีใครบางคนกำลังฟังและทำสิ่งต่างๆ ให้เกิดขึ้น"
  }
}