{
  "head": {
    "title": ".NET, Java, interfejsy API chmury i aplikacje do konwersji dokumentów firmy GroupDocs",
    "description": "Konwertuj popularne formaty plików dokumentów i obrazów na dowolnej platformie za pomocą aplikacji i rozwiązań opartych na interfejsie API."
  },
  "header": {
    "title": "Rozwiązanie do konwersji dokumentów i obrazów",
    "description": "Konwertuj popularne formaty plików dokumentów i obrazów na dowolnej platformie za pomocą aplikacji i rozwiązań opartych na interfejsie API."
  },
  "apis": {
    "api1": {
      "title": "Zawiera interfejsy API wysokiego kodu GroupDocs.Conversion",
      "label": "Wyświetl wszystkie interfejsy API wysokiego kodu",
      "product1_content": "Natywny interfejs API .NET do dokładnej konwersji dokumentów i formatów plików graficznych w dowolnym typie aplikacji .NET. Obsługuje dodawanie znaków wodnych obrazu podczas konwersji.",
      "product2_content": "Pozwól aplikacjom Java na łatwą konwersję pomiędzy wszystkimi standardowymi formatami dokumentów, w tym Microsoft Office, PDF, HTML, obrazami i wieloma innymi.",
      "product3_content": "Włącz aplikacje JavaScript, aby łatwo konwertowały wszystkie standardowe formaty dokumentów, w tym Microsoft Office, PDF, HTML, obrazy i wiele innych."
    },
    "api2": {
      "title": "Zawiera interfejsy API GroupDocs.Conversion o niskim kodzie",
      "label": "Wyświetl wszystkie interfejsy API o niskim kodzie",
      "product1_content": "Pracuj z interfejsem API konwersji plików cURL RESTful, aby łatwo konwertować pliki Microsoft Office, PDF, e-mail, Project, HTML i inne popularne formaty plików w swoich aplikacjach.",
      "product2_content": "Konwersja plików .NET API REST do łatwej konwersji plików Microsoft Office, PDF, e-mail, Project, HTML i innych popularnych formatów plików na dowolnej platformie za pomocą Cloud SDK.",
      "product3_content": "Wzbogacaj swoje oparte na chmurze aplikacje Java o zaawansowane funkcje konwersji dokumentów na dowolnej platformie obsługującej interfejsy API REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion Nie zawiera aplikacji kodu",
      "label": "Zobacz wszystkie aplikacje bez kodu",
      "product1_content": "Konwertuj ponad 50 formatów dokumentów na formaty PDF, XLSX, DOCX, XPS, HTML i inne.",
      "product2_content": "Darmowa aplikacja do konwersji DOC do formatu XLS z dowolnej przeglądarki internetowej.",
      "product3_content": "Przesyłaj dokumenty PDF w celu płynnej konwersji do formatu Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psycholog",
    "content": "Z podekscytowaniem obserwuję rozwój GroupDocs. Szybkość reakcji całego zespołu bardzo mi pomogła. Kiedy rozmawiam z kimś w GroupDocs, mogę zagwarantować, że ktoś mnie słucha i sprawia, że ​​wszystko się dzieje."
  }
}