{
  "head": {
    "title": "NET، جاوا، Cloud APIها و برنامه‌های تبدیل سند توسط GroupDocs",
    "description": "با راه حل های مبتنی بر برنامه و api، فرمت های محبوب سند و فایل تصویر را در هر پلتفرمی تبدیل کنید."
  },
  "header": {
    "title": "راه حل تبدیل سند و تصویر",
    "description": "با راه حل های مبتنی بر برنامه و api، فرمت های محبوب سند و فایل تصویر را در هر پلتفرمی تبدیل کنید."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code APIs شامل",
      "label": "مشاهده همه APIهای High Code",
      "product1_content": "Native .NET API برای تبدیل دقیق اسناد و فرمت های فایل تصویری در هر نوع برنامه دات نت. پشتیبانی از افزودن واترمارک تصویر در حین تبدیل.",
      "product2_content": "برنامه های جاوا خود را فعال کنید تا به راحتی بین تمام فرمت های سند استاندارد صنعتی از جمله Microsoft Office، PDF، HTML، تصاویر و بسیاری دیگر تبدیل شوند."
    },
    "api2": {
      "title": "GroupDocs.Conversion کم کد API شامل",
      "label": "مشاهده همه APIهای Low Code",
      "product1_content": "با CURL RESTful تبدیل فایل API کار کنید تا به راحتی مایکروسافت آفیس، PDF، ایمیل، پروژه، HTML و سایر فرمت های فایل رایج را در برنامه های خود تبدیل کنید.",
      "product2_content": "تبدیل فایل NET REST API برای تبدیل آسان مایکروسافت آفیس، PDF، ایمیل، پروژه، HTML و سایر فرمت‌های فایل رایج در هر پلتفرمی با استفاده از Cloud SDK.",
      "product3_content": "برنامه های جاوا مبتنی بر ابر خود را با ویژگی های پیشرفته تبدیل اسناد در هر پلتفرمی که قادر به فراخوانی API های REST است، غنی کنید."
    },
    "api3": {
      "title": "GroupDocs.Conversion بدون کد برنامه شامل",
      "label": "مشاهده همه برنامه های بدون کد",
      "product1_content": "بیش از 50 فرمت سند را به PDF، XLSX، DOCX، XPS، HTML و موارد دیگر تبدیل کنید.",
      "product2_content": "برنامه رایگان برای تبدیل DOC به فرمت XLS از هر مرورگر وب.",
      "product3_content": "اسناد PDF خود را برای تبدیل بدون درز به فرمت Word (DOCX) آپلود کنید."
    }
  },
  "testimonial": {
    "designation": "روانشناس",
    "content": "من با هیجان رشد GroupDocs را تماشا می کنم. پاسخگویی تیم کامل شما به من کمک زیادی کرده است، وقتی با فردی در GroupDocs صحبت می‌کنم، می‌توانم تضمین کنم که کسی گوش می‌دهد و اتفاقات را می‌دهد."
  }
}