{
  "head": {
    "title": "GroupDocs'tan .NET, Java, Bulut API'leri ve Belge Dönüştürme Uygulamaları",
    "description": "Uygulama ve API tabanlı çözümlerle popüler belge ve görüntü dosyası formatlarını herhangi bir platformda dönüştürün."
  },
  "header": {
    "title": "Belge ve Görüntü Dönüştürme Çözümü",
    "description": "Uygulama ve API tabanlı çözümlerle popüler belge ve görüntü dosyası formatlarını herhangi bir platformda dönüştürün."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion Yüksek Kod API'leri Dahil Edilir",
      "label": "Tüm Yüksek Kod API'lerini Görüntüleyin",
      "product1_content": "Her türlü .NET uygulamasında belgeleri ve görüntü dosyası formatlarını doğru bir şekilde dönüştürmek için yerel .NET API. Dönüştürme sırasında görüntü filigranlarının eklenmesini destekler.",
      "product2_content": "Java uygulamalarınızın, Microsoft Office, PDF, HTML, resimler ve diğerleri de dahil olmak üzere tüm endüstri standardı belge formatları arasında kolayca dönüştürme yapmasını sağlayın.",
      "product3_content": "JavaScript uygulamalarınızın, Microsoft Office, PDF, HTML, resimler ve diğerleri de dahil olmak üzere tüm endüstri standardı belge formatları arasında kolayca dönüşüm yapmasını sağlayın."
    },
    "api2": {
      "title": "GroupDocs.Conversion Düşük Kod API'leri Dahil Edilir",
      "label": "Tüm Az Kodlu API'leri Görüntüleyin",
      "product1_content": "Uygulamalarınızdaki Microsoft Office, PDF, E-posta, Proje, HTML ve diğer yaygın dosya formatlarını kolayca dönüştürmek için cURL RESTful dosya dönüştürme API'si ile çalışın.",
      "product2_content": ".NET dosya dönüştürme REST API; Microsoft Office, PDF, E-posta, Proje, HTML ve diğer yaygın dosya formatlarını Cloud SDK kullanarak herhangi bir platformda kolayca dönüştürmek için.",
      "product3_content": "Bulut tabanlı Java uygulamalarınızı, REST API'leri çağırabilen herhangi bir platformdaki gelişmiş belge dönüştürme özellikleriyle zenginleştirin."
    },
    "api3": {
      "title": "GroupDocs.Conversion Kodsuz Uygulama İçermez",
      "label": "Tüm Kodsuz Uygulamaları Görüntüle",
      "product1_content": "50'den fazla belge formatını PDF, XLSX, DOCX, XPS, HTML ve daha fazlasına dönüştürün.",
      "product2_content": "Herhangi bir web tarayıcısından DOC'yi XLS formatına dönüştürmek için ücretsiz uygulama.",
      "product3_content": "Word (DOCX) formatına sorunsuz dönüşüm için PDF belgelerinizi yükleyin."
    }
  },
  "testimonial": {
    "designation": "Psikolog",
    "content": "GroupDocs'un büyümesini heyecanla izliyorum. Tüm ekibinizin hızlı yanıt vermesi bana çok yardımcı oldu; GroupDocs'tan biriyle konuştuğumda birinin dinlediğini ve bir şeyler yaptığını garanti edebilirim."
  }
}