{
  "head": {
    "title": "GroupDocs'tan .NET, Java, Bulut API'leri ve Belge Dönüştürme Uygulamaları",
    "description": "Uygulama ve api tabanlı çözümlerle herhangi bir platformda popüler belge ve görüntü dosyası biçimlerini dönüştürün."
  },
  "header": {
    "title": "Belge ve Görüntü Dönüştürme Çözümü",
    "description": "Uygulama ve api tabanlı çözümlerle herhangi bir platformda popüler belge ve görüntü dosyası biçimlerini dönüştürün."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion Yüksek Kod API'leri şunları içerir:",
      "label": "Tüm Yüksek Kod API'lerini Görüntüle",
      "product1_content": "Her tür .NET uygulamasında belgeleri ve görüntü dosyası biçimlerini doğru bir şekilde dönüştürmek için yerel .NET API'si. Dönüştürme sırasında görüntü filigranları eklemeyi destekler.",
      "product2_content": "Java uygulamalarınızın Microsoft Office, PDF, HTML, resimler ve diğerleri dahil olmak üzere tüm endüstri standardı belge biçimleri arasında kolayca dönüştürme yapmasını sağlayın."
    },
    "api2": {
      "title": "GroupDocs.Conversion Düşük Kod API'leri şunları içerir:",
      "label": "Tüm Düşük Kodlu API'leri Görüntüle",
      "product1_content": "Microsoft Office, PDF, E-posta, Proje, HTML ve uygulamalarınızdaki diğer yaygın dosya biçimlerini kolayca dönüştürmek için cURL RESTful dosya dönüştürme API'si ile çalışın.",
      "product2_content": ".NET dosya dönüştürme REST API, Cloud SDK kullanarak herhangi bir platformda Microsoft Office, PDF, E-posta, Proje, HTML ve diğer yaygın dosya biçimlerini kolayca dönüştürmek için.",
      "product3_content": "Bulut tabanlı Java uygulamalarınızı, REST API'lerini çağırabilen herhangi bir platformda gelişmiş belge dönüştürme özellikleriyle zenginleştirin."
    },
    "api3": {
      "title": "GroupDocs.Conversion Kod Yok Uygulamalar İçermez",
      "label": "Tüm Kodsuz Uygulamaları Görüntüle",
      "product1_content": "50'den fazla belge biçimini PDF, XLSX, DOCX, XPS, HTML ve daha fazlasına dönüştürün.",
      "product2_content": "Herhangi bir web tarayıcısından DOC'yi XLS formatına dönüştürmek için ücretsiz uygulama.",
      "product3_content": "Word (DOCX) formatına sorunsuz bir şekilde dönüştürmek için PDF belgelerinizi yükleyin."
    }
  },
  "testimonial": {
    "designation": "Psikolog",
    "content": "GroupDocs'un büyümesini heyecanla izliyorum. Tüm ekibinizin duyarlılığı bana çok yardımcı oldu, GroupDocs'tan biriyle konuştuğumda birinin beni dinlediğini ve bir şeyler olmasını sağladığını garanti edebilirim."
  }
}