{
  "head": {
    "title": "{{ProgLang}} API преобразования документов | Преобразование PDF Word Excel PPTX HTML изображений",
    "description": "{{ProgLang}} API преобразования документов. Конвертируйте PDF, Word, DOC, DOCX, электронные таблицы Excel, PPT, PPTX, HTML, PSD, MPT, MPP, электронную почту, MSG, EMLX, AutoCAD и форматы файлов изображений."
  },
  "header": {
    "title": "{{ProgLang}} API для преобразования более 80 форматов файлов",
    "description": "Простой API для интеграции функций преобразования документов и изображений в приложения {{ProgLang}} без установки какого-либо внешнего программного обеспечения.",
    "button": {
      "label": "Скачать бесплатную пробную версию",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Обзор"
      },
      "button2": {
        "text": "Функции"
      },
      "button3": {
        "text": "Поддерживать"
      },
      "button4": {
        "text": "Живая демонстрация"
      },
      "button5": {
        "text": "Цены"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} сочетает в себе мощный набор API-интерфейсов преобразования документов для отображения изображений и форматов документов в ваших приложениях Java без необходимости установки дополнительного программного обеспечения. Он изначально растрирует документы и преобразует их в SVG+HTML+CSS, чтобы улучшить качество просмотра документов, обеспечивая при этом истинный текст и высокое качество вывода. Используя API рендеринга документов, вы можете быстро просматривать PDF, HTML, XML, Microsoft Office Word, рабочие листы Excel, презентации PowerPoint, электронные письма Outlook, диаграммы Visio, Project, метафайлы, изображения и различные другие форматы файлов с легкостью и меньшими опасностями программирования. Он также может отображать файлы, защищенные паролем, и позволяет получить представление документа в виде HTML, изображения или формы PDF после рендеринга. Наша библиотека преобразования файлов легко настраивается, поскольку позволяет отображать весь документ или отображать его частично для ускорения процесса. С помощью GroupDocs.Conversion for Java API вы можете просматривать страницы, определенный диапазон ячеек в электронной таблице или даже отображать отдельный слой документа в таких форматах, как PDF и CAD.",
    "content2": "{{ProductFullName}} API позволяет отображать документы с аннотациями или комментариями или без них для поддерживаемых форматов файлов. Он также позволяет добавлять каталоги пользовательских шрифтов и извлекать основную информацию о документе, такую ​​как тип файла, расширение, имя, количество страниц и т. д.",
    "tab_one": {
      "description": "Ниже приведен обзор {{ProductFullName}}:",
      "right": {
        "title": "Обзор",
        "content1": "* Автоматическое определение типа файла",
        "content2": "* Преобразование документов",
        "content3": "* Преобразование презентаций",
        "content4": "* Преобразование электронных таблиц",
        "content5": "* Преобразование растровых изображений",
        "content6": "* Преобразование PDF-документов",
        "content7": "* Преобразование других форматов",
        "content8": "* Применить водяной знак",
        "content9": "* Укажите пароль к файлу",
        "content10": "* Настройка преобразования"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} поддерживает преобразование между всеми популярными и часто используемыми [форматами файлов документов](https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Конвертировать из:",
        "content1": "* **Документы**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Электронные таблицы**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Презентации**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Изображения**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Портативный**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Метафайлы**: EMZ, WMZ",
        "content8": "* **Фотошоп**: PSD",
        "content9": "* **Проект**: MPP, MPT, MPX",
        "content10": "* **Перспективы**: PST, OST",
        "content11": "* **Электронная почта**: MSG, EML, EMLX",
        "content12": "* **Диаграммы**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Другое**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Преобразовать в:",
        "content1": "* **Документы**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Электронные таблицы**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Презентации**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Изображения**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Метафайлы**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Диаграммы**: SVGZ",
        "content7": "* **Портативный**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Другое**: доктор медицины"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} поддерживает следующие операционные системы, платформы и менеджеры пакетов:",
      "left": {
        "title1": "Операционные системы",
        "title2": "Поддерживаемые платформы"
      },
      "right": {
        "title1": "Менеджер пакетов",
        "title2": "Среды разработки"
      }
    }
  },
  "features": {
    "title": "Функции {{ProductFullName}}",
    "content1": "Простая интеграция и дозированное лицензирование",
    "content2": "Установите параметр масштабирования по умолчанию при преобразовании в слова, слайды или ячейки",
    "content3": "Преобразование в/из всех популярных форматов растровых изображений и назначение изображения DPI, высоты и ширины",
    "content4": "Преобразование PDF-файлов и изображений в оттенки серого и линеаризация PDF-документов для Интернета",
    "content5": "Укажите уровень закладки, уровень заголовка и расширенный уровень в преобразовании Word в PDF/XPS",
    "content6": "Настройка и размещение водяного знака в преобразованном документе в качестве фона для отображения за текстом",
    "content7": "Рендеринг заголовка электронной почты во время преобразования из электронной почты",
    "content8": "Установка каталогов пользовательских шрифтов и явная загрузка/замена шрифта во время преобразования документа",
    "content9": "Установите шрифт по умолчанию для замены отсутствующих шрифтов для преобразования документов, слайдов и электронных таблиц",
    "content10": "Расширенные методы преобразования для возврата вывода в виде пути или потока ввода-вывода",
    "content11": "Преобразование электронной таблицы с линиями сетки и удаление комментариев из слайдов во время преобразования",
    "content12": "Преобразование определенных страниц документа в формат PDF и преобразование определенного диапазона ячеек в электронные таблицы",
    "content13": "Показать скрытые листы и пропустить пустые строки и столбцы при преобразовании электронных таблиц",
    "content14": "Подсчитайте общее количество страниц документа и установите пароль для незащищенного документа во время преобразования",
    "content15": "Возможность удаления аннотаций и встроенных файлов из PDF",
    "content16": "Создание разметки, совместимой с HTML 5, при преобразовании в HTML",
    "content17": "Автоматическое определение типа источника и возврат всех возможных преобразований при преобразовании из потока",
    "content18": "Возможность вернуть каждую страницу в отдельный поток при преобразовании в PDF или HTML",
    "content19": "Показать/скрыть разметку, комментарии и отслеживать изменения при преобразовании из Word",
    "content20": "Преобразование DOCX в Tiff G3 с возможностью затенения",
    "content21": "Преобразование определенных макетов при преобразовании из документа САПР",
    "content22": "Автоматическое присвоение имен при сохранении преобразованного документа в файл",
    "content23": "Лицензирование по счетчику поддерживается для выставления счетов на основе использования API",
    "content24": "Преобразование диаграмм в форматы файлов текстового редактора",
    "content25": "Добавление номеров страниц при преобразовании HTML в текстовый документ",
    "content26": "Преобразование XML-документов в любой формат без преобразования",
    "content27": "Мониторинг процесса преобразования файлов (начало, завершение) непосредственно из клиентского приложения",
    "more_feature": {
      "title1": "Простое преобразование формата документа с использованием Java",
      "content1": "Вы можете преобразовать формат файла множества типов документов, используя {{ProductFullName}} API. Здесь вам представлены несколько строк кода для выполнения базового преобразования документа с помощью Java.",
      "step_1": "Создайте экземпляр класса Converter и укажите полный путь к файлу.",
      "step_2": "Создайте и установите ConvertOptions для желаемого целевого типа.",
      "step_3": "Вызовите метод Converter.Convert и передайте полный путь и формат в качестве параметра.",
      "title2": "Чтение документа с URL-адреса или пути для преобразования",
      "content2": "Используя {{ProductFullName}} API, вы можете читать входной документ из пути к файлу, а также из URL-адреса. В то время как вы можете сохранить выходной документ в виде файла или отправить вывод непосредственно в поток.",
      "title3": "Комплексная техническая поддержка",
      "content3": "{{ProductFullName}} – это простой и точный API, который вы можете довольно легко интегрировать в свои Java-приложения. Однако, чтобы вы могли быстро приступить к работе, мы также предоставляем простые в использовании примеры кода и исчерпывающую документацию по API."
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion предлагает API преобразования документов для других популярных сред разработки.",
    "solution": {
      "img_alt": "GroupDocs.Conversion для .NET",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".СЕТЬ",
      "link": "/конверсия/нетто/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Загрузить исходный файл {{FROM}} для преобразования",
      "prepare_comment": "Подготовьте параметры преобразования для целевого формата {{TO}}",
      "convert_comment": "Преобразование в формат {{TO}}"
    }
  }
}