{
  "head": {
    "title": ".NET, Java, Cloud API & Apl Penukaran Dokumen oleh GroupDocs",
    "description": "Tukar format fail dokumen dan imej yang popular pada mana-mana platform dengan penyelesaian berasaskan aplikasi dan api."
  },
  "header": {
    "title": "Penyelesaian Penukaran Dokumen dan Imej",
    "description": "Tukar format fail dokumen dan imej yang popular pada mana-mana platform dengan penyelesaian berasaskan aplikasi dan api."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code APIs Include",
      "label": "Lihat Semua API Kod Tinggi",
      "product1_content": "API .NET asli untuk menukar dokumen & format fail imej dengan tepat dalam sebarang jenis aplikasi .NET. Menyokong menambah tera air imej semasa penukaran.",
      "product2_content": "Dayakan aplikasi Java anda untuk menukar dengan mudah antara semua format dokumen standard industri termasuk Microsoft Office, PDF, HTML, imej dan banyak lagi.",
      "product3_content": "Dayakan aplikasi JavaScript anda untuk menukar dengan mudah antara semua format dokumen standard industri termasuk Microsoft Office, PDF, HTML, imej dan banyak lagi."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code APIs Include",
      "label": "Lihat Semua API Kod Rendah",
      "product1_content": "Bekerja dengan API penukaran fail CURL RESTful untuk menukar Microsoft Office, PDF, E-mel, Projek, HTML dan format fail biasa lain dalam aplikasi anda dengan mudah.",
      "product2_content": "Penukaran fail .NET REST API untuk menukar Microsoft Office, PDF, E-mel, Projek, HTML dan format fail biasa lain dengan mudah pada mana-mana platform menggunakan Cloud SDK.",
      "product3_content": "Perkayakan aplikasi Java berasaskan awan anda dengan ciri penukaran dokumen lanjutan pada mana-mana platform yang mampu memanggil API REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion No Code Apps Include",
      "label": "Lihat Semua Apl Tanpa Kod",
      "product1_content": "Tukar lebih daripada 50 format dokumen kepada PDF, XLSX, DOCX, XPS, HTML dan banyak lagi.",
      "product2_content": "Aplikasi percuma untuk menukar format DOC kepada XLS daripada mana-mana pelayar web.",
      "product3_content": "Muat naik dokumen PDF anda untuk penukaran lancar kepada format Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Pakar psikologi",
    "content": "Saya teruja melihat pertumbuhan GroupDocs. Responsif pasukan penuh anda telah banyak membantu saya, apabila saya bercakap dengan seseorang di GroupDocs, saya boleh menjamin bahawa seseorang sedang mendengar dan membuat perkara berlaku."
  }
}