{
  "head": {
    "title": ".NET, Java, Cloud API-k és dokumentumkonverziós alkalmazások a GroupDocstól",
    "description": "Konvertálja a népszerű dokumentum- és képfájlformátumokat bármilyen platformon alkalmazás- és api-alapú megoldásokkal."
  },
  "header": {
    "title": "Dokumentum- és képkonverziós megoldás",
    "description": "Konvertálja a népszerű dokumentum- és képfájlformátumokat bármilyen platformon alkalmazás- és api-alapú megoldásokkal."
  },
  "apis": {
    "api1": {
      "title": "A GroupDocs.Conversion High Code API-k magukban foglalják",
      "label": "Az összes High Code API megtekintése",
      "product1_content": "Natív .NET API a dokumentumok és képfájlok formátumának pontos konvertálásához bármilyen típusú .NET alkalmazásban. Támogatja a kép vízjelek hozzáadását az átalakítás során.",
      "product2_content": "Engedélyezze Java-alkalmazásai számára, hogy könnyedén konvertáljanak az iparági szabványos dokumentumformátumok között, beleértve a Microsoft Office-t, a PDF-t, a HTML-t, a képeket és sok mást.",
      "product3_content": "Engedélyezze JavaScript-alkalmazásai számára, hogy könnyedén konvertáljanak az iparági szabványos dokumentumformátumok között, beleértve a Microsoft Office-t, a PDF-t, a HTML-t, a képeket és sok mást."
    },
    "api2": {
      "title": "A GroupDocs.Conversion alacsony kódú API-jai közé tartozik",
      "label": "Az összes alacsony kódú API megtekintése",
      "product1_content": "A cURL RESTful fájlkonverziós API segítségével könnyedén konvertálhatja alkalmazásaiban a Microsoft Office, PDF, E-mail, Project, HTML és más gyakori fájlformátumokat.",
      "product2_content": ".NET fájlkonverziós REST API a Microsoft Office, PDF, e-mail, projekt, HTML és más gyakori fájlformátumok egyszerű konvertálásához bármely platformon a Cloud SDK használatával.",
      "product3_content": "Gazdagítsa felhőalapú Java-alkalmazásait fejlett dokumentumkonverziós funkciókkal bármely olyan platformon, amely képes REST API-k hívására."
    },
    "api3": {
      "title": "GroupDocs.Conversion Nincsenek kódalkalmazások",
      "label": "Az összes kód nélküli alkalmazás megtekintése",
      "product1_content": "Több mint 50 dokumentumformátum konvertálása PDF, XLSX, DOCX, XPS, HTML és sok más formátumba.",
      "product2_content": "Ingyenes alkalmazás a DOC XLS formátumba konvertálásához bármely webböngészőből.",
      "product3_content": "Töltse fel PDF-dokumentumait a Word (DOCX) formátumba való zökkenőmentes konvertáláshoz."
    }
  },
  "testimonial": {
    "designation": "Pszichológus",
    "content": "Izgatottan figyelem a GroupDocs növekedését. A teljes csapat készséges készsége nagy segítségemre volt, ha valakivel beszélek a GroupDocsnál, garantálhatom, hogy valaki figyel, és megcsinálja a dolgokat."
  }
}