{
  "head": {
    "title": "GroupDocs द्वारा .NET, Java, क्लाउड API और दस्तावेज़ रूपांतरण ऐप्स",
    "description": "ऐप और एपीआई-आधारित समाधानों के साथ किसी भी प्लेटफ़ॉर्म पर लोकप्रिय दस्तावेज़ और छवि फ़ाइल स्वरूपों को परिवर्तित करें।"
  },
  "header": {
    "title": "दस्तावेज़ और छवि रूपांतरण समाधान",
    "description": "ऐप और एपीआई-आधारित समाधानों के साथ किसी भी प्लेटफ़ॉर्म पर लोकप्रिय दस्तावेज़ और छवि फ़ाइल स्वरूपों को परिवर्तित करें।"
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion उच्च कोड एपीआई शामिल हैं",
      "label": "सभी हाई कोड एपीआई देखें",
      "product1_content": "किसी भी प्रकार के .NET एप्लिकेशन में दस्तावेज़ों और छवि फ़ाइल स्वरूपों को सटीक रूप से परिवर्तित करने के लिए नेटिव .NET API। रूपांतरण के दौरान छवि वॉटरमार्क जोड़ने का समर्थन करता है।",
      "product2_content": "अपने जावा एप्लिकेशन को Microsoft Office, PDF, HTML, छवियों और कई अन्य सहित सभी उद्योग-मानक दस्तावेज़ प्रारूपों के बीच आसानी से परिवर्तित करने में सक्षम करें।",
      "product3_content": "अपने जावास्क्रिप्ट एप्लिकेशन को माइक्रोसॉफ्ट ऑफिस, पीडीएफ, एचटीएमएल, छवियों और कई अन्य सहित सभी उद्योग-मानक दस्तावेज़ प्रारूपों के बीच आसानी से परिवर्तित करने में सक्षम करें।"
    },
    "api2": {
      "title": "GroupDocs.Conversion निम्न कोड API शामिल हैं",
      "label": "सभी लो कोड एपीआई देखें",
      "product1_content": "अपने एप्लिकेशन में Microsoft Office, PDF, ईमेल, प्रोजेक्ट, HTML और अन्य सामान्य फ़ाइल स्वरूपों को आसानी से परिवर्तित करने के लिए cURL RESTful फ़ाइल रूपांतरण एपीआई के साथ काम करें।",
      "product2_content": "क्लाउड एसडीके का उपयोग करके किसी भी प्लेटफ़ॉर्म पर Microsoft Office, PDF, ईमेल, प्रोजेक्ट, HTML और अन्य सामान्य फ़ाइल स्वरूपों को आसानी से परिवर्तित करने के लिए .NET फ़ाइल रूपांतरण REST API।",
      "product3_content": "REST API को कॉल करने में सक्षम किसी भी प्लेटफ़ॉर्म पर उन्नत दस्तावेज़ रूपांतरण सुविधाओं के साथ अपने क्लाउड-आधारित जावा एप्लिकेशन को समृद्ध करें।"
    },
    "api3": {
      "title": "GroupDocs.Conversion कोई कोड ऐप्स शामिल नहीं है",
      "label": "सभी नो कोड ऐप्स देखें",
      "product1_content": "50 से अधिक दस्तावेज़ प्रारूपों को पीडीएफ, एक्सएलएसएक्स, डीओसीएक्स, एक्सपीएस, एचटीएमएल और अन्य में परिवर्तित करें।",
      "product2_content": "किसी भी वेब ब्राउज़र से DOC को XLS फॉर्मेट में बदलने के लिए निःशुल्क ऐप।",
      "product3_content": "Word (DOCX) प्रारूप में निर्बाध रूपांतरण के लिए अपने पीडीएफ दस्तावेज़ अपलोड करें।"
    }
  },
  "testimonial": {
    "designation": "मनोविज्ञानी",
    "content": "मैं ग्रुपडॉक्स के विकास को उत्साहपूर्वक देख रहा हूं। आपकी पूरी टीम की प्रतिक्रियाशीलता ने मुझे बहुत मदद की है, जब मैं GroupDocs पर किसी से बात करता हूं तो मैं गारंटी दे सकता हूं कि कोई मेरी बात सुन रहा है और काम कर रहा है।"
  }
}