{
  "head": {
    "title": ".NET, Java, APIs de nuvem e aplicativos de conversão de documentos da GroupDocs",
    "description": "Converta formatos populares de documentos e arquivos de imagem em qualquer plataforma com soluções baseadas em aplicativos e API."
  },
  "header": {
    "title": "Solução de conversão de documentos e imagens",
    "description": "Converta formatos populares de documentos e arquivos de imagem em qualquer plataforma com soluções baseadas em aplicativos e API."
  },
  "apis": {
    "api1": {
      "title": "APIs de alto código GroupDocs.Conversion incluem",
      "label": "Ver todas as APIs de alto código",
      "product1_content": "API .NET nativa para converter com precisão documentos e formatos de arquivo de imagem em qualquer tipo de aplicativo .NET. Suporta adição de marcas d'água de imagem durante a conversão.",
      "product2_content": "Permita que seus aplicativos Java convertam facilmente entre todos os formatos de documentos padrão do setor, incluindo Microsoft Office, PDF, HTML, imagens e muitos outros.",
      "product3_content": "Permita que seus aplicativos JavaScript convertam facilmente entre todos os formatos de documentos padrão do setor, incluindo Microsoft Office, PDF, HTML, imagens e muitos outros."
    },
    "api2": {
      "title": "APIs de baixo código GroupDocs.Conversion incluem",
      "label": "Ver todas as APIs de baixo código",
      "product1_content": "Trabalhe com a API de conversão de arquivos RESTful cURL para converter facilmente Microsoft Office, PDF, Email, Project, HTML e outros formatos de arquivo comuns em seus aplicativos.",
      "product2_content": "API REST de conversão de arquivo .NET para converter facilmente Microsoft Office, PDF, Email, Project, HTML e outros formatos de arquivo comuns em qualquer plataforma usando Cloud SDK.",
      "product3_content": "Enriqueça seus aplicativos Java baseados em nuvem com recursos avançados de conversão de documentos em qualquer plataforma capaz de chamar APIs REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion Nenhum aplicativo de código inclui",
      "label": "Ver todos os aplicativos sem código",
      "product1_content": "Converta mais de 50 formatos de documentos para PDF, XLSX, DOCX, XPS, HTML e muito mais.",
      "product2_content": "Aplicativo gratuito para converter o formato DOC para XLS a partir de qualquer navegador da web.",
      "product3_content": "Carregue seus documentos PDF para conversão perfeita para o formato Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psicólogo",
    "content": "Estou acompanhando com entusiasmo o crescimento do GroupDocs. A capacidade de resposta de toda a sua equipe tem me ajudado muito, quando converso com alguém do GroupDocs posso garantir que alguém está ouvindo e fazendo as coisas acontecerem."
  }
}