{
  "head": {
    "title": ".NET, Java, API cloud et applications de conversion de documents par GroupDocs",
    "description": "Convertissez les formats de fichiers de documents et d'images populaires sur n'importe quelle plate-forme avec des solutions basées sur des applications et des API."
  },
  "header": {
    "title": "Solution de conversion de documents et d'images",
    "description": "Convertissez les formats de fichiers de documents et d'images populaires sur n'importe quelle plate-forme avec des solutions basées sur des applications et des API."
  },
  "apis": {
    "api1": {
      "title": "Les API GroupDocs.Conversion High Code incluent",
      "label": "Afficher toutes les API High Code",
      "product1_content": "API .NET native pour convertir avec précision les documents et les formats de fichiers image dans tous les types d'application .NET. Prend en charge l'ajout de filigranes d'image lors de la conversion.",
      "product2_content": "Permettez à vos applications Java de convertir facilement entre tous les formats de documents standard de l'industrie, y compris Microsoft Office, PDF, HTML, images et bien d'autres."
    },
    "api2": {
      "title": "Les API GroupDocs.Conversion Low Code incluent",
      "label": "Afficher toutes les API Low Code",
      "product1_content": "Travaillez avec l'API de conversion de fichiers cURL RESTful pour convertir facilement Microsoft Office, PDF, e-mail, projet, HTML et d'autres formats de fichiers courants dans vos applications.",
      "product2_content": "API REST .NET Document Viewer pour restituer avec précision des documents vers et depuis des formats de fichiers largement utilisés sur n'importe quelle plate-forme utilisant le SDK Cloud.",
      "product3_content": "Enrichissez vos applications Java basées sur le cloud avec des fonctionnalités avancées de conversion de documents sur n'importe quelle plate-forme capable d'appeler des API REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion Aucune application de code n'inclut",
      "label": "Voir toutes les applications sans code",
      "product1_content": "Convertissez plus de 50 formats de documents en PDF, XLSX, DOCX, XPS, HTML et plus encore.",
      "product2_content": "Application gratuite pour convertir le format DOC au format XLS à partir de n'importe quel navigateur Web.",
      "product3_content": "Téléchargez vos documents PDF pour une conversion transparente au format Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psychologue",
    "content": "Je regarde avec enthousiasme la croissance de GroupDocs. La réactivité de toute votre équipe m'a beaucoup aidé, lorsque je parle à quelqu'un chez GroupDocs, je peux garantir que quelqu'un écoute et fait bouger les choses."
  }
}