{
  "head": {
    "title": "GroupDocsin .NET-, Java-, Cloud API- ja asiakirjamuunnossovellukset",
    "description": "Muunna suosittuja asiakirja- ja kuvatiedostomuotoja millä tahansa alustalla sovellus- ja api-pohjaisilla ratkaisuilla."
  },
  "header": {
    "title": "Asiakirjojen ja kuvien muuntamisratkaisu",
    "description": "Muunna suosittuja asiakirja- ja kuvatiedostomuotoja millä tahansa alustalla sovellus- ja api-pohjaisilla ratkaisuilla."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API:t sisältävät",
      "label": "Näytä kaikki High Code API:t",
      "product1_content": "Alkuperäinen .NET-sovellusliittymä muuntaa asiakirjoja ja kuvatiedostomuotoja tarkasti kaikentyyppisissä .NET-sovelluksissa. Tukee kuvien vesileimojen lisäämistä muuntamisen aikana.",
      "product2_content": "Salli Java-sovellusten muuntaminen helposti kaikkien alan standardidokumenttimuotojen välillä, mukaan lukien Microsoft Office, PDF, HTML, kuvat ja monet muut.",
      "product3_content": "Salli JavaScript-sovellusten muuntaminen helposti kaikkien alan standardidokumenttimuotojen välillä, mukaan lukien Microsoft Office, PDF, HTML, kuvat ja monet muut."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API:t sisältävät",
      "label": "Näytä kaikki Low Code API:t",
      "product1_content": "Työskentele cURL RESTful -tiedostomuunnossovellusliittymän kanssa muuntaessasi helposti Microsoft Officen, PDF:n, sähköpostin, Projectin, HTML:n ja muut yleiset tiedostomuodot sovelluksissasi.",
      "product2_content": ".NET-tiedostojen muunnos REST-sovellusliittymä muuntaa helposti Microsoft Officen, PDF:n, sähköpostin, Projectin, HTML:n ja muita yleisiä tiedostomuotoja millä tahansa alustalla Cloud SDK:n avulla.",
      "product3_content": "Rikastuta pilvipohjaisia ​​Java-sovelluksiasi edistyneillä asiakirjojen muunnosominaisuuksilla millä tahansa alustalla, joka pystyy kutsumaan REST-sovellusliittymiä."
    },
    "api3": {
      "title": "GroupDocs.Conversion Ei koodisovelluksia",
      "label": "Näytä kaikki koodittomat sovellukset",
      "product1_content": "Muunna yli 50 asiakirjamuotoa PDF-, XLSX-, DOCX-, XPS-, HTML- ja moniin muihin muotoihin.",
      "product2_content": "Ilmainen sovellus DOC:n muuntamiseen XLS-muotoon mistä tahansa verkkoselaimesta.",
      "product3_content": "Lataa PDF-dokumentit saumattomasti Word (DOCX) -muotoon muuntamista varten."
    }
  },
  "testimonial": {
    "designation": "Psykologi",
    "content": "Seuraan innolla GroupDocsin kasvua. Koko tiimisi reagointikyky on auttanut minua suuresti, kun puhun jonkun kanssa GroupDocsista, voin taata, että joku kuuntelee ja saa asioita tapahtumaan."
  }
}