{
  "head": {
    "title": ".NET, Java, Cloud API'er og dokumentkonverteringsapps fra GroupDocs",
    "description": "Konverter populære dokument- og billedfilformater på enhver platform med app- og api-baserede løsninger."
  },
  "header": {
    "title": "Dokument- og billedkonverteringsløsning",
    "description": "Konverter populære dokument- og billedfilformater på enhver platform med app- og api-baserede løsninger."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API'er inkluderer",
      "label": "Se alle High Code API'er",
      "product1_content": "Native .NET API til nøjagtigt at konvertere dokumenter og billedfilformater i alle typer .NET-applikationer. Understøtter tilføjelse af billedvandmærker under konvertering.",
      "product2_content": "Giv dine Java-applikationer mulighed for nemt at konvertere mellem alle branchestandarddokumentformater, herunder Microsoft Office, PDF, HTML, billeder og mange andre.",
      "product3_content": "Sæt dine JavaScript-applikationer i stand til nemt at konvertere mellem alle industristandarddokumentformater, herunder Microsoft Office, PDF, HTML, billeder og mange andre."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API'er inkluderer",
      "label": "Se alle Low Code API'er",
      "product1_content": "Arbejd med cURL RESTful filkonverterings-API for nemt at konvertere Microsoft Office, PDF, E-mail, Project, HTML og andre almindelige filformater i dine applikationer.",
      "product2_content": ".NET filkonvertering REST API til nemt at konvertere Microsoft Office, PDF, E-mail, Project, HTML og andre almindelige filformater på enhver platform ved hjælp af Cloud SDK.",
      "product3_content": "Berig dine cloud-baserede Java-applikationer med avancerede dokumentkonverteringsfunktioner på enhver platform, der er i stand til at kalde REST API'er."
    },
    "api3": {
      "title": "GroupDocs.Conversion Ingen kodeapps inkluderet",
      "label": "Se alle No Code Apps",
      "product1_content": "Konverter mere end 50 dokumentformater til PDF, XLSX, DOCX, XPS, HTML og mere.",
      "product2_content": "Gratis app til at konvertere DOC til XLS-format fra enhver webbrowser.",
      "product3_content": "Upload dine PDF-dokumenter til problemfri konvertering til Word (DOCX)-format."
    }
  },
  "testimonial": {
    "designation": "Psykolog",
    "content": "Jeg følger med spænding væksten i GroupDocs. Lydhørheden fra hele dit team har hjulpet mig meget, når jeg taler med nogen hos GroupDocs, kan jeg garantere, at nogen lytter og får tingene til at ske."
  }
}