{
  "head": {
    "title": ".NET, Java, Cloud APIs & Aipeanna Tiontaithe Doiciméad ag GroupDocs",
    "description": "Tiontaigh formáidí comhaid tóir doiciméad agus íomhá ar aon ardán le réitigh app agus api-bhunaithe."
  },
  "header": {
    "title": "Réiteach Tiontaithe Doiciméid agus Íomhá",
    "description": "Tiontaigh formáidí comhaid tóir doiciméad agus íomhá ar aon ardán le réitigh app agus api-bhunaithe."
  },
  "apis": {
    "api1": {
      "title": "Áiríonn APIanna Ardchóid GroupDocs.Conversion",
      "label": "Féach ar Gach API Ardchóid",
      "product1_content": "Dúchasach. GLAN API chun doiciméid a thiontú go cruinn agus formáidí comhaid íomhá in aon chineál feidhmchlár .NET. Tacaíochtaí cur watermarks íomhá agus chomhshó.",
      "product2_content": "Cumasaigh d'fheidhmchláir Java a thiontú go héasca idir gach formáid doiciméad de chaighdeán tionscail lena n-áirítear Microsoft Office, PDF, HTML, íomhánna agus go leor eile."
    },
    "api2": {
      "title": "Cuir APIs Cód Ísle GroupDocs.Conversion san áireamh",
      "label": "Féach ar gach API Cód Íseal",
      "product1_content": "Oibrigh le cuRL RESTful tiontú comhad API a thiontú go héasca Microsoft Office, PDF, Ríomhphost, Tionscadal, HTML agus formáidí comhaid coitianta eile i d'fheidhmchláir.",
      "product2_content": "Comhshó comhad NET REST API chun Microsoft Office, PDF, Ríomhphost, Tionscadal, HTML agus formáidí comhaid coitianta eile a thiontú go héasca ar aon ardán ag baint úsáide as Cloud SDK.",
      "product3_content": "Saibhrigh d’fheidhmchláir Java scamall-bhunaithe le hardghnéithe comhshó doiciméad ar aon ardán atá in ann glaoch ar REST APIs."
    },
    "api3": {
      "title": "GroupDocs.Conversion Uimh Cód Apps áireamh",
      "label": "Féach ar All No Code Apps",
      "product1_content": "Tiontaigh níos mó ná 50 formáid doiciméad go PDF, XLSX, DOCX, XPS, HTML agus go leor eile.",
      "product2_content": "Aip saor in aisce chun DOC a thiontú go formáid XLS ó aon bhrabhsálaí gréasáin.",
      "product3_content": "Uaslódáil do dhoiciméid PDF le haghaidh comhshó gan uaim go formáid Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "síceolaí",
    "content": "Táim ar bís ag breathnú ar fhás GroupDocs. Chuidigh freagrúlacht d’fhoireann iomlán go mór liom, nuair a labhraím le duine ag GroupDocs is féidir liom a ráthú go bhfuil duine ag éisteacht agus ag cur rudaí amach."
  }
}