{
  "head": {
    "title": ".NET, Java, Wolk API's en Dokumentomskakelingstoepassings deur GroupDocs",
    "description": "Omskep gewilde dokument- en beeldlêerformate op enige platform met toepassings- en API-gebaseerde oplossings."
  },
  "header": {
    "title": "Oplossing vir dokument- en beeldomskakeling",
    "description": "Omskep gewilde dokument- en beeldlêerformate op enige platform met toepassings- en API-gebaseerde oplossings."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API's sluit in",
      "label": "Bekyk alle hoë kode API's",
      "product1_content": "Native .NET API om dokumente en beeldlêerformate in enige tipe .NET-toepassing akkuraat om te skakel. Ondersteun die byvoeging van beeldwatermerke tydens omskakeling.",
      "product2_content": "Stel jou Java-toepassings in staat om maklik om te skakel tussen alle industriestandaard dokumentformate, insluitend Microsoft Office, PDF, HTML, beelde en vele ander.",
      "product3_content": "Aktiveer jou JavaScript-toepassings om maklik om te skakel tussen alle industriestandaard dokumentformate, insluitend Microsoft Office, PDF, HTML, beelde en vele ander."
    },
    "api2": {
      "title": "GroupDocs.Conversion Lae Kode API's sluit in",
      "label": "Bekyk alle lae kode API's",
      "product1_content": "Werk met cURL RESTful lêer omskakeling API om maklik Microsoft Office, PDF, e-pos, Project, HTML en ander algemene lêerformate in jou toepassings om te skakel.",
      "product2_content": ".NET-lêeromskakeling REST API om maklik Microsoft Office, PDF, e-pos, Project, HTML en ander algemene lêerformate om te skakel op enige platform deur Cloud SDK te gebruik.",
      "product3_content": "Verryk jou wolkgebaseerde Java-toepassings met gevorderde dokumentomskakelingskenmerke op enige platform wat REST API's kan oproep."
    },
    "api3": {
      "title": "GroupDocs.Conversion Geen kode-toepassings sluit in nie",
      "label": "Bekyk Alle No Code Apps",
      "product1_content": "Skakel meer as 50 dokumentformate om na PDF, XLSX, DOCX, XPS, HTML en meer.",
      "product2_content": "Gratis toepassing om DOC na XLS-formaat om te skakel vanaf enige webblaaier.",
      "product3_content": "Laai jou PDF-dokumente op vir naatlose omskakeling na Word (DOCX)-formaat."
    }
  },
  "testimonial": {
    "designation": "Sielkundige",
    "content": "Ek hou opgewonde die groei van GroupDocs dop. Die responsiwiteit van jou volle span het my baie gehelp, wanneer ek met iemand by GroupDocs praat, kan ek waarborg dat iemand luister en dinge laat gebeur."
  }
}