{
  "head": {
    "title": "GroupDocs द्वारा .NET, Java, Cloud API और दस्तावेज़ रूपांतरण ऐप्स",
    "description": "ऐप और एपीआई-आधारित समाधानों के साथ किसी भी प्लेटफ़ॉर्म पर लोकप्रिय दस्तावेज़ और छवि फ़ाइल स्वरूपों को परिवर्तित करें।"
  },
  "header": {
    "title": "दस्तावेज़ और छवि रूपांतरण समाधान",
    "description": "ऐप और एपीआई-आधारित समाधानों के साथ किसी भी प्लेटफ़ॉर्म पर लोकप्रिय दस्तावेज़ और छवि फ़ाइल स्वरूपों को परिवर्तित करें।"
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion उच्च कोड API शामिल करें",
      "label": "सभी हाई कोड API देखें",
      "product1_content": "किसी भी प्रकार के .NET एप्लिकेशन में दस्तावेज़ों और छवि फ़ाइल स्वरूपों को सटीक रूप से परिवर्तित करने के लिए मूल .NET API। रूपांतरण करते समय छवि वॉटरमार्क जोड़ने का समर्थन करता है।",
      "product2_content": "माइक्रोसॉफ्ट ऑफिस, पीडीएफ, एचटीएमएल, छवियों और कई अन्य सहित सभी उद्योग-मानक दस्तावेज़ प्रारूपों के बीच आसानी से कनवर्ट करने के लिए अपने जावा एप्लिकेशन को सक्षम करें।"
    },
    "api2": {
      "title": "GroupDocs.Conversion निम्न कोड API शामिल करें",
      "label": "सभी निम्न कोड API देखें",
      "product1_content": "अपने अनुप्रयोगों में Microsoft Office, PDF, ईमेल, प्रोजेक्ट, HTML और अन्य सामान्य फ़ाइल स्वरूपों को आसानी से परिवर्तित करने के लिए CURL RESTful फ़ाइल रूपांतरण API के साथ कार्य करें।",
      "product2_content": ".NET फ़ाइल रूपांतरण REST API आसानी से Microsoft Office, PDF, ईमेल, प्रोजेक्ट, HTML और अन्य सामान्य फ़ाइल स्वरूपों को क्लाउड एसडीके का उपयोग करके किसी भी प्लेटफ़ॉर्म पर परिवर्तित करने के लिए।",
      "product3_content": "REST API को कॉल करने में सक्षम किसी भी प्लेटफ़ॉर्म पर उन्नत दस्तावेज़ रूपांतरण सुविधाओं के साथ अपने क्लाउड-आधारित जावा एप्लिकेशन को समृद्ध करें।"
    },
    "api3": {
      "title": "GroupDocs.Conversion कोई कोड ऐप्स शामिल नहीं है",
      "label": "सभी देखें नो कोड ऐप्स",
      "product1_content": "50 से अधिक दस्तावेज़ स्वरूपों को PDF, XLSX, DOCX, XPS, HTML और अधिक में कनवर्ट करें।",
      "product2_content": "किसी भी वेब ब्राउजर से DOC को XLS फॉर्मेट में बदलने के लिए फ्री ऐप।",
      "product3_content": "Word (DOCX) प्रारूप में निर्बाध रूपांतरण के लिए अपने PDF दस्तावेज़ अपलोड करें।"
    }
  },
  "testimonial": {
    "designation": "मनोविज्ञानी",
    "content": "मैं GroupDocs के विकास को उत्साह से देख रहा हूं। आपकी पूरी टीम की प्रतिक्रिया ने मुझे बहुत मदद की है, जब मैं GroupDocs पर किसी से बात करता हूं तो मैं गारंटी दे सकता हूं कि कोई सुन रहा है और चीजें कर रहा है।"
  }
}