{
  "head": {
    "title": ".NET, Java, pilve API-d ja dokumentide teisendamise rakendused GroupDocsilt",
    "description": "Teisendage populaarseid dokumendi- ja pildifailivorminguid mis tahes platvormil rakenduste ja api-põhiste lahendustega."
  },
  "header": {
    "title": "Dokumendi ja pildi teisendamise lahendus",
    "description": "Teisendage populaarseid dokumendi- ja pildifailivorminguid mis tahes platvormil rakenduste ja api-põhiste lahendustega."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API-d hõlmavad",
      "label": "Vaadake kõiki kõrge koodiga API-sid",
      "product1_content": "Native .NET API dokumentide ja pildifailivormingute täpseks teisendamiseks mis tahes tüüpi .NET-rakendustes. Toetab kujutise vesimärkide lisamist teisendamise ajal.",
      "product2_content": "Lubage oma Java-rakendustel hõlpsasti teisendada kõigi tööstusstandardite dokumendivormingute vahel, sealhulgas Microsoft Office, PDF, HTML, pildid ja paljud teised."
    },
    "api2": {
      "title": "GroupDocs.Conversion madala koodiga API-d hõlmavad",
      "label": "Vaadake kõiki madala koodiga API-sid",
      "product1_content": "Töötage cURL RESTful failikonversiooni API-ga, et hõlpsasti teisendada oma rakendustes Microsoft Office'i, PDF-i, e-posti, projekti, HTML-i ja muid levinud failivorminguid.",
      "product2_content": ".NET-failide teisendamise REST API, et hõlpsasti teisendada Microsoft Office'i, PDF-i, e-posti, projekti, HTML-i ja muid levinud failivorminguid mis tahes platvormil, kasutades Cloud SDK-d.",
      "product3_content": "Rikastage oma pilvepõhiseid Java-rakendusi täiustatud dokumentide teisendusfunktsioonidega mis tahes platvormil, mis on võimeline kutsuma REST API-sid."
    },
    "api3": {
      "title": "GroupDocs.Conversion Koodirakendusi ei sisalda",
      "label": "Kuva kõik koodita rakendused",
      "product1_content": "Teisendage enam kui 50 dokumendivormingut PDF-i, XLSX-i, DOCX-i, XPS-i, HTML-i ja muudeks vorminguteks.",
      "product2_content": "Tasuta rakendus DOC-i teisendamiseks XLS-vormingusse mis tahes veebibrauserist.",
      "product3_content": "Laadige üles oma PDF-dokumendid, et konverteerida sujuvalt Wordi (DOCX) vormingusse."
    }
  },
  "testimonial": {
    "designation": "Psühholoog",
    "content": "Jälgin põnevusega GroupDocsi kasvu. Teie meeskonna reageerimisvõime on mind palju aidanud. Kui ma kellegagi GroupDocsis räägin, võin garanteerida, et keegi kuulab ja paneb asjad juhtuma."
  }
}