{
  "head": {
    "title": ".NET, Java, Cloud APIer og dokumentkonverteringsapper fra GroupDocs",
    "description": "Konverter populære dokument- og bildefilformater på hvilken som helst plattform med app- og api-baserte løsninger."
  },
  "header": {
    "title": "Dokument- og bildekonverteringsløsning",
    "description": "Konverter populære dokument- og bildefilformater på hvilken som helst plattform med app- og api-baserte løsninger."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code APIer inkluderer",
      "label": "Se alle High Code APIer",
      "product1_content": "Native .NET API for nøyaktig konvertering av dokumenter og bildefilformater i alle typer .NET-applikasjoner. Støtter å legge til bildevannmerker under konvertering.",
      "product2_content": "La Java-applikasjonene dine enkelt konvertere mellom alle industristandard dokumentformater, inkludert Microsoft Office, PDF, HTML, bilder og mange andre.",
      "product3_content": "Aktiver JavaScript-applikasjonene dine til å enkelt konvertere mellom alle industristandard dokumentformater, inkludert Microsoft Office, PDF, HTML, bilder og mange andre."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code APIer inkluderer",
      "label": "Se alle lavkode-APIer",
      "product1_content": "Arbeid med cURL RESTful filkonverterings-API for enkelt å konvertere Microsoft Office, PDF, e-post, Project, HTML og andre vanlige filformater i applikasjonene dine.",
      "product2_content": ".NET filkonvertering REST API for enkelt å konvertere Microsoft Office, PDF, e-post, Project, HTML og andre vanlige filformater på hvilken som helst plattform ved hjelp av Cloud SDK.",
      "product3_content": "Berik dine skybaserte Java-applikasjoner med avanserte dokumentkonverteringsfunksjoner på enhver plattform som kan kalle REST APIer."
    },
    "api3": {
      "title": "GroupDocs.Conversion Ingen kodeapper inkluderer",
      "label": "Se alle No Code-apper",
      "product1_content": "Konverter mer enn 50 dokumentformater til PDF, XLSX, DOCX, XPS, HTML og mer.",
      "product2_content": "Gratis app for å konvertere DOC til XLS-format fra hvilken som helst nettleser.",
      "product3_content": "Last opp PDF-dokumentene dine for sømløs konvertering til Word (DOCX)-format."
    }
  },
  "testimonial": {
    "designation": "Psykolog",
    "content": "Jeg følger spent med på veksten til GroupDocs. Responsen til hele teamet ditt har hjulpet meg veldig, når jeg snakker med noen på GroupDocs kan jeg garantere at noen lytter og får ting til å skje."
  }
}