{
  "head": {
    "title": ".NET, Java, Cloud API-ji i aplikacije za pretvorbu dokumenata tvrtke GroupDocs",
    "description": "Pretvorite popularne formate dokumenata i slikovnih datoteka na bilo kojoj platformi s rješenjima koja se temelje na aplikaciji i API-ju."
  },
  "header": {
    "title": "Rješenje za pretvorbu dokumenata i slika",
    "description": "Pretvorite popularne formate dokumenata i slikovnih datoteka na bilo kojoj platformi s rješenjima koja se temelje na aplikaciji i API-ju."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API-ji uključuju",
      "label": "Pogledajte sve API-je High Code",
      "product1_content": "Izvorni .NET API za točnu pretvorbu dokumenata i formata slikovnih datoteka u sve vrste .NET aplikacija. Podržava dodavanje slikovnih vodenih žigova tijekom pretvorbe.",
      "product2_content": "Omogućite svojim Java aplikacijama jednostavnu pretvorbu između svih standardnih formata dokumenata uključujući Microsoft Office, PDF, HTML, slike i mnoge druge.",
      "product3_content": "Omogućite svojim JavaScript aplikacijama jednostavnu pretvorbu između svih standardnih formata dokumenata uključujući Microsoft Office, PDF, HTML, slike i mnoge druge."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API-ji uključuju",
      "label": "Pogledajte sve API-je s niskim kodom",
      "product1_content": "Radite s cURL RESTful API-jem za pretvorbu datoteka kako biste jednostavno pretvorili Microsoft Office, PDF, Email, Project, HTML i druge uobičajene formate datoteka u svojim aplikacijama.",
      "product2_content": "REST API za pretvorbu .NET datoteka za jednostavno pretvaranje Microsoft Officea, PDF-a, e-pošte, Projecta, HTML-a i drugih uobičajenih formata datoteka na bilo kojoj platformi pomoću Cloud SDK-a.",
      "product3_content": "Obogatite svoje Java aplikacije temeljene na oblaku naprednim značajkama konverzije dokumenata na bilo kojoj platformi koja može pozivati ​​REST API-je."
    },
    "api3": {
      "title": "GroupDocs.Conversion No Code Apps Include",
      "label": "Pogledajte sve aplikacije bez koda",
      "product1_content": "Pretvorite više od 50 formata dokumenata u PDF, XLSX, DOCX, XPS, HTML i više.",
      "product2_content": "Besplatna aplikacija za pretvaranje DOC u XLS format iz bilo kojeg web preglednika.",
      "product3_content": "Učitajte svoje PDF dokumente za besprijekornu konverziju u Word (DOCX) format."
    }
  },
  "testimonial": {
    "designation": "Psiholog",
    "content": "Uzbuđeno gledam rast GroupDocsa. Odaziv vašeg cijelog tima uvelike mi je pomogao, kada razgovaram s nekim u GroupDocsu, mogu jamčiti da me netko sluša i pomaže da se stvari dogode."
  }
}