{
  "head": {
    "title": ".NET, Java, Cloud API και εφαρμογές μετατροπής εγγράφων από το GroupDocs",
    "description": "Μετατρέψτε δημοφιλείς μορφές αρχείων εγγράφων και εικόνων σε οποιαδήποτε πλατφόρμα με λύσεις που βασίζονται σε εφαρμογές και api."
  },
  "header": {
    "title": "Λύση μετατροπής εγγράφων και εικόνας",
    "description": "Μετατρέψτε δημοφιλείς μορφές αρχείων εγγράφων και εικόνων σε οποιαδήποτε πλατφόρμα με λύσεις που βασίζονται σε εφαρμογές και api."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code APIs Include",
      "label": "Προβολή όλων των API High Code",
      "product1_content": "Native .NET API για ακριβή μετατροπή εγγράφων και μορφών αρχείων εικόνας σε οποιονδήποτε τύπο εφαρμογής .NET. Υποστηρίζει την προσθήκη υδατογραφημάτων εικόνας κατά τη μετατροπή.",
      "product2_content": "Ενεργοποιήστε τις εφαρμογές σας Java για εύκολη μετατροπή μεταξύ όλων των τυποποιημένων μορφών εγγράφων του κλάδου, συμπεριλαμβανομένων των Microsoft Office, PDF, HTML, εικόνων και πολλών άλλων.",
      "product3_content": "Ενεργοποιήστε τις εφαρμογές JavaScript για εύκολη μετατροπή μεταξύ όλων των τυποποιημένων μορφών εγγράφων του κλάδου, συμπεριλαμβανομένων των Microsoft Office, PDF, HTML, εικόνων και πολλών άλλων."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code APIs Include",
      "label": "Προβολή όλων των API χαμηλού κώδικα",
      "product1_content": "Εργαστείτε με το API μετατροπής αρχείων cURL RESTful για να μετατρέψετε εύκολα Microsoft Office, PDF, Email, Project, HTML και άλλες κοινές μορφές αρχείων στις εφαρμογές σας.",
      "product2_content": "API μετατροπής αρχείων .NET REST για εύκολη μετατροπή Microsoft Office, PDF, Email, Project, HTML και άλλες κοινές μορφές αρχείων σε οποιαδήποτε πλατφόρμα χρησιμοποιώντας το Cloud SDK.",
      "product3_content": "Εμπλουτίστε τις εφαρμογές Java που βασίζονται σε σύννεφο με προηγμένες δυνατότητες μετατροπής εγγράφων σε οποιαδήποτε πλατφόρμα που μπορεί να καλέσει REST API."
    },
    "api3": {
      "title": "GroupDocs.Conversion Δεν περιλαμβάνονται οι εφαρμογές κώδικα",
      "label": "Προβολή όλων των εφαρμογών χωρίς κώδικα",
      "product1_content": "Μετατρέψτε περισσότερες από 50 μορφές εγγράφων σε PDF, XLSX, DOCX, XPS, HTML και άλλα.",
      "product2_content": "Δωρεάν εφαρμογή για μετατροπή DOC σε μορφή XLS από οποιοδήποτε πρόγραμμα περιήγησης ιστού.",
      "product3_content": "Ανεβάστε τα έγγραφά σας PDF για απρόσκοπτη μετατροπή σε μορφή Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Ψυχολόγος",
    "content": "Παρακολουθώ με ενθουσιασμό την ανάπτυξη του GroupDocs. Η ανταπόκριση της πλήρους ομάδας σας με έχει βοηθήσει πολύ, όταν μιλάω με κάποιον στο GroupDocs μπορώ να εγγυηθώ ότι κάποιος ακούει και κάνει πράγματα να συμβαίνουν."
  }
}