{
  "head": {
    "title": ".NET, Java, Cloud API och dokumentkonverteringsappar från GroupDocs",
    "description": "Konvertera populära dokument- och bildfilformat på valfri plattform med app- och api-baserade lösningar."
  },
  "header": {
    "title": "Dokument- och bildkonverteringslösning",
    "description": "Konvertera populära dokument- och bildfilformat på valfri plattform med app- och api-baserade lösningar."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API:er inkluderar",
      "label": "Visa alla High Code API:er",
      "product1_content": "Native .NET API för att exakt konvertera dokument och bildfilformat i alla typer av .NET-applikationer. Stöder att lägga till bildvattenstämplar under konvertering.",
      "product2_content": "Gör det möjligt för dina Java-applikationer att enkelt konvertera mellan alla industristandardiserade dokumentformat inklusive Microsoft Office, PDF, HTML, bilder och många andra."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API:er inkluderar",
      "label": "Visa alla lågkods-API:er",
      "product1_content": "Arbeta med cURL RESTful filkonverterings-API för att enkelt konvertera Microsoft Office, PDF, E-post, Project, HTML och andra vanliga filformat i dina applikationer.",
      "product2_content": ".NET filkonvertering REST API för att enkelt konvertera Microsoft Office, PDF, e-post, Project, HTML och andra vanliga filformat på vilken plattform som helst med Cloud SDK.",
      "product3_content": "Berika dina molnbaserade Java-applikationer med avancerade dokumentkonverteringsfunktioner på vilken plattform som helst som kan anropa REST API:er."
    },
    "api3": {
      "title": "GroupDocs.Conversion Inga kodappar ingår",
      "label": "Visa alla No Code-appar",
      "product1_content": "Konvertera mer än 50 dokumentformat till PDF, XLSX, DOCX, XPS, HTML och mer.",
      "product2_content": "Gratis app för att konvertera DOC till XLS-format från vilken webbläsare som helst.",
      "product3_content": "Ladda upp dina PDF-dokument för sömlös konvertering till Word (DOCX)-format."
    }
  },
  "testimonial": {
    "designation": "Psykolog",
    "content": "Jag ser med spänning utvecklingen av GroupDocs. Responsen från hela ditt team har hjälpt mig mycket, när jag pratar med någon på GroupDocs kan jag garantera att någon lyssnar och får saker att hända."
  }
}