{
  "head": {
    "title": ".NET, Java, облачни API и приложения за конвертиране на документи от GroupDocs",
    "description": "Конвертирайте популярни файлови формати на документи и изображения на всяка платформа с решения, базирани на приложения и API."
  },
  "header": {
    "title": "Решение за преобразуване на документи и изображения",
    "description": "Конвертирайте популярни файлови формати на документи и изображения на всяка платформа с решения, базирани на приложения и API."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API включва",
      "label": "Вижте всички API с висок код",
      "product1_content": "Вътрешен .NET API за прецизно конвертиране на документи и файлови формати с изображения във всякакви типове .NET приложения. Поддържа добавяне на водни знаци за изображения по време на конвертиране.",
      "product2_content": "Позволете на вашите Java приложения лесно да преобразуват между всички индустриални стандартни формати на документи, включително Microsoft Office, PDF, HTML, изображения и много други."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API включва",
      "label": "Вижте всички API с нисък код",
      "product1_content": "Работете с cURL RESTful API за конвертиране на файлове, за да конвертирате лесно Microsoft Office, PDF, имейл, Project, HTML и други често срещани файлови формати във вашите приложения.",
      "product2_content": ".NET Document Viewer REST API за точно изобразяване на документи към и от широко използвани файлови формати на всяка платформа, използвайки Cloud SDK.",
      "product3_content": "Обогатете вашите базирани в облак Java приложения с разширени функции за конвертиране на документи на всяка платформа, способна да извиква REST API."
    },
    "api3": {
      "title": "GroupDocs.Conversion Без кодови приложения",
      "label": "Вижте всички приложения без код",
      "product1_content": "Конвертирайте повече от 50 формата на документи в PDF, XLSX, DOCX, XPS, HTML и други.",
      "product2_content": "Безплатно приложение за конвертиране на DOC във формат XLS от всеки уеб браузър.",
      "product3_content": "Качете вашите PDF документи за безпроблемно преобразуване във формат Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Психолог",
    "content": "С вълнение наблюдавам растежа на GroupDocs. Отзивчивостта на целия ви екип ми помогна много, когато говоря с някого в GroupDocs, мога да гарантирам, че някой слуша и кара нещата да се случват."
  }
}