{
  "head": {
    "title": "{{ProgLang}} .NET Document Conversion API | Перетворення зображень PDF Word Excel PPTX HTML",
    "description": "{{ProgLang}} API перетворення документів .NET. Конвертуйте PDF Word DOC DOCX, електронні таблиці Excel PPT PPTX, HTML, PSD, MPT MPP, Email MSG EMLX, AutoCAD і формати файлів зображень."
  },
  "header": {
    "title": ".NET API для перетворення понад 80 форматів файлів",
    "description": "Простий API для інтеграції функцій перетворення документів і зображень у програми .NET без встановлення будь-якого зовнішнього програмного забезпечення.",
    "button": {
      "label": "Завантажте безкоштовну пробну версію",
      "link": "https://downloads.groupdocs.com/conversion/net"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Огляд"
      },
      "button2": {
        "text": "особливості"
      },
      "button3": {
        "text": "Підтримка"
      },
      "button4": {
        "text": "Жива демо"
      },
      "button5": {
        "text": "Ціноутворення"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} пропонує простий набір API, що дозволяє розробникам створювати потужні програми для конвертації документів у {{ProgLang}}, ASP.NET та інших пов’язаних з .NET технологіях. API {{ProductFullName}} забезпечує швидке, ефективне та надійне рішення для конвертації файлів для ваших кінцевих користувачів. Він підтримує виконання точних перетворень серед усіх популярних форматів бізнес-документів, включаючи: PDF, HTML, електронну пошту, документи Microsoft Word, електронні таблиці Excel, презентації PowerPoint, Project, Photoshop, CorelDraw, AutoCAD, діаграми, формати файлів растрових зображень та багато іншого. Бібліотека конвертера документів автоматично визначає формат вихідного документа та дає вам усі можливості для перетворення всього документа або окремих сторінок у потрібний вихідний формат. Простіше замінити відсутні шрифти бажаними та додати водяні знаки з текстом або зображенням на будь-яку сторінку документа.",
    "content2": "{{ProductFullName}} можна використовувати для розробки програм у будь-якому середовищі розробки, орієнтованому на платформу .NET. Він сумісний з усіма мовами на основі .NET і підтримує популярні операційні системи (Windows, Linux, MacOS), де можна встановити фреймворки Mono або .NET (включаючи .NET Core).",
    "tab_one": {
      "description": "Нижче наведено огляд {{ProductFullName}}:",
      "right": {
        "title": "Огляд",
        "content1": "* Автоматичне визначення типу файлу",
        "content2": "* Перетворення документів",
        "content3": "* Перетворення презентацій",
        "content4": "* Перетворення електронних таблиць",
        "content5": "* Перетворення растрових зображень",
        "content6": "* Перетворення PDF-документів",
        "content7": "* Перетворення інших форматів",
        "content8": "* Застосувати водяний знак",
        "content9": "* Вкажіть пароль файлу",
        "content10": "* Налаштувати перетворення"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} підтримує конвертацію між усіма популярними та широко використовуваними [форматами файлів документів](https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Перетворити з:",
        "content1": "* **Документи**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Електронні таблиці**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Презентації**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Зображення**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Портативний**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Метафайли**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Проект**: MPP, MPT, MPX",
        "content10": "* **Outlook**: PST, OST",
        "content11": "* **Електронна пошта**: MSG, EML, EMLX",
        "content12": "* **Діаграми**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Інше**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Перетворити на:",
        "content1": "* **Документи**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Електронні таблиці**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Презентації**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Зображення**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Метафайли**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Діаграми**: SVGZ",
        "content7": "* **Портативний**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Інше**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} підтримує такі операційні системи, фреймворки та менеджери пакетів:",
      "left": {
        "title1": "Операційні системи",
        "title2": "Підтримувані фреймворки"
      },
      "right": {
        "title1": "Менеджер пакетів",
        "title2": "Середовища розробки"
      }
    }
  },
  "features": {
    "title": "Функції {{ProductFullName}}",
    "content1": "Проста інтеграція та обмежене ліцензування",
    "content2": "Встановіть параметр масштабування за замовчуванням під час перетворення на слова, слайди чи клітинки",
    "content3": "Перетворюйте в/з усіх популярних форматів растрових зображень і призначайте зображення DPI, висоту та ширину",
    "content4": "Перетворюйте PDF і зображення на градації сірого та лінеаризуйте PDF-документ для Інтернету",
    "content5": "Укажіть рівень закладки, рівень заголовка та розгорнутий рівень у Word для перетворення PDF/XPS",
    "content6": "Налаштуйте та розмістіть водяний знак у конвертованому документі як фон для відображення за текстом",
    "content7": "Відобразити заголовок електронної пошти під час перетворення з електронної пошти",
    "content8": "Встановіть спеціальні каталоги шрифтів і явно завантажте/замініть шрифт під час перетворення документа",
    "content9": "Встановити шрифт за замовчуванням для заміни відсутніх шрифтів для перетворення документів, слайдів і електронних таблиць",
    "content10": "Розширені методи перетворення для повернення результату як шляху або потоку вводу-виводу",
    "content11": "Перетворіть електронну таблицю з лініями сітки та видаліть коментарі зі слайдів під час конвертації",
    "content12": "Перетворення певних сторінок документа у формат PDF і перетворення певного діапазону клітинок у електронні таблиці",
    "content13": "Показувати приховані аркуші та пропускати порожні рядки та стовпці під час конвертації електронних таблиць",
    "content14": "Підрахувати загальну кількість сторінок документа та встановити пароль для незахищеного документа під час перетворення",
    "content15": "Можливість видаляти анотації та вбудовані файли з PDF",
    "content16": "Створіть розмітку, сумісну з HTML 5, під час перетворення на HTML",
    "content17": "Автоматичне визначення типу джерела та повернення всіх можливих перетворень під час перетворення з потоку",
    "content18": "Можливість повертати кожну сторінку в окремому потоці під час конвертації у PDF або HTML",
    "content19": "Показувати/приховувати розмітку, коментарі та відстежувати зміни під час конвертації з Word",
    "content20": "Перетворення DOCX у Tiff G3 із опцією затінення",
    "content21": "Конвертуйте певні макети під час конвертації з документа САПР",
    "content22": "Автоматичне присвоєння імен під час збереження перетвореного документа у файл",
    "content23": "Ліцензійне ліцензування Підтримується виставлення рахунків на основі використання API",
    "content24": "Перетворення діаграм у формати файлів обробки тексту",
    "content25": "Додайте номери сторінок під час перетворення HTML у текстовий документ",
    "content26": "Перетворюйте XML-документи в будь-який формат без перетворення",
    "content27": "Відстежуйте хід перетворення файлу (початок, кінець) безпосередньо з клієнтської програми",
    "more_feature": {
      "title1": "Легко конвертуйте формати документів",
      "content1": "За допомогою {{ProductFullName}} конвертувати формат файлу документа дуже легко. У наступному прикладі показано, як конвертувати файл PDF у файл DOC за допомогою {{ProgLang}}:",
      "step_1": "Створіть екземпляр класу Converter і надайте файлу повний шлях",
      "step_2": "Створіть і встановіть ConvertOptions для потрібного цільового типу.",
      "step_3": "Викличте метод Converter.Convert і передайте повний шлях і формат як параметр",
      "title2": "Перетворення у формати зображень",
      "content2": "{{ProductFullName}} можна використовувати для розробки програм у будь-якому середовищі розробки, орієнтованому на платформу .NET. Він сумісний з усіма мовами на основі .NET і підтримує популярні операційні системи (Windows, Linux, MacOS), де можна встановити фреймворки Mono або .NET (включаючи .NET Core).",
      "title3": "Підтримує різні типи форматів PDF",
      "content3": "API {{ProductFullName}} підтримує перетворення документів у такі типи/формати PDF:"
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion пропонує API перетворення документів для інших популярних середовищ розробки",
    "solution": {
      "img_alt": "GroupDocs.Конверсія для Java",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-java.png",
      "platform": "Java",
      "link": "/перетворення/java/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Завантажте вихідний файл {{FROM}} для перетворення",
      "prepare_comment": "Підготуйте параметри перетворення для цільового формату {{TO}}",
      "convert_comment": "Перетворити у формат {{TO}}"
    }
  }
}