{
  "head": {
    "title": ".NET, Java, облачные API и приложения для преобразования документов от GroupDocs",
    "description": "Преобразование популярных форматов файлов документов и изображений на любой платформе с помощью приложений и решений на основе API."
  },
  "header": {
    "title": "Решение для преобразования документов и изображений",
    "description": "Преобразование популярных форматов файлов документов и изображений на любой платформе с помощью приложений и решений на основе API."
  },
  "apis": {
    "api1": {
      "title": "API High Code GroupDocs.Conversion включают",
      "label": "Просмотреть все API High Code",
      "product1_content": "Собственный .NET API для точного преобразования форматов файлов документов и изображений в любых типах приложений .NET. Поддерживает добавление водяных знаков изображения во время преобразования.",
      "product2_content": "Позвольте своим Java-приложениям легко конвертировать между всеми стандартными форматами документов, включая Microsoft Office, PDF, HTML, изображения и многие другие."
    },
    "api2": {
      "title": "API-интерфейсы GroupDocs.Conversion Low Code включают",
      "label": "Просмотреть все API с низким кодом",
      "product1_content": "Работайте с API преобразования файлов cURL RESTful, чтобы легко конвертировать Microsoft Office, PDF, электронную почту, проект, HTML и другие распространенные форматы файлов в ваших приложениях.",
      "product2_content": "Преобразование файлов .NET REST API для простого преобразования файлов Microsoft Office, PDF, электронной почты, проектов, HTML и других распространенных форматов на любой платформе с помощью Cloud SDK.",
      "product3_content": "Дополните свои облачные Java-приложения расширенными функциями преобразования документов на любой платформе, способной вызывать REST API."
    },
    "api3": {
      "title": "GroupDocs.Conversion Приложения без кода включают",
      "label": "Просмотреть все приложения без кода",
      "product1_content": "Преобразование более 50 форматов документов в PDF, XLSX, DOCX, XPS, HTML и другие.",
      "product2_content": "Бесплатное приложение для преобразования DOC в формат XLS из любого веб-браузера.",
      "product3_content": "Загрузите свои PDF-документы для плавного преобразования в формат Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Психолог",
    "content": "Я с волнением наблюдаю за ростом GroupDocs. Отзывчивость всей вашей команды очень помогла мне, когда я разговариваю с кем-то в GroupDocs, я могу гарантировать, что кто-то слушает и делает все возможное."
  }
}