{
  "head": {
    "title": ".NET, Java, Cloud API және GroupDocs құжатты түрлендіру қолданбалары",
    "description": "Қолданба және api негізіндегі шешімдер арқылы кез келген платформада танымал құжат пен кескін файл пішімдерін түрлендіріңіз."
  },
  "header": {
    "title": "Құжатты және кескінді түрлендіру шешімі",
    "description": "Қолданба және api негізіндегі шешімдер арқылы кез келген платформада танымал құжат пен кескін файл пішімдерін түрлендіріңіз."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion Жоғары код API интерфейстерін қамтиды",
      "label": "Барлық жоғары код API интерфейстерін қараңыз",
      "product1_content": ".NET қолданбасының кез келген түріндегі құжаттар мен кескін файл пішімдерін дәл түрлендіру үшін Native .NET API. Түрлендіру кезінде сурет су белгілерін қосуды қолдайды.",
      "product2_content": "Microsoft Office, PDF, HTML, кескіндер және т.б. қоса алғанда, барлық салалық стандартты құжат пішімдерін оңай түрлендіру үшін Java қолданбаларын қосыңыз."
    },
    "api2": {
      "title": "GroupDocs.Conversion төмен код API интерфейстері кіреді",
      "label": "Барлық төмен код API интерфейстерін қараңыз",
      "product1_content": "Microsoft Office, PDF, Email, Project, HTML және қолданбаларыңыздағы басқа жалпы файл пішімдерін оңай түрлендіру үшін cURL RESTful файлды түрлендіру API интерфейсімен жұмыс жасаңыз.",
      "product2_content": ".NET файлды түрлендіру REST API Microsoft Office, PDF, Email, Project, HTML және басқа жалпы файл пішімдерін Cloud SDK көмегімен кез келген платформада оңай түрлендіру.",
      "product3_content": "Бұлтқа негізделген Java қолданбаларын REST API интерфейсіне қоңырау шала алатын кез келген платформада кеңейтілген құжаттарды түрлендіру мүмкіндіктерімен байытыңыз."
    },
    "api3": {
      "title": "GroupDocs.Conversion Код қолданбаларын қамтымайды",
      "label": "Барлық кодсыз қолданбаларды қараңыз",
      "product1_content": "50-ден астам құжат пішімін PDF, XLSX, DOCX, XPS, HTML және т.б. түрлендіріңіз.",
      "product2_content": "Кез келген веб-шолғыштан DOC пішіміне XLS түрлендіруге арналған тегін қолданба.",
      "product3_content": "Word (DOCX) пішіміне үздіксіз түрлендіру үшін PDF құжаттарыңызды жүктеп салыңыз."
    }
  },
  "testimonial": {
    "designation": "Психолог",
    "content": "Мен GroupDocs-тің өсуін қуанышпен бақылап отырмын. Толық командаңыздың жауап беруі маған көп көмектесті, мен GroupDocs-те біреумен сөйлескенде, біреу тыңдап, жағдайды жасап жатқанына кепілдік бере аламын."
  }
}