{
  "head": {
    "title": ".NET, Java, API-uri cloud și aplicații de conversie a documentelor de la GroupDocs",
    "description": "Convertiți formate populare de documente și fișiere imagine pe orice platformă cu soluții bazate pe aplicații și API."
  },
  "header": {
    "title": "Soluție de conversie a documentelor și imaginilor",
    "description": "Convertiți formate populare de documente și fișiere imagine pe orice platformă cu soluții bazate pe aplicații și API."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API-urile includ",
      "label": "Vedeți toate API-urile High Code",
      "product1_content": "API nativ .NET pentru a converti documentele și formatele de fișiere imagine în orice tip de aplicație .NET. Acceptă adăugarea de filigrane de imagine în timpul conversiei.",
      "product2_content": "Permiteți aplicațiilor dvs. Java să convertească cu ușurință între toate formatele de documente standard din industrie, inclusiv Microsoft Office, PDF, HTML, imagini și multe altele."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API-urile includ",
      "label": "Vedeți toate API-urile Low Code",
      "product1_content": "Lucrați cu API-ul de conversie a fișierelor cURL RESTful pentru a converti cu ușurință Microsoft Office, PDF, Email, Project, HTML și alte formate de fișiere comune în aplicațiile dvs.",
      "product2_content": "API REST de conversie a fișierelor .NET pentru a converti cu ușurință Microsoft Office, PDF, Email, Project, HTML și alte formate de fișiere comune pe orice platformă folosind Cloud SDK.",
      "product3_content": "Îmbogățiți aplicațiile Java bazate pe cloud cu funcții avansate de conversie a documentelor pe orice platformă capabilă să apeleze API-uri REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion Aplicațiile fără cod includ",
      "label": "Vizualizați toate aplicațiile fără cod",
      "product1_content": "Convertiți peste 50 de formate de document în PDF, XLSX, DOCX, XPS, HTML și multe altele.",
      "product2_content": "Aplicație gratuită pentru a converti DOC în format XLS din orice browser web.",
      "product3_content": "Încărcați documentele PDF pentru o conversie fără probleme în format Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psiholog",
    "content": "Urmăresc cu entuziasm creșterea GroupDocs. Capacitatea de răspuns a întregii dvs. echipe m-a ajutat foarte mult, atunci când vorbesc cu cineva de la GroupDocs, vă pot garanta că cineva ascultă și face ca lucrurile să se întâmple."
  }
}