{
  "head": {
    "title": ".NET, Java, хмарні API та програми для перетворення документів від GroupDocs",
    "description": "Перетворюйте популярні формати документів і файлів зображень на будь-якій платформі за допомогою програм і рішень на основі API."
  },
  "header": {
    "title": "Рішення для конвертації документів і зображень",
    "description": "Перетворюйте популярні формати документів і файлів зображень на будь-якій платформі за допомогою програм і рішень на основі API."
  },
  "apis": {
    "api1": {
      "title": "API високого коду GroupDocs.Conversion включає",
      "label": "Переглянути всі API високого коду",
      "product1_content": "Власний .NET API для точного перетворення документів і форматів файлів зображень у будь-які типи програм .NET. Підтримує додавання водяних знаків під час перетворення.",
      "product2_content": "Дозвольте своїм програмам Java легко конвертувати між усіма галузевими стандартними форматами документів, включаючи Microsoft Office, PDF, HTML, зображення та багато інших.",
      "product3_content": "Дозвольте своїм програмам JavaScript легко конвертувати між усіма галузевими стандартними форматами документів, включаючи Microsoft Office, PDF, HTML, зображення та багато інших."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API включає",
      "label": "Переглянути всі API з низьким кодом",
      "product1_content": "Працюйте з API перетворення файлів cURL RESTful, щоб легко конвертувати Microsoft Office, PDF, електронну пошту, Project, HTML та інші поширені формати файлів у ваших програмах.",
      "product2_content": "REST API перетворення файлів .NET для легкого конвертування Microsoft Office, PDF, електронної пошти, Project, HTML та інших поширених форматів файлів на будь-якій платформі за допомогою Cloud SDK.",
      "product3_content": "Збагатіть свої хмарні додатки Java розширеними функціями перетворення документів на будь-якій платформі, яка підтримує REST API."
    },
    "api3": {
      "title": "GroupDocs.Conversion Не включає додатки коду",
      "label": "Переглянути всі програми без коду",
      "product1_content": "Перетворіть понад 50 форматів документів у PDF, XLSX, DOCX, XPS, HTML тощо.",
      "product2_content": "Безкоштовна програма для перетворення формату DOC у формат XLS із будь-якого веб-браузера.",
      "product3_content": "Завантажте PDF-документи для безпроблемного перетворення у формат Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Психолог",
    "content": "Я із захопленням спостерігаю за розвитком GroupDocs. Чуйність вашої всієї команди дуже допомогла мені, коли я розмовляю з кимось у GroupDocs, я можу гарантувати, що хтось слухає та сприяє тому, щоб усе відбувалося."
  }
}