{
  "head": {
    "title": ".NET, Java, Cloud API a aplikace pro převod dokumentů od GroupDocs",
    "description": "Převádějte oblíbené formáty souborů dokumentů a obrázků na jakékoli platformě pomocí řešení založených na aplikacích a rozhraních API."
  },
  "header": {
    "title": "Řešení pro převod dokumentů a obrázků",
    "description": "Převádějte oblíbené formáty souborů dokumentů a obrázků na jakékoli platformě pomocí řešení založených na aplikacích a rozhraních API."
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion High Code API zahrnuje",
      "label": "Zobrazit všechna rozhraní API vysokého kódu",
      "product1_content": "Nativní rozhraní .NET API pro přesnou konverzi dokumentů a obrazových formátů v libovolných typech aplikací .NET. Podporuje přidávání vodoznaků během převodu.",
      "product2_content": "Umožněte svým aplikacím Java snadno převádět mezi všemi standardními formáty dokumentů včetně Microsoft Office, PDF, HTML, obrázků a mnoha dalších."
    },
    "api2": {
      "title": "GroupDocs.Conversion Low Code API zahrnují",
      "label": "Zobrazit všechna rozhraní API s nízkým kódem",
      "product1_content": "Pracujte s rozhraním cURL RESTful pro konverzi souborů API pro snadnou konverzi Microsoft Office, PDF, Email, Project, HTML a dalších běžných formátů souborů ve vašich aplikacích.",
      "product2_content": "REST API pro konverzi souborů .NET pro snadnou konverzi Microsoft Office, PDF, Email, Project, HTML a dalších běžných formátů souborů na jakékoli platformě pomocí Cloud SDK.",
      "product3_content": "Obohaťte své cloudové Java aplikace o pokročilé funkce převodu dokumentů na jakékoli platformě schopné volat REST API."
    },
    "api3": {
      "title": "GroupDocs.Conversion Aplikace neobsahuje žádný kód",
      "label": "Zobrazit všechny aplikace bez kódu",
      "product1_content": "Převeďte více než 50 formátů dokumentů do PDF, XLSX, DOCX, XPS, HTML a dalších.",
      "product2_content": "Bezplatná aplikace pro převod DOC do formátu XLS z libovolného webového prohlížeče.",
      "product3_content": "Nahrajte své dokumenty PDF pro bezproblémový převod do formátu Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psycholog",
    "content": "S nadšením sleduji růst GroupDocs. Vstřícnost vašeho celého týmu mi velmi pomohla, když mluvím s někým z GroupDocs, mohu zaručit, že někdo naslouchá a dělá věci."
  }
}