{
  "head": {
    "title": ".NET، Java، Cloud APIs اور Document Conversion Apps by GroupDocs",
    "description": "مقبول دستاویز اور امیج فائل فارمیٹس کو کسی بھی پلیٹ فارم پر ایپ اور اے پی آئی پر مبنی حل کے ساتھ تبدیل کریں۔"
  },
  "header": {
    "title": "دستاویز اور تصویری تبدیلی کا حل",
    "description": "مقبول دستاویز اور امیج فائل فارمیٹس کو کسی بھی پلیٹ فارم پر ایپ اور اے پی آئی پر مبنی حل کے ساتھ تبدیل کریں۔"
  },
  "apis": {
    "api1": {
      "title": "GroupDocs.Conversion ہائی کوڈ APIs شامل ہیں۔",
      "label": "تمام ہائی کوڈ APIs دیکھیں",
      "product1_content": "کسی بھی قسم کی .NET ایپلیکیشن میں دستاویزات اور تصویری فائل فارمیٹس کو درست طریقے سے تبدیل کرنے کے لیے مقامی .NET API۔ تبادلوں کے دوران امیج واٹر مارکس شامل کرنے کی حمایت کرتا ہے۔",
      "product2_content": "مائیکروسافٹ آفس، پی ڈی ایف، ایچ ٹی ایم ایل، امیجز اور بہت سے دیگر سمیت تمام انڈسٹری کے معیاری دستاویز فارمیٹس کے درمیان آسانی سے تبدیل کرنے کے لیے اپنی جاوا ایپلی کیشنز کو فعال کریں۔"
    },
    "api2": {
      "title": "GroupDocs.Conversion کم کوڈ APIs شامل ہیں۔",
      "label": "تمام لو کوڈ APIs دیکھیں",
      "product1_content": "مائیکروسافٹ آفس، پی ڈی ایف، ای میل، پروجیکٹ، ایچ ٹی ایم ایل اور دیگر عام فائل فارمیٹس کو اپنی ایپلی کیشنز میں آسانی سے تبدیل کرنے کے لیے CURL RESTful فائل کنورژن API کے ساتھ کام کریں۔",
      "product2_content": ".NET فائل کنورژن REST API مائیکروسافٹ آفس، پی ڈی ایف، ای میل، پروجیکٹ، ایچ ٹی ایم ایل اور دیگر عام فائل فارمیٹس کو کلاؤڈ SDK کا استعمال کرتے ہوئے کسی بھی پلیٹ فارم پر آسانی سے تبدیل کرنے کے لیے۔",
      "product3_content": "REST APIs کو کال کرنے کے قابل کسی بھی پلیٹ فارم پر اپنی کلاؤڈ بیسڈ جاوا ایپلی کیشنز کو جدید دستاویزات کی تبدیلی کی خصوصیات کے ساتھ تقویت بخشیں۔"
    },
    "api3": {
      "title": "GroupDocs.Conversion کوئی کوڈ ایپس شامل نہیں ہے۔",
      "label": "تمام کوئی کوڈ ایپس دیکھیں",
      "product1_content": "50 سے زیادہ دستاویز کے فارمیٹس کو PDF، XLSX، DOCX، XPS، HTML اور مزید میں تبدیل کریں۔",
      "product2_content": "کسی بھی ویب براؤزر سے DOC کو XLS فارمیٹ میں تبدیل کرنے کے لیے مفت ایپ۔",
      "product3_content": "ورڈ (DOCX) فارمیٹ میں ہموار تبدیلی کے لیے اپنے پی ڈی ایف دستاویزات اپ لوڈ کریں۔"
    }
  },
  "testimonial": {
    "designation": "ماہر نفسیات",
    "content": "میں پرجوش طریقے سے GroupDocs کی ترقی کو دیکھ رہا ہوں۔ آپ کی پوری ٹیم کے ردعمل نے میری بہت مدد کی ہے، جب میں GroupDocs پر کسی سے بات کرتا ہوں تو میں اس بات کی ضمانت دے سکتا ہوں کہ کوئی سن رہا ہے اور چیزیں بنا رہا ہے۔"
  }
}