{
  "head": {
    "title": ".NET, Java, Cloud API-ji in aplikacije za pretvorbo dokumentov GroupDocs",
    "description": "Pretvorite priljubljene formate dokumentov in slikovnih datotek na katero koli platformo z rešitvami, ki temeljijo na aplikacijah in API-jih."
  },
  "header": {
    "title": "Rešitev za pretvorbo dokumentov in slik",
    "description": "Pretvorite priljubljene formate dokumentov in slikovnih datotek na katero koli platformo z rešitvami, ki temeljijo na aplikacijah in API-jih."
  },
  "apis": {
    "api1": {
      "title": "API-ji GroupDocs.Conversion High Code vključujejo",
      "label": "Oglejte si vse API-je High Code",
      "product1_content": "Native .NET API za natančno pretvorbo dokumentov in formatov slikovnih datotek v vseh vrstah aplikacij .NET. Podpira dodajanje slikovnih vodnih žigov med pretvorbo.",
      "product2_content": "Omogočite svojim aplikacijam Java enostavno pretvorbo med vsemi industrijskimi standardnimi formati dokumentov, vključno z Microsoft Office, PDF, HTML, slikami in številnimi drugimi."
    },
    "api2": {
      "title": "API-ji GroupDocs.Conversion Low Code vključujejo",
      "label": "Oglejte si vse API-je z nizko kodo",
      "product1_content": "Delajte z API-jem za pretvorbo datotek cURL RESTful za preprosto pretvorbo datotek Microsoft Office, PDF, e-pošte, Project, HTML in drugih običajnih formatov datotek v vaših aplikacijah.",
      "product2_content": "API REST za pretvorbo datotek .NET za preprosto pretvorbo Microsoft Office, PDF, e-pošte, Project, HTML in drugih običajnih formatov datotek na kateri koli platformi z uporabo Cloud SDK.",
      "product3_content": "Obogatite svoje aplikacije Java v oblaku z naprednimi funkcijami za pretvorbo dokumentov na kateri koli platformi, ki lahko kliče API-je REST."
    },
    "api3": {
      "title": "GroupDocs.Conversion Brez aplikacij za kodo",
      "label": "Oglejte si vse aplikacije brez kode",
      "product1_content": "Pretvorite več kot 50 formatov dokumentov v PDF, XLSX, DOCX, XPS, HTML in druge.",
      "product2_content": "Brezplačna aplikacija za pretvorbo DOC v format XLS iz katerega koli spletnega brskalnika.",
      "product3_content": "Naložite svoje dokumente PDF za brezhibno pretvorbo v format Word (DOCX)."
    }
  },
  "testimonial": {
    "designation": "Psiholog",
    "content": "Navdušeno opazujem rast GroupDocs. Odzivnost vaše celotne ekipe mi je zelo pomagala, ko se pogovarjam z nekom v GroupDocs, lahko zagotovim, da me nekdo posluša in skrbi za dogajanje."
  }
}