{
  "code_samples": {
    "title": "Cóid samplaí",
    "description": "Úsáideann roinnt cásanna de ghnáth GroupDocs.Conversion le haghaidh oibríochtaí .NET",
    "sample_1": {
      "title": "Tiontaigh PDF chun íomhá",
      "content_1": "Is éard atá i gceist le cás coitianta ná doiciméad PDF iomlán nó leathanaigh ar leith a thiontú ina bhailiúchán íomhánna. Cuireann GroupDocs.Conversion le haghaidh .NET an cumas PDFs a thiontú go formáidí éagsúla íomhá, mar TIFF, JPG, PNG, GIF, BMP, agus go leor eile.",
      "content_2": "Murab ionann agus tiontuithe eile, éilíonn an próiseas seo go ndearbhaítear toscaire SavePageStream, a shonraíonn formáid ainmniúcháin na n-íomhánna sábháilte. Is féidir leat an fhormáid íomhá is fearr leat a roghnú ag baint úsáide as an rang ImageFileType.",
      "code_title": "Tiontaigh PDF go PNG in C #",
      "comment_1": "Íoslódáil an comhad PDF foinse",
      "comment_2": "Socraigh na roghanna tiontaithe agus sonraigh an cineál íomhá aschuir",
      "comment_3": "Tiontaigh gach leathanach de dhoiciméad PDF go PNG"
    },
    "sample_2": {
      "title": "Tiontaigh teascán de dhoiciméad mór",
      "content_1": "Le GroupDocs.Conversion do .NET, is féidir leat leathanaigh ar leith a thiontú ó dhoiciméad fada gan stró.",
      "content_2": "Tá dhá mhodh agat chun é seo a bhaint amach, ag brath ar do riachtanais. Is féidir leat raon leathan leathanach a thiontú nó leathanaigh ar leith a thiontú.",
      "code_title_1": "Tiontaigh DOCX (leathanaigh 2-4) go PDF in C#",
      "comment_1": "Íoslódáil an comhad foinse DOCX",
      "comment_2": "Socraigh na roghanna tiontaithe agus sonraigh an raon leathanaigh atá le rindreáil",
      "comment_3": "Tiontaigh leathanaigh 2-4 go PDF"
    },
    "sample_3": {
      "title": "Comhréir líofa: Cur chuige sruthlínithe",
      "content_1": "Cuireann comhréir líofa nodaireacht gonta ar fáil do ghníomhartha coitianta laistigh den GroupDocs.Conversion le haghaidh .NET API.",
      "content_2": "Léiríonn na samplaí cóid thíos conas an chomhréir líofa a ghiaráil:",
      "code_title_1": "Tiontaigh DOCX go PDF in C# ag baint úsáide as comhréir líofa"
    }
  }
}