{
  "code_samples": {
    "title": "კოდის ნიმუშები",
    "description": "ზოგიერთი იყენებს ტიპიური GroupDocs.Conversion-ის შემთხვევებს .NET ოპერაციებისთვის",
    "sample_1": {
      "title": "გადაიყვანეთ PDF სურათად",
      "content_1": "ხშირად ნაცნობი სცენარი მოიცავს მთელი PDF დოკუმენტის ან კონკრეტული გვერდების გადაქცევას სურათების კოლექციად. GroupDocs.Conversion .NET-ისთვის გთავაზობთ PDF-ების გადაქცევის შესაძლებლობას გამოსახულების სხვადასხვა ფორმატში, როგორიცაა TIFF, JPG, PNG, GIF, BMP და სხვა.",
      "content_2": "სხვა კონვერტაციებისგან განსხვავებით, ეს პროცესი მოითხოვს SavePageStream დელეგატის დეკლარაციას, რომელიც განსაზღვრავს შენახული სურათების დასახელების ფორმატს. თქვენ შეგიძლიათ აირჩიოთ სურათის სასურველი ფორმატი ImageFileType კლასის გამოყენებით.",
      "code_title": "გადაიყვანეთ PDF PNG-ში C#-ში",
      "comment_1": "ჩატვირთეთ წყარო PDF ფაილი",
      "comment_2": "დააყენეთ კონვერტაციის პარამეტრები და მიუთითეთ გამომავალი სურათის ტიპი",
      "comment_3": "გადაიყვანეთ PDF დოკუმენტის თითოეული გვერდი PNG-ში"
    },
    "sample_2": {
      "title": "დიდი დოკუმენტის სეგმენტის კონვერტაცია",
      "content_1": "GroupDocs.Conversion-ით .NET-ისთვის, შეგიძლიათ მარტივად გადაიყვანოთ კონკრეტული გვერდები გრძელი დოკუმენტიდან.",
      "content_2": "თქვენ გაქვთ ორი გზა ამის მისაღწევად, თქვენი მოთხოვნებიდან გამომდინარე. თქვენ შეგიძლიათ ან გადაიყვანოთ გვერდების დიაპაზონი ან დააკონვერტიროთ კონკრეტული გვერდები.",
      "code_title_1": "გადაიყვანეთ DOCX (გვერდები 2-4) PDF-ზე C#-ში",
      "comment_1": "ჩატვირთეთ წყარო DOCX ფაილი",
      "comment_2": "დააყენეთ კონვერტაციის ვარიანტები და მიუთითეთ გვერდების რენდერვის დიაპაზონი",
      "comment_3": "გადაიყვანეთ გვერდები 2-4 PDF-ში"
    },
    "sample_3": {
      "title": "გამართული სინტაქსი: გამარტივებული მიდგომა",
      "content_1": "Fluent სინტაქსი გთავაზობთ მოკლე აღნიშვნას საერთო მოქმედებებისთვის GroupDocs-ში. Conversion .NET API-სთვის.",
      "content_2": "ქვემოთ მოყვანილი კოდის ნიმუშები გვიჩვენებს, თუ როგორ უნდა გამოიყენოთ გამართული სინტაქსი:",
      "code_title_1": "გადაიყვანეთ DOCX PDF-ად C#-ში, გამართული სინტაქსის გამოყენებით"
    }
  }
}