{
  "code_samples": {
    "title": "Код үлгілері",
    "description": "Кейбіреулер .NET операциялары үшін әдеттегі GroupDocs.Conversion жағдайларын пайдаланады",
    "sample_1": {
      "title": "PDF форматын кескінге түрлендіру",
      "content_1": "Жиі кездесетін сценарий тұтас PDF құжатын немесе белгілі бір беттерді кескіндер жинағына түрлендіруді қамтиды. .NET үшін GroupDocs.Conversion PDF файлдарын TIFF, JPG, PNG, GIF, BMP және т.б. сияқты әртүрлі кескін пішіміне түрлендіру мүмкіндігін ұсынады.",
      "content_2": "Басқа түрлендірулерден айырмашылығы, бұл процесс сақталған кескіндер үшін атау пішімін көрсететін SavePageStream делегатының мәлімдемесін талап етеді. ImageFileType сыныбы арқылы қалаған кескін пішімін таңдауға болады.",
      "code_title": "C# тілінде PDF форматын PNG форматына түрлендіру",
      "comment_1": "Бастапқы PDF файлын жүктеңіз",
      "comment_2": "Түрлендіру опцияларын орнатыңыз және шығыс кескін түрін көрсетіңіз",
      "comment_3": "PDF құжатының әрбір бетін PNG форматына түрлендіру"
    },
    "sample_2": {
      "title": "Үлкен құжаттың сегментін түрлендіру",
      "content_1": "GroupDocs.Conversion for .NET көмегімен ұзақ құжаттан арнайы беттерді еш қиындықсыз түрлендіруге болады.",
      "content_2": "Сіздің талаптарыңызға байланысты мұны орындаудың екі әдісі бар. Сіз беттердің ауқымын түрлендіруге немесе белгілі бір беттерді түрлендіруге болады.",
      "code_title_1": "DOCX (2-4 беттер) C# тілінде PDF форматына түрлендіру",
      "comment_1": "DOCX бастапқы файлын жүктеңіз",
      "comment_2": "Түрлендіру опцияларын орнатыңыз және көрсетілетін беттер ауқымын көрсетіңіз",
      "comment_3": "2-4 беттерді PDF форматына түрлендіру"
    },
    "sample_3": {
      "title": "Еркін синтаксис: жеңілдетілген тәсіл",
      "content_1": "Еркін синтаксис .NET API үшін GroupDocs.Conversion ішіндегі жалпы әрекеттер үшін қысқаша белгілерді ұсынады.",
      "content_2": "Төмендегі код үлгілері еркін синтаксисті қалай пайдалану керектігін көрсетеді:",
      "code_title_1": "Еркін синтаксисті пайдаланып C# тілінде DOCX-ті PDF форматына түрлендіру"
    }
  }
}