{
  "code_samples": {
    "title": "کوڈ کے نمونے",
    "description": "کچھ .NET آپریشنز کے لیے مخصوص GroupDocs.Conversion کے کیسز استعمال کرتے ہیں۔",
    "sample_1": {
      "title": "پی ڈی ایف کو تصویر میں تبدیل کریں۔",
      "content_1": "عام طور پر سامنے آنے والے منظر نامے میں ایک مکمل پی ڈی ایف دستاویز یا مخصوص صفحات کو تصاویر کے مجموعے میں تبدیل کرنا شامل ہے۔ GroupDocs.Conversion for .NET پی ڈی ایف کو مختلف تصویری فارمیٹس میں تبدیل کرنے کی صلاحیت پیش کرتا ہے، جیسے TIFF، JPG، PNG، GIF، BMP، اور مزید۔",
      "content_2": "دیگر تبادلوں کے برعکس، اس عمل کے لیے SavePageStream مندوب کے اعلان کی ضرورت ہوتی ہے، جو محفوظ کردہ تصاویر کے لیے نام کی شکل کی وضاحت کرتا ہے۔ آپ ImageFileType کلاس کا استعمال کرتے ہوئے اپنی پسند کی تصویر کا فارمیٹ منتخب کر سکتے ہیں۔",
      "code_title": "پی ڈی ایف کو C# میں PNG میں تبدیل کریں",
      "comment_1": "سورس پی ڈی ایف فائل لوڈ کریں۔",
      "comment_2": "کنورٹ کے اختیارات سیٹ کریں اور آؤٹ پٹ امیج کی قسم کی وضاحت کریں۔",
      "comment_3": "پی ڈی ایف دستاویز کے ہر صفحے کو پی این جی میں تبدیل کریں۔"
    },
    "sample_2": {
      "title": "ایک بڑی دستاویز کے ایک حصے کو تبدیل کریں۔",
      "content_1": ".NET کے لیے GroupDocs.Conversion کے ساتھ، آپ آسانی سے ایک طویل دستاویز سے مخصوص صفحات کو تبدیل کر سکتے ہیں۔",
      "content_2": "آپ کی ضروریات پر منحصر ہے، اس کو پورا کرنے کے لیے آپ کے پاس دو طریقے ہیں۔ آپ یا تو صفحات کی ایک رینج کو تبدیل کر سکتے ہیں یا مخصوص صفحات کو تبدیل کر سکتے ہیں۔",
      "code_title_1": "DOCX (صفحات 2-4) کو C# میں PDF میں تبدیل کریں",
      "comment_1": "سورس DOCX فائل لوڈ کریں۔",
      "comment_2": "کنورٹ کے اختیارات سیٹ کریں اور رینڈر کرنے کے لیے صفحات کی رینج کی وضاحت کریں۔",
      "comment_3": "صفحات 2-4 کو پی ڈی ایف میں تبدیل کریں۔"
    },
    "sample_3": {
      "title": "روانی نحو: ایک ہموار طریقہ",
      "content_1": "روانی نحو .NET API کے لیے GroupDocs.Conversion کے اندر مشترکہ کارروائیوں کے لیے ایک جامع اشارے پیش کرتا ہے۔",
      "content_2": "ذیل میں کوڈ کے نمونے ظاہر کرتے ہیں کہ روانی نحو کو کیسے فائدہ اٹھایا جائے:",
      "code_title_1": "روانی نحو کا استعمال کرتے ہوئے DOCX کو C# میں PDF میں تبدیل کریں۔"
    }
  }
}