{
  "code_samples": {
    "title": "कोड नमूने",
    "description": "कुछ लोग .NET संचालन के लिए विशिष्ट GroupDocs.Conversion के मामलों का उपयोग करते हैं",
    "sample_1": {
      "title": "पीडीएफ को छवि में बदलें",
      "content_1": "आम तौर पर सामने आने वाले परिदृश्य में संपूर्ण पीडीएफ दस्तावेज़ या विशिष्ट पृष्ठों को छवियों के संग्रह में परिवर्तित करना शामिल है। .NET के लिए GroupDocs.Conversion पीडीएफ को विभिन्न छवि प्रारूपों, जैसे टीआईएफएफ, जेपीजी, पीएनजी, जीआईएफ, बीएमपी, और अधिक में परिवर्तित करने की क्षमता प्रदान करता है।",
      "content_2": "अन्य रूपांतरणों के विपरीत, इस प्रक्रिया के लिए SavePageStream प्रतिनिधि की घोषणा की आवश्यकता होती है, जो सहेजी गई छवियों के लिए नामकरण प्रारूप निर्दिष्ट करता है। आप ImageFileType क्लास का उपयोग करके अपना पसंदीदा छवि प्रारूप चुन सकते हैं।",
      "code_title": "सी# में पीडीएफ को पीएनजी में बदलें",
      "comment_1": "स्रोत पीडीएफ फाइल लोड करें",
      "comment_2": "कनवर्ट विकल्प सेट करें और आउटपुट छवि प्रकार निर्दिष्ट करें",
      "comment_3": "पीडीएफ दस्तावेज़ के प्रत्येक पृष्ठ को पीएनजी में बदलें"
    },
    "sample_2": {
      "title": "किसी बड़े दस्तावेज़ के एक खंड को रूपांतरित करें",
      "content_1": ".NET के लिए GroupDocs.Conversion के साथ, आप आसानी से एक लंबे दस्तावेज़ से विशिष्ट पृष्ठों को परिवर्तित कर सकते हैं।",
      "content_2": "आपकी आवश्यकताओं के आधार पर इसे पूरा करने के लिए आपके पास दो विधियाँ हैं। आप या तो पृष्ठों की एक श्रृंखला को परिवर्तित कर सकते हैं या विशिष्ट पृष्ठों को परिवर्तित कर सकते हैं।",
      "code_title_1": "DOCX (पेज 2-4) को C# में PDF में कनवर्ट करें",
      "comment_1": "स्रोत DOCX फ़ाइल लोड करें",
      "comment_2": "कनवर्ट विकल्प सेट करें और रेंडर करने के लिए पृष्ठों की श्रेणी निर्दिष्ट करें",
      "comment_3": "पेज 2-4 को पीडीएफ में बदलें"
    },
    "sample_3": {
      "title": "धाराप्रवाह वाक्यविन्यास: एक सुव्यवस्थित दृष्टिकोण",
      "content_1": "फ़्लुएंट सिंटैक्स .NET API के लिए GroupDocs.Conversion के भीतर सामान्य क्रियाओं के लिए एक संक्षिप्त नोटेशन प्रदान करता है।",
      "content_2": "नीचे दिए गए कोड नमूने दर्शाते हैं कि धाराप्रवाह सिंटैक्स का लाभ कैसे उठाया जाए:",
      "code_title_1": "धाराप्रवाह सिंटैक्स का उपयोग करके DOCX को C# में PDF में बदलें"
    }
  }
}