{
  "code_samples": {
    "title": "Nimûneyên kodê",
    "description": "Hinek rewşên tîpîk GroupDocs.Conversion ji bo operasyonên .NET bikar tînin",
    "sample_1": {
      "title": "PDF-ê bi wêneyê veguherînin",
      "content_1": "Senaryoyek ku bi gelemperî rû bi rû tê veguheztina tevahiya belgeyek PDF-ê an rûpelên taybetî li berhevokek wêneyan vedigire. GroupDocs.Conversion ji bo .NET îmkana veguheztina PDF-ê di nav formên wêneyan ên cihêreng, wek TIFF, JPG, PNG, GIF, BMP, û hêj bêtir pêşkêşî dike.",
      "content_2": "Berevajî veguheztinên din, ev pêvajo hewceyê ragihandina nûnerek SavePageStream-ê ye, ku formata navkirinê ji bo wêneyên tomarkirî diyar dike. Hûn dikarin bi karanîna çîna ImageFileType formata wêneya xweya bijare hilbijêrin.",
      "code_title": "PDF-ê di C# de veguherînin PNG",
      "comment_1": "Pelê PDF-a çavkaniyê bar bikin",
      "comment_2": "Vebijarkên veguherînê bicîh bikin û celebê wêneya encam diyar bikin",
      "comment_3": "Her rûpelek belgeya PDF-ê veguherîne PNG"
    },
    "sample_2": {
      "title": "Parçeyek belgeyek mezin biguherînin",
      "content_1": "Bi GroupDocs.Conversion ji bo .NET, hûn dikarin bi hêsanî rûpelên taybetî ji belgeyek dirêj veguherînin.",
      "content_2": "Du awayên we hene ku hûn vê yekê pêk bînin, li gorî daxwazên we. Hûn dikarin rêzek rûpelan veguherînin an jî rûpelên taybetî veguherînin.",
      "code_title_1": "DOCX (rûpelên 2-4) bi C#-ê veguherînin PDF",
      "comment_1": "Pelê çavkaniyê DOCX barkirin",
      "comment_2": "Vebijarkên veguherînê bicîh bikin û rêza rûpelên ku werin pêşkêş kirin diyar bikin",
      "comment_3": "Rûpelên 2-4 veguherînin PDF"
    },
    "sample_3": {
      "title": "Hevoksaziya Fluent: Nêzîkatiyek birêkûpêk",
      "content_1": "Hevoksaziya Fluent ji bo çalakiyên hevpar ên di nav GroupDocs de nîşanek kurt pêşkêşî dike. Veguherandin ji bo .NET API.",
      "content_2": "Nimûneyên kodê yên jêrîn destnîşan dikin ka meriv çawa hevoksaziya herikbar bikar tîne:",
      "code_title_1": "DOCX-ê di C#-ê de bi karanîna hevoksaziya xwerû veguhezînin PDF-ê"
    }
  }
}