{
  "code_samples": {
    "title": "Exemples de codi",
    "description": "Alguns casos d'ús de GroupDocs.Conversion típics per a operacions .NET",
    "sample_1": {
      "title": "Converteix PDF a Imatge",
      "content_1": "Un escenari que es troba habitualment consisteix a convertir un document PDF sencer o pàgines específiques en una col·lecció d'imatges. GroupDocs.Conversion per a .NET ofereix la possibilitat de convertir PDF en diversos formats d'imatge, com ara TIFF, JPG, PNG, GIF, BMP i molt més.",
      "content_2": "A diferència d'altres conversions, aquest procés requereix la declaració d'un delegat de SavePageStream, que especifica el format de nom per a les imatges desades. Podeu seleccionar el vostre format d'imatge preferit mitjançant la classe ImageFileType.",
      "code_title": "Convertir PDF a PNG en C#",
      "comment_1": "Carregueu el fitxer PDF d'origen",
      "comment_2": "Estableix les opcions de conversió per al format PNG",
      "comment_3": "Converteix a format PNG",
      "alternative_content_1": "Alternativament, podeu aconseguir el mateix amb una sintaxi fluida:",
      "alternative_code_title": "Convertir PDF a PNG en C# mitjançant una sintaxi fluida:"
    },
    "sample_2": {
      "title": "Conversió d'un segment d'un document gran",
      "content_1": "Amb GroupDocs.Conversion per a .NET, podeu convertir sense esforç pàgines específiques d'un document extens.",
      "content_2": "Teniu dos mètodes per aconseguir-ho, depenent dels vostres requisits. Podeu convertir una sèrie de pàgines o convertir pàgines específiques.",
      "code_title_1": "Converteix un rang consecutiu de pàgines",
      "code_title_2": "Converteix pàgines específiques"
    },
    "sample_3": {
      "title": "Sintaxi fluida: un enfocament simplificat",
      "content_1": "La sintaxi fluida ofereix una notació concisa per a les accions habituals dins de l'API GroupDocs.Conversion per a .NET.",
      "content_2": "Els exemples de codi següents mostren com aprofitar la sintaxi fluida:",
      "code_title_1": "Exemple 1: Converteix DOCX a PDF utilitzant una sintaxi fluida",
      "code_title_2": "Exemple 2: Converteix PDF a DOCX especificant la configuració del convertidor, les opcions de càrrega i les opcions de conversió mitjançant una sintaxi fluida",
      "code_title_3": "Exemple 3: Converteix PDF a DOCX pàgina per pàgina utilitzant una sintaxi fluida"
    }
  }
}