{
  "code_samples": {
    "title": "Примеры кода",
    "description": "Некоторые варианты использования типичных операций GroupDocs.Conversion для .NET",
    "sample_1": {
      "title": "Конвертировать PDF в изображение",
      "content_1": "Часто встречающийся сценарий предполагает преобразование всего PDF-документа или отдельных страниц в коллекцию изображений. GroupDocs.Conversion для .NET предлагает возможность конвертировать PDF-файлы в различные форматы изображений, такие как TIFF, JPG, PNG, GIF, BMP и другие.",
      "content_2": "В отличие от других преобразований, этот процесс требует объявления делегата SavePageStream, который определяет формат именования сохраняемых изображений. Вы можете выбрать предпочитаемый формат изображения, используя класс ImageFileType.",
      "code_title": "Преобразование PDF в PNG в C#",
      "comment_1": "Загрузите исходный PDF-файл",
      "comment_2": "Установите параметры преобразования и укажите тип выходного изображения.",
      "comment_3": "Конвертируйте каждую страницу PDF-документа в PNG"
    },
    "sample_2": {
      "title": "Преобразование сегмента большого документа",
      "content_1": "С помощью GroupDocs.Conversion для .NET вы можете легко конвертировать определенные страницы из длинного документа.",
      "content_2": "У вас есть два способа сделать это, в зависимости от ваших требований. Вы можете конвертировать диапазон страниц или конвертировать отдельные страницы.",
      "code_title_1": "Преобразование DOCX (страницы 2–4) в PDF на C#",
      "comment_1": "Загрузите исходный файл DOCX",
      "comment_2": "Установите параметры преобразования и укажите диапазон страниц для рендеринга.",
      "comment_3": "Конвертировать страницы 2–4 в PDF"
    },
    "sample_3": {
      "title": "Свободный синтаксис: оптимизированный подход",
      "content_1": "Свободный синтаксис предлагает краткое обозначение общих действий в API GroupDocs.Conversion для .NET.",
      "content_2": "Примеры кода ниже демонстрируют, как использовать свободный синтаксис:",
      "code_title_1": "Преобразование DOCX в PDF на C# с использованием гибкого синтаксиса"
    }
  }
}