{
  "code_samples": {
    "title": "Codebeispiele",
    "description": "Einige Anwendungsfälle typischer GroupDocs.Conversion für .NET-Vorgänge",
    "sample_1": {
      "title": "Konvertieren Sie PDF in ein Bild",
      "content_1": "Ein häufig anzutreffendes Szenario besteht darin, ein gesamtes PDF-Dokument oder bestimmte Seiten in eine Sammlung von Bildern zu konvertieren. GroupDocs.Conversion für .NET bietet die Möglichkeit, PDFs in verschiedene Bildformate wie TIFF, JPG, PNG, GIF, BMP und mehr zu konvertieren.",
      "content_2": "Im Gegensatz zu anderen Konvertierungen erfordert dieser Prozess die Deklaration eines SavePageStream-Delegaten, der das Benennungsformat für die gespeicherten Bilder angibt. Sie können Ihr bevorzugtes Bildformat mithilfe der ImageFileType-Klasse auswählen.",
      "code_title": "Konvertieren Sie PDF in PNG in C#",
      "comment_1": "Laden Sie die Quell-PDF-Datei",
      "comment_2": "Legen Sie die Konvertierungsoptionen fest und geben Sie den Ausgabebildtyp an",
      "comment_3": "Konvertieren Sie jede Seite eines PDF-Dokuments in PNG"
    },
    "sample_2": {
      "title": "Konvertieren Sie einen Abschnitt eines großen Dokuments",
      "content_1": "Mit GroupDocs.Conversion für .NET können Sie mühelos bestimmte Seiten aus einem langen Dokument konvertieren.",
      "content_2": "Abhängig von Ihren Anforderungen haben Sie zwei Möglichkeiten, dies zu erreichen. Sie können entweder einen Bereich von Seiten oder bestimmte Seiten konvertieren.",
      "code_title_1": "Konvertieren Sie DOCX (Seiten 2-4) in PDF in C#",
      "comment_1": "Laden Sie die DOCX-Quelldatei",
      "comment_2": "Legen Sie die Konvertierungsoptionen fest und geben Sie den Bereich der zu rendernden Seiten an",
      "comment_3": "Konvertieren Sie die Seiten 2-4 in PDF"
    },
    "sample_3": {
      "title": "Fließende Syntax: Ein optimierter Ansatz",
      "content_1": "Die fließende Syntax bietet eine prägnante Notation für häufige Aktionen innerhalb der GroupDocs.Conversion für .NET-API.",
      "content_2": "Die folgenden Codebeispiele zeigen, wie Sie die Fluent-Syntax nutzen können:",
      "code_title_1": "Konvertieren Sie DOCX in C# mit fließender Syntax in PDF"
    }
  }
}