{
  "head": {
    "title": "{{ProgLang}} API de conversão de documentos .NET | Converter PDF Word Excel PPTX Imagens HTML",
    "description": "{{ProgLang}} API de conversão de documentos .NET. Converta PDF Word DOC DOCX, planilhas do Excel PPT PPTX, HTML, PSD, MPT MPP, e-mail MSG EMLX, AutoCAD e formatos de arquivo de imagem."
  },
  "header": {
    "title": "API .NET para converter mais de 80 formatos de arquivo",
    "description": "API simples para integrar a funcionalidade de conversão de documentos e imagens em aplicativos .NET sem instalar nenhum software externo.",
    "button": {
      "label": "Baixar Teste Gratuito",
      "link": "https://downloads.groupdocs.com/conversion/net"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Visão geral"
      },
      "button2": {
        "text": "Características"
      },
      "button3": {
        "text": "Apoiar"
      },
      "button4": {
        "text": "Demonstração ao vivo"
      },
      "button5": {
        "text": "Preços"
      }
    }
  },
  "overview": {
    "content1": "O {{ProductFullName}} oferece um conjunto simples de APIs, permitindo que os desenvolvedores criem aplicativos poderosos de conversão de documentos em {{ProgLang}}, ASP.NET e outras tecnologias relacionadas a .NET. A API {{ProductFullName}} fornece uma solução de conversão de arquivos rápida, eficiente e confiável para seus usuários finais. Ele suporta a realização de conversões precisas entre todos os formatos de documentos comerciais populares, incluindo: PDF, HTML, e-mail, documentos do Microsoft Word, planilhas do Excel, apresentações do PowerPoint, Project, Photoshop, CorelDraw, AutoCAD, diagramas, formatos de arquivo de imagem raster e muito mais. A biblioteca do conversor de documentos detecta automaticamente o formato do documento de origem e oferece todo o controle para converter todo o documento ou páginas específicas para o formato de saída desejado. É mais fácil substituir as fontes ausentes pelas preferidas e adicionar marcas d'água de texto ou imagem a qualquer página do documento.",
    "content2": "{{ProductFullName}} pode ser usado para desenvolver aplicativos em qualquer ambiente de desenvolvimento direcionado à plataforma .NET. É compatível com todas as linguagens baseadas em .NET e suporta sistemas operacionais populares (Windows, Linux, MacOS) onde estruturas Mono ou .NET (incluindo .NET Core) podem ser instaladas.",
    "tab_one": {
      "description": "A seguir está uma visão geral de {{ProductFullName}}:",
      "right": {
        "title": "Visão geral",
        "content1": "* Detectar automaticamente o tipo de arquivo",
        "content2": "* Converter documentos",
        "content3": "* Converter apresentações",
        "content4": "* Converter planilhas",
        "content5": "* Converter imagens raster",
        "content6": "* Converter documentos PDF",
        "content7": "* Converter outros formatos",
        "content8": "* Aplicar marca d'água",
        "content9": "* Especifique a senha do arquivo",
        "content10": "* Personalize a conversão"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} é compatível com a conversão entre todos os [formatos de arquivo de documento] populares e comumente usados ​​(https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Converter de:",
        "content1": "* **Documentos**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Planilhas**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Apresentações**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Imagens**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Portátil**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Metarquivos**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Projeto**: MPP, MPT, MPX",
        "content10": "* **Outlook**: PST, OST",
        "content11": "* **E-mail**: MSG, EML, EMLX",
        "content12": "* **Diagramas**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Outros**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Converter para:",
        "content1": "* **Documentos**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Planilhas**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Apresentações**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Imagens**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Metarquivos**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Diagramas**: SVGZ",
        "content7": "* **Portátil**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Outro**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} é compatível com os seguintes sistemas operacionais, estruturas e gerenciadores de pacotes:",
      "left": {
        "title1": "Sistemas operacionais",
        "title2": "Estruturas Suportadas"
      },
      "right": {
        "title1": "Gerenciador de pacotes",
        "title2": "Ambientes de Desenvolvimento"
      }
    }
  },
  "features": {
    "title": "Recursos do {{ProductFullName}}",
    "content1": "Integração fácil e licenciamento medido",
    "content2": "Definir a opção de zoom padrão ao converter para palavras, slides ou células",
    "content3": "Converta de/para todos os formatos de imagem raster populares e atribua DPI, altura e largura da imagem",
    "content4": "Converter PDF e imagem em escala de cinza e linearizar documento PDF para a Web",
    "content5": "Especifique o nível do marcador, o nível do título e o nível expandido na conversão do Word para PDF/XPS",
    "content6": "Configurar e colocar marca d'água no documento convertido como plano de fundo para exibição atrás do texto",
    "content7": "Renderizar cabeçalho de e-mail durante a conversão de e-mail",
    "content8": "Definir diretórios de fontes personalizadas e carregar/substituir fontes explicitamente durante a conversão de documentos",
    "content9": "Definir fonte padrão para substituir fontes ausentes para conversão de documentos, slides e planilhas",
    "content10": "Métodos de conversão avançados para retornar a saída como caminho ou fluxo de E/S",
    "content11": "Converter planilha com linhas de grade e remover comentários de slides durante a conversão",
    "content12": "Converter páginas de documentos específicos como formato PDF e converter intervalos de células específicos em planilhas",
    "content13": "Mostrar planilhas ocultas e pular linhas e colunas vazias ao converter planilhas",
    "content14": "Contar o total de páginas de um documento e definir senha para documento desprotegido durante a conversão",
    "content15": "Opção para remover anotações e arquivos incorporados de PDF",
    "content16": "Criar marcação compatível com HTML 5 ao converter para HTML",
    "content17": "Detectar automaticamente o tipo de origem e retornar todas as conversões possíveis ao converter do fluxo",
    "content18": "Capacidade de retornar cada página em fluxo separado ao converter para PDF ou HTML",
    "content19": "Mostrar/ocultar marcação, comentários e acompanhar alterações ao converter do Word",
    "content20": "Conversão de DOCX para Tiff G3 com opção de sombreamento",
    "content21": "Converter layouts específicos ao converter de documento CAD",
    "content22": "Nomeação automática ao salvar documento convertido em arquivo",
    "content23": "Licenciamento medido suportado para ser cobrado com base no uso da API",
    "content24": "Converter diagramas para formatos de arquivo de processamento de texto",
    "content25": "Adicionar números de página ao converter HTML em documento de processamento de texto",
    "content26": "Converta documentos XML para qualquer formato sem transformação",
    "content27": "Monitore o progresso da conversão de arquivos (início, fim) diretamente do aplicativo do lado do cliente",
    "more_feature": {
      "title1": "Converta facilmente formatos de documentos",
      "content1": "Usando {{ProductFullName}}, converter o formato de arquivo de documento é muito fácil. O exemplo a seguir mostra como converter um arquivo PDF em um arquivo DOC usando {{ProgLang}}:",
      "step_1": "Crie uma instância da classe Converter e forneça ao arquivo o caminho completo",
      "step_2": "Crie e defina ConvertOptions para o tipo de destino desejado.",
      "step_3": "Chame o método Converter.Convert e passe o caminho completo e o formato como um parâmetro",
      "title2": "Conversão para formatos de imagem",
      "content2": "{{ProductFullName}} pode ser usado para desenvolver aplicativos em qualquer ambiente de desenvolvimento direcionado à plataforma .NET. É compatível com todas as linguagens baseadas em .NET e suporta sistemas operacionais populares (Windows, Linux, MacOS) onde estruturas Mono ou .NET (incluindo .NET Core) podem ser instaladas.",
      "title3": "Suporta vários tipos de formato PDF",
      "content3": "A API {{ProductFullName}} suporta a conversão de documentos para os seguintes tipos/formatos de PDF:"
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion oferece APIs de conversão de documentos para outros ambientes de desenvolvimento populares",
    "solution": {
      "img_alt": "GroupDocs.Conversion for Java",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-java.png",
      "platform": "Java",
      "link": "/conversão/java/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Carregar arquivo de origem {{FROM}} para conversão",
      "prepare_comment": "Preparar opções de conversão para o formato de destino {{TO}}",
      "convert_comment": "Converter para o formato {{TO}}"
    }
  }
}