{
  "head": {
    "title": "{{ProgLang}} .NET Document Conversion API | Μετατροπή PDF Word Excel PPTX Εικόνων HTML",
    "description": "{{ProgLang}} .NET Document Conversion API. Μετατροπή PDF Word DOC DOCX, υπολογιστικά φύλλα Excel PPT PPTX, HTML, PSD, MPT MPP, Email MSG EMLX, AutoCAD και μορφές αρχείων εικόνας."
  },
  "header": {
    "title": ".NET API για μετατροπή 80+ μορφών αρχείων",
    "description": "Απλό API για ενσωμάτωση της λειτουργικότητας μετατροπής εγγράφων και εικόνας σε εφαρμογές .NET χωρίς εγκατάσταση εξωτερικού λογισμικού.",
    "button": {
      "label": "Κατεβάστε δωρεάν δοκιμή",
      "link": "https://downloads.groupdocs.com/conversion/net"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "ΣΦΑΙΡΙΚΗ ΕΙΚΟΝΑ"
      },
      "button2": {
        "text": "Χαρακτηριστικά"
      },
      "button3": {
        "text": "Υποστήριξη"
      },
      "button4": {
        "text": "Ζωντανή επίδειξη"
      },
      "button5": {
        "text": "Τιμολόγηση"
      }
    }
  },
  "overview": {
    "content1": "Το {{ProductFullName}} προσφέρει ένα απλό σύνολο API, επιτρέποντας στους προγραμματιστές να δημιουργήσουν ισχυρές εφαρμογές μετατροπής εγγράφων σε {{ProgLang}}, ASP.NET και άλλες τεχνολογίες που σχετίζονται με το .NET. Το API {{ProductFullName}} παρέχει γρήγορη, αποτελεσματική και αξιόπιστη λύση μετατροπής αρχείων στους τελικούς χρήστες σας. Υποστηρίζει την εκτέλεση ακριβών μετατροπών μεταξύ όλων των δημοφιλών μορφών επιχειρηματικών εγγράφων, όπως: PDF, HTML, Email, έγγραφα Microsoft Word, υπολογιστικά φύλλα Excel, παρουσιάσεις PowerPoint, Project, Photoshop, CorelDraw, AutoCAD, διαγράμματα, μορφές αρχείων εικόνας ράστερ και πολλά άλλα. Η βιβλιοθήκη μετατροπέα εγγράφων εντοπίζει αυτόματα τη μορφή εγγράφου προέλευσης και σας δίνει όλο τον έλεγχο για να μετατρέψετε είτε ολόκληρο το έγγραφο είτε συγκεκριμένες σελίδες στην επιθυμητή μορφή εξόδου. Είναι πιο εύκολο να αντικαταστήσετε τις γραμματοσειρές που λείπουν με τις προτιμώμενες και να προσθέσετε υδατογραφήματα κειμένου ή εικόνας σε οποιαδήποτε σελίδα εγγράφου.",
    "content2": "Το {{ProductFullName}} μπορεί να χρησιμοποιηθεί για την ανάπτυξη εφαρμογών σε οποιοδήποτε περιβάλλον ανάπτυξης που στοχεύει την πλατφόρμα .NET. Είναι συμβατό με όλες τις γλώσσες που βασίζονται στο .NET και υποστηρίζει δημοφιλή λειτουργικά συστήματα (Windows, Linux, MacOS) όπου μπορούν να εγκατασταθούν πλαίσια Mono ή .NET (συμπεριλαμβανομένου του .NET Core).",
    "tab_one": {
      "description": "Ακολουθεί μια επισκόπηση του {{ProductFullName}}:",
      "right": {
        "title": "ΣΦΑΙΡΙΚΗ ΕΙΚΟΝΑ",
        "content1": "* Αυτόματος εντοπισμός τύπου αρχείου",
        "content2": "* Μετατροπή εγγράφων",
        "content3": "* Μετατροπή Παρουσιάσεων",
        "content4": "* Μετατροπή υπολογιστικών φύλλων",
        "content5": "* Μετατροπή ράστερ εικόνων",
        "content6": "* Μετατροπή εγγράφων PDF",
        "content7": "* Μετατροπή άλλων μορφών",
        "content8": "* Εφαρμογή υδατογραφήματος",
        "content9": "* Καθορίστε τον κωδικό πρόσβασης αρχείου",
        "content10": "* Προσαρμογή μετατροπής"
      }
    },
    "tab_two": {
      "description": "Το {{ProductFullName}} υποστηρίζει τη μετατροπή μεταξύ όλων των δημοφιλών και των κοινώς χρησιμοποιούμενων [μορφών αρχείων εγγράφων](https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Μετατροπή από:",
        "content1": "* **Έγγραφα**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Υπολογιστικά φύλλα**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Παρουσιάσεις**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Εικόνες**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Φορητό**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Metafiles**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Έργο**: MPP, MPT, MPX",
        "content10": "* **Outlook**: PST, OST",
        "content11": "* **Ηλεκτρονικό ταχυδρομείο**: MSG, EML, EMLX",
        "content12": "* **Διαγράμματα**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Άλλο**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Μετατροπή σε:",
        "content1": "* **Έγγραφα**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Υπολογιστικά φύλλα**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Παρουσιάσεις**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Εικόνες**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Μετα-αρχεία**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Διαγράμματα**: SVGZ",
        "content7": "* **Φορητό**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Άλλα**: MD"
      }
    },
    "tab_three": {
      "description": "Το {{ProductFullName}} υποστηρίζει τα ακόλουθα λειτουργικά συστήματα, Frameworks και Package Managers:",
      "left": {
        "title1": "Λειτουργικά συστήματα",
        "title2": "Υποστηριζόμενα πλαίσια"
      },
      "right": {
        "title1": "Διαχειριστής πακέτων",
        "title2": "Αναπτυξιακά Περιβάλλοντα"
      }
    }
  },
  "features": {
    "title": "Λειτουργίες {{ProductFullName}}",
    "content1": "Εύκολη ενσωμάτωση & μετρημένη άδεια χρήσης",
    "content2": "Ορίστε την προεπιλεγμένη επιλογή ζουμ κατά τη μετατροπή σε λέξεις, διαφάνειες ή κελιά",
    "content3": "Μετατροπή σε/από όλες τις δημοφιλείς μορφές εικόνας ράστερ και αντιστοίχιση DPI, ύψος και πλάτος εικόνας",
    "content4": "Μετατροπή PDF και εικόνας σε κλίμακα του γκρι και γραμμικοποίηση εγγράφου PDF για τον Ιστό",
    "content5": "Καθορίστε το επίπεδο σελιδοδείκτη, το επίπεδο κεφαλίδας και το διευρυμένο επίπεδο στη μετατροπή Word σε PDF/XPS",
    "content6": "Διαμόρφωση και τοποθέτηση υδατογραφήματος στο μετατρεπόμενο έγγραφο ως φόντο στην οθόνη πίσω από το κείμενο",
    "content7": "Απόδοση κεφαλίδας ηλεκτρονικού ταχυδρομείου κατά τη μετατροπή από το ηλεκτρονικό ταχυδρομείο",
    "content8": "Ορίστε προσαρμοσμένους καταλόγους γραμματοσειρών και ρητά Φόρτωση/Αντικατάσταση γραμματοσειράς κατά τη μετατροπή εγγράφου",
    "content9": "Ορισμός προεπιλεγμένης γραμματοσειράς για αντικατάσταση γραμματοσειρών που λείπουν για μετατροπή εγγράφων, διαφανειών και υπολογιστικών φύλλων",
    "content10": "Σύνθετες μέθοδοι μετατροπής για να επιστρέψετε την έξοδο ως διαδρομή ή ροή IO",
    "content11": "Μετατροπή υπολογιστικού φύλλου με γραμμές πλέγματος & κατάργηση σχολίων από διαφάνειες κατά τη μετατροπή",
    "content12": "Μετατροπή συγκεκριμένων σελίδων εγγράφων ως μορφή PDF & Μετατροπή συγκεκριμένου εύρους κελιών σε υπολογιστικά φύλλα",
    "content13": "Εμφάνιση κρυφών φύλλων και παράλειψη κενών σειρών και στηλών κατά τη μετατροπή υπολογιστικών φύλλων",
    "content14": "Μετρήστε τις συνολικές σελίδες ενός εγγράφου και ορίστε τον κωδικό πρόσβασης σε μη προστατευμένο έγγραφο κατά τη μετατροπή",
    "content15": "Επιλογή κατάργησης σχολιασμών και ενσωματωμένων αρχείων από το PDF",
    "content16": "Δημιουργήστε σήμανση συμβατή με HTML 5 κατά τη μετατροπή σε HTML",
    "content17": "Αυτόματος εντοπισμός τύπου πηγής και επιστροφή όλων των πιθανών μετατροπών κατά τη μετατροπή από τη ροή",
    "content18": "Δυνατότητα επιστροφής κάθε σελίδας σε ξεχωριστή ροή κατά τη μετατροπή σε PDF ή HTML",
    "content19": "Εμφάνιση/Απόκρυψη σήμανσης, σχολίων & παρακολούθησης αλλαγών κατά τη μετατροπή από το Word",
    "content20": "Μετατροπή DOCX σε Tiff G3 με επιλογή σκίασης",
    "content21": "Μετατροπή συγκεκριμένων διατάξεων κατά τη μετατροπή από έγγραφο CAD",
    "content22": "Αυτόματη ονομασία κατά την αποθήκευση του εγγράφου που μετατράπηκε σε αρχείο",
    "content23": "Υποστήριξη μετρημένης άδειας για χρέωση βάσει της χρήσης του API",
    "content24": "Μετατροπή διαγραμμάτων σε μορφές αρχείων επεξεργασίας κειμένου",
    "content25": "Προσθέστε αριθμούς σελίδων κατά τη μετατροπή HTML σε έγγραφο επεξεργασίας κειμένου",
    "content26": "Μετατροπή εγγράφων XML σε οποιαδήποτε μορφή χωρίς μετασχηματισμό",
    "content27": "Παρακολούθηση της προόδου μετατροπής αρχείων (Έναρξη, Τέλος) απευθείας από την εφαρμογή πελάτη",
    "more_feature": {
      "title1": "Μετατρέψτε εύκολα μορφές εγγράφων",
      "content1": "Χρησιμοποιώντας το {{ProductFullName}}, η μετατροπή μορφής αρχείου εγγράφου είναι πολύ εύκολη. Το παρακάτω παράδειγμα σάς δείχνει πώς να μετατρέψετε ένα αρχείο PDF σε αρχείο DOC χρησιμοποιώντας το {{ProgLang}}:",
      "step_1": "Δημιουργήστε μια παρουσία της κλάσης Converter και δώστε στο αρχείο την πλήρη διαδρομή",
      "step_2": "Δημιουργήστε και ορίστε το ConvertOptions για τον επιθυμητό τύπο στόχου.",
      "step_3": "Καλέστε τη μέθοδο Converter.Convert και περάστε την πλήρη διαδρομή και τη μορφή ως παράμετρο",
      "title2": "Μετατροπή σε μορφές εικόνας",
      "content2": "Το {{ProductFullName}} μπορεί να χρησιμοποιηθεί για την ανάπτυξη εφαρμογών σε οποιοδήποτε περιβάλλον ανάπτυξης που στοχεύει την πλατφόρμα .NET. Είναι συμβατό με όλες τις γλώσσες που βασίζονται στο .NET και υποστηρίζει δημοφιλή λειτουργικά συστήματα (Windows, Linux, MacOS) όπου μπορούν να εγκατασταθούν πλαίσια Mono ή .NET (συμπεριλαμβανομένου του .NET Core).",
      "title3": "Υποστηρίζει διάφορους τύπους μορφής PDF",
      "content3": "Το API {{ProductFullName}} υποστηρίζει τη μετατροπή εγγράφων στους ακόλουθους τύπους/μορφές PDF:"
    }
  },
  "solutions": {
    "title": "Το GroupDocs.Conversion προσφέρει API μετατροπής εγγράφων για άλλα δημοφιλή περιβάλλοντα ανάπτυξης",
    "solution": {
      "img_alt": "GroupDocs.Conversion για Java",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-java.png",
      "platform": "Ιάβα",
      "link": "/conversion/java/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Φορτώστε το αρχείο προέλευσης {{FROM}} για μετατροπή",
      "prepare_comment": "Προετοιμασία επιλογών μετατροπής για τη μορφή στόχου {{TO}}",
      "convert_comment": "Μετατροπή σε μορφή {{TO}}"
    }
  }
}