{
  "head": {
    "title": "{{ProgLang}} API การแปลงเอกสาร | แปลง PDF Word Excel PPTX HTML รูปภาพ",
    "description": "{{ProgLang}} API การแปลงเอกสาร แปลง PDF Word DOC DOCX, สเปรดชีต Excel PPT PPTX, HTML, PSD, MPT MPP, อีเมล MSG EMLX, AutoCAD และรูปแบบไฟล์รูปภาพ"
  },
  "header": {
    "title": "{{ProgLang}} API เพื่อแปลงรูปแบบไฟล์มากกว่า 80 รูปแบบ",
    "description": "API อย่างง่ายในการรวมฟังก์ชันการแปลงเอกสารและรูปภาพเข้ากับแอปพลิเคชัน {{ProgLang}} โดยไม่ต้องติดตั้งซอฟต์แวร์ภายนอกใดๆ",
    "button": {
      "label": "ดาวน์โหลด ทดลองใช้ฟรี",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "ภาพรวม"
      },
      "button2": {
        "text": "คุณสมบัติ"
      },
      "button3": {
        "text": "สนับสนุน"
      },
      "button4": {
        "text": "สาธิตสด"
      },
      "button5": {
        "text": "ราคา"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} รวมชุด API การแปลงเอกสารที่มีประสิทธิภาพเพื่อแสดงรูปภาพและรูปแบบเอกสารในแอปพลิเคชัน Java ของคุณโดยไม่จำเป็นต้องติดตั้งซอฟต์แวร์เพิ่มเติม มันทำการแรสเตอร์ของเอกสารโดยกำเนิดและแปลงเป็น SVG+HTML+CSS เพื่อปรับปรุงคุณภาพของการดูเอกสารในขณะที่ให้ผลลัพธ์ที่มีข้อความจริงและมีความเที่ยงตรงสูง การใช้ API การแสดงเอกสาร – ดู PDF, HTML, XML, Microsoft Office Word, เวิร์กชีต Excel, งานนำเสนอ PowerPoint, อีเมล Outlook, ไดอะแกรม Visio, โปรเจ็กต์, เมตาไฟล์, รูปภาพ และรูปแบบไฟล์อื่นๆ ได้อย่างง่ายดายและลดความเสี่ยงในการเขียนโปรแกรม นอกจากนี้ยังสามารถแสดงไฟล์ที่ป้องกันด้วยรหัสผ่านและอนุญาตให้แสดงเอกสารในรูปแบบ HTML, รูปภาพ หรือ PDF หลังจากการเรนเดอร์ ไลบรารีการแปลงไฟล์ของเราปรับแต่งได้ค่อนข้างมาก เนื่องจากทำให้คุณสามารถแสดงเอกสารทั้งหมด หรือแสดงผลบางส่วนเพื่อเพิ่มความเร็วในกระบวนการ ผ่าน GroupDocs.Conversion สำหรับ Java API คุณสามารถดูหน้า ช่วงเซลล์เฉพาะในสเปรดชีต หรือแม้แต่แสดงชั้นเอกสารแต่ละชั้นในรูปแบบต่างๆ เช่น PDF และ CAD",
    "content2": "{{ProductFullName}} API ช่วยให้คุณแสดงเอกสารโดยมี/ไม่มีคำอธิบายประกอบหรือความคิดเห็นสำหรับรูปแบบไฟล์ที่รองรับ นอกจากนี้ยังช่วยให้คุณสามารถเพิ่มไดเร็กทอรีแบบอักษรที่กำหนดเองและดึงข้อมูลเอกสารพื้นฐาน เช่น FileType, Extension, Name, PageCount เป็นต้น",
    "tab_one": {
      "description": "ต่อไปนี้เป็นภาพรวมของ {{ProductFullName}}:",
      "right": {
        "title": "ภาพรวม",
        "content1": "* ตรวจหาประเภทไฟล์อัตโนมัติ",
        "content2": "* แปลงเอกสาร",
        "content3": "* แปลงงานนำเสนอ",
        "content4": "* แปลงสเปรดชีต",
        "content5": "* แปลงภาพแรสเตอร์",
        "content6": "* แปลงเอกสาร PDF",
        "content7": "* แปลงรูปแบบอื่น",
        "content8": "* ใช้ลายน้ำ",
        "content9": "* ระบุรหัสผ่านไฟล์",
        "content10": "* ปรับแต่งการแปลง"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} รองรับการแปลงระหว่าง [รูปแบบไฟล์เอกสาร] ที่เป็นที่นิยมและใช้กันทั่วไป (https://docs.groupdocs.com/conversion/net/supported-document-formats/)",
      "left": {
        "title": "แปลงจาก:",
        "content1": "* **เอกสาร**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **สเปรดชีต**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **การนำเสนอ**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **รูปภาพ**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **พกพา**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **เมตาไฟล์**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **โครงการ**: MPP, MPT, MPX",
        "content10": "* **Outlook**: PST, OST",
        "content11": "* **อีเมล**: ผงชูรส, EML, EMLX",
        "content12": "* **ไดอะแกรม**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **อื่นๆ**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "เปลี่ยนเป็น:",
        "content1": "* **เอกสาร**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **สเปรดชีต**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **การนำเสนอ**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **รูปภาพ**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **เมตาไฟล์**: EMF, WMF, EMZ, WMZ",
        "content6": "* **แผนภาพ**: SVGZ",
        "content7": "* **พกพา**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **อื่นๆ**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} รองรับระบบปฏิบัติการ กรอบงาน และตัวจัดการแพ็คเกจต่อไปนี้:",
      "left": {
        "title1": "ระบบปฏิบัติการ",
        "title2": "กรอบงานที่รองรับ"
      },
      "right": {
        "title1": "ตัวจัดการแพ็คเกจ",
        "title2": "สภาพแวดล้อมการพัฒนา"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} คุณสมบัติ",
    "content1": "บูรณาการที่ง่ายดาย & การออกใบอนุญาตแบบมีมิเตอร์",
    "content2": "ตั้งค่าตัวเลือกการซูมเริ่มต้นเมื่อแปลงเป็น Words, Slides หรือ Cells",
    "content3": "แปลงเป็น/จากรูปแบบภาพแรสเตอร์ยอดนิยมทั้งหมด & กำหนด DPI รูปภาพ ความสูง & ความกว้าง",
    "content4": "แปลงไฟล์ PDF และรูปภาพเป็นระดับสีเทา & ทำเอกสาร PDF เป็นเส้นตรงสำหรับเว็บ",
    "content5": "ระบุระดับบุ๊กมาร์ก ระดับหัวเรื่อง และระดับที่ขยายในการแปลง Word เป็น PDF/XPS",
    "content6": "กำหนดค่า & วางลายน้ำในเอกสารที่แปลงเป็นพื้นหลังเพื่อแสดงด้านหลังข้อความ",
    "content7": "แสดงส่วนหัวของอีเมลระหว่างการแปลงจากอีเมล",
    "content8": "ตั้งค่าไดเร็กทอรีฟอนต์แบบกำหนดเอง & โหลด/เปลี่ยนฟอนต์อย่างชัดเจนระหว่างการแปลงเอกสาร",
    "content9": "ตั้งค่าแบบอักษรเริ่มต้นเพื่อแทนที่แบบอักษรที่ขาดหายไปสำหรับการแปลงเอกสาร สไลด์ และสเปรดชีต",
    "content10": "วิธีการแปลงขั้นสูงเพื่อส่งคืนเอาต์พุตเป็น Path หรือ IO Stream",
    "content11": "แปลงสเปรดชีตด้วยเส้นตารางและลบความคิดเห็นออกจากสไลด์ขณะแปลง",
    "content12": "แปลงหน้าเอกสารเฉพาะเป็นรูปแบบ PDF และแปลงช่วงเซลล์เฉพาะในสเปรดชีต",
    "content13": "แสดงชีตที่ซ่อนอยู่ & ข้ามแถวและคอลัมน์ว่างขณะแปลงสเปรดชีต",
    "content14": "นับจำนวนหน้าทั้งหมดของเอกสาร & ตั้งรหัสผ่านเป็นเอกสารที่ไม่มีการป้องกันระหว่างการแปลง",
    "content15": "ตัวเลือกในการลบคำอธิบายประกอบและไฟล์ที่ฝังจาก PDF",
    "content16": "สร้างมาร์กอัปที่สอดคล้องกับ HTML 5 เมื่อแปลงเป็น HTML",
    "content17": "ตรวจหาประเภทแหล่งที่มาโดยอัตโนมัติ & ส่งกลับ Conversion ที่เป็นไปได้ทั้งหมดเมื่อแปลงจาก Stream",
    "content18": "ความสามารถในการส่งคืนแต่ละหน้าในสตรีมแยกกันขณะแปลงเป็น PDF หรือ HTML",
    "content19": "แสดง/ซ่อนมาร์กอัป ความคิดเห็น และติดตามการเปลี่ยนแปลงขณะแปลงจาก Word",
    "content20": "การแปลง DOCX เป็น Tiff G3 พร้อมตัวเลือกการแรเงา",
    "content21": "แปลงเค้าโครงเฉพาะเมื่อแปลงจากเอกสาร CAD",
    "content22": "ตั้งชื่ออัตโนมัติเมื่อบันทึกเอกสารที่แปลงเป็นไฟล์",
    "content23": "Metered Licensing รองรับการเรียกเก็บเงินตามการใช้งาน API",
    "content24": "แปลงไดอะแกรมเป็นรูปแบบไฟล์ประมวลผลคำ",
    "content25": "เพิ่มหมายเลขหน้าขณะแปลง HTML เป็นเอกสารประมวลผลคำ",
    "content26": "แปลงเอกสาร XML เป็นรูปแบบใดก็ได้โดยไม่ต้องแปลง",
    "content27": "ตรวจสอบความคืบหน้าของการแปลงไฟล์ (เริ่ม, สิ้นสุด) โดยตรงจากแอปพลิเคชันฝั่งไคลเอ็นต์",
    "more_feature": {
      "title1": "การแปลงรูปแบบเอกสารอย่างง่ายโดยใช้ Java",
      "content1": "คุณสามารถแปลงรูปแบบไฟล์ของเอกสารประเภทต่างๆ ได้มากมายโดยใช้ API ของ {{ProductFullName}} ที่นี่ คุณจะพบกับโค้ดสองสามบรรทัดเพื่อทำการแปลงเอกสารพื้นฐานโดยใช้ Java",
      "step_1": "สร้างอินสแตนซ์ของคลาส Converter และจัดเตรียมไฟล์ด้วยพาธแบบเต็ม",
      "step_2": "สร้างและตั้งค่า ConvertOptions สำหรับประเภทเป้าหมายที่ต้องการ",
      "step_3": "เรียกใช้เมธอด Converter.Convert และส่งเส้นทางและรูปแบบแบบเต็มเป็นพารามิเตอร์",
      "title2": "อ่านเอกสารจาก URL หรือเส้นทางสำหรับการแปลง",
      "content2": "เมื่อใช้ API ของ {{ProductFullName}} คุณจะอ่านเอกสารอินพุตจากเส้นทางไฟล์และ URL ได้ ในขณะที่คุณสามารถบันทึกเอกสารเอาต์พุตเป็นไฟล์หรือส่งออกไปยังสตรีมได้โดยตรง",
      "title3": "การสนับสนุนทางเทคนิคที่ครอบคลุม",
      "content3": "{{ProductFullName}} เป็น API ที่เรียบง่ายและตรงประเด็น ซึ่งคุณสามารถรวมเข้ากับแอปพลิเคชันที่ใช้ Java ของคุณได้อย่างง่ายดาย อย่างไรก็ตาม เพื่อให้คุณพร้อมใช้งานในเวลาไม่นาน เรายังมีตัวอย่างโค้ดที่ง่ายต่อการติดตามและเอกสาร API ที่ครอบคลุม"
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion นำเสนอ API การแปลงเอกสารสำหรับสภาพแวดล้อมการพัฒนายอดนิยมอื่นๆ",
    "solution": {
      "img_alt": "GroupDocs.Conversion สำหรับ .NET",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".สุทธิ",
      "link": "/conversion/net/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "โหลดไฟล์ต้นฉบับ {{FROM}} สำหรับการแปลง",
      "prepare_comment": "เตรียมตัวเลือกการแปลงสำหรับรูปแบบเป้าหมาย {{TO}}",
      "convert_comment": "แปลงเป็นรูปแบบ {{TO}}"
    }
  }
}