{
  "head": {
    "title": "{{ProgLang}} API di conversione dei documenti | Converti immagini PDF Word Excel PPTX HTML",
    "description": "{{ProgLang}} API di conversione dei documenti. Converti PDF Word DOC DOCX, fogli di calcolo Excel PPT PPTX, HTML, PSD, MPT MPP, e-mail MSG EMLX, AutoCAD e formati di file immagine."
  },
  "header": {
    "title": "API {{ProgLang}} per convertire oltre 80 formati di file",
    "description": "API semplice per integrare la funzionalità di conversione di documenti e immagini nelle applicazioni {{ProgLang}} senza installare alcun software esterno.",
    "button": {
      "label": "Scarica la prova gratuita",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Panoramica"
      },
      "button2": {
        "text": "Caratteristiche"
      },
      "button3": {
        "text": "Supporto"
      },
      "button4": {
        "text": "Dimostrazione dal vivo"
      },
      "button5": {
        "text": "Prezzo"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} combina un potente set di API di conversione dei documenti per visualizzare immagini e formati di documenti nelle tue applicazioni Java senza la necessità di installare software aggiuntivo. Rasterizza in modo nativo i documenti e li converte in SVG+HTML+CSS per migliorare la qualità di visualizzazione dei documenti fornendo al contempo un output di testo vero e ad alta fedeltà. Utilizzando l'API di rendering dei documenti: visualizza rapidamente PDF, HTML, XML, Microsoft Office Word, fogli di lavoro Excel, presentazioni PowerPoint, e-mail di Outlook, diagrammi di Visio, progetti, metafile, immagini e vari altri formati di file con facilità e meno rischi di programmazione. Può anche visualizzare file protetti da password e consentire la rappresentazione di documenti come HTML, immagine o PDF dopo il rendering. La nostra libreria di conversione file è abbastanza personalizzabile, in quanto ti consente di visualizzare l'intero documento o renderizzarlo parzialmente per accelerare il processo. Attraverso GroupDocs.Conversion per l'API Java, puoi visualizzare pagine, intervalli di celle specifici in un foglio di calcolo o persino eseguire il rendering di un singolo livello di documento in formati come PDF e CAD.",
    "content2": "L'API {{ProductFullName}} ti consente di eseguire il rendering di documenti con/senza annotazioni o commenti per i formati di file supportati. Ti consente inoltre di aggiungere directory di font personalizzate ed estrarre informazioni di base sui documenti come FileType, Extension, Name, PageCount, ecc.",
    "tab_one": {
      "description": "Di seguito è riportata una panoramica di {{ProductFullName}}:",
      "right": {
        "title": "Panoramica",
        "content1": "* Rileva automaticamente il tipo di file",
        "content2": "* Converti documenti",
        "content3": "* Converti presentazioni",
        "content4": "* Converti fogli di calcolo",
        "content5": "* Converti immagini raster",
        "content6": "* Converti documenti PDF",
        "content7": "* Converti altri formati",
        "content8": "* Applica filigrana",
        "content9": "* Specificare la password del file",
        "content10": "* Personalizza la conversione"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} supporta la conversione tra tutti i [formati di file di documenti] più diffusi e comunemente usati (https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Converti da:",
        "content1": "* **Documenti**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Fogli di calcolo**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Presentazioni**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Immagini**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Portatile**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTML, HTML, MHTML",
        "content7": "* **Metafile**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Progetto**: MPP, MPT, MPX",
        "content10": "* **Prospettiva**: PST, OST",
        "content11": "* **E-mail**: MSG, EML, EMLX",
        "content12": "* **Diagrammi**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Altro**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Convertire in:",
        "content1": "* **Documenti**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Fogli di calcolo**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Presentazioni**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Immagini**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Metafile**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Diagrammi**: SVGZ",
        "content7": "* **Portatile**: PDF, XPS",
        "content8": "* **HTML**: HTML, HTML, MHTML",
        "content9": "* **Altro**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} supporta i seguenti sistemi operativi, framework e gestori di pacchetti:",
      "left": {
        "title1": "Sistemi operativi",
        "title2": "Framework supportati"
      },
      "right": {
        "title1": "Gestore di pacchetti",
        "title2": "Ambienti di sviluppo"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} Funzionalità",
    "content1": "Facile integrazione e licenza a consumo",
    "content2": "Imposta l'opzione di zoom predefinita durante la conversione in parole, diapositive o celle",
    "content3": "Converti in/da tutti i formati di immagine raster più diffusi e assegna DPI, altezza e larghezza all'immagine",
    "content4": "Converti PDF e immagini in scala di grigi e linearizza documenti PDF per il Web",
    "content5": "Specifica il livello del segnalibro, il livello dell'intestazione e il livello esteso nella conversione da Word a PDF/XPS",
    "content6": "Configura e posiziona la filigrana nel documento convertito come sfondo da visualizzare dietro il testo",
    "content7": "Rendering dell'intestazione dell'e-mail durante la conversione dall'e-mail",
    "content8": "Imposta directory dei caratteri personalizzati e carica/sostituisci esplicitamente i caratteri durante la conversione del documento",
    "content9": "Imposta il carattere predefinito per sostituire i caratteri mancanti per la conversione di documenti, diapositive e fogli di calcolo",
    "content10": "Metodi di conversione avanzati per restituire l'output come percorso o flusso IO",
    "content11": "Converti foglio di lavoro con linee della griglia e rimuovi commenti dalle diapositive durante la conversione",
    "content12": "Converti pagine di documenti specifici in formato PDF e converti intervalli di celle specifici in fogli di calcolo",
    "content13": "Mostra fogli nascosti e salta righe e colonne vuote durante la conversione di fogli di calcolo",
    "content14": "Conta le pagine totali di un documento e imposta la password su un documento non protetto durante la conversione",
    "content15": "Opzione per rimuovere annotazioni e file incorporati da PDF",
    "content16": "Crea markup conforme a HTML 5 durante la conversione in HTML",
    "content17": "Rileva automaticamente il tipo di origine e restituisce tutte le conversioni possibili durante la conversione da Stream",
    "content18": "Possibilità di restituire ogni pagina in un flusso separato durante la conversione in PDF o HTML",
    "content19": "Mostra/Nascondi markup, commenti e traccia modifiche durante la conversione da Word",
    "content20": "Conversione da DOCX a Tiff G3 con opzione di ombreggiatura",
    "content21": "Converti layout specifici durante la conversione da documento CAD",
    "content22": "Denominazione automatica durante il salvataggio del documento convertito in file",
    "content23": "Licenze a consumo supportate per la fatturazione in base all'utilizzo dell'API",
    "content24": "Converti diagrammi in formati di file di elaborazione testi",
    "content25": "Aggiungi numeri di pagina durante la conversione di HTML in documenti di elaborazione testi",
    "content26": "Converti documenti XML in qualsiasi formato senza trasformazione",
    "content27": "Monitora l'avanzamento della conversione dei file (inizio, fine) direttamente dall'applicazione lato client",
    "more_feature": {
      "title1": "Facile conversione del formato del documento utilizzando Java",
      "content1": "Puoi convertire il formato file di una moltitudine di tipi di documenti utilizzando l'API {{ProductFullName}}. Qui ti vengono presentate alcune righe di codice per eseguire una conversione di documenti di base utilizzando Java.",
      "step_1": "Crea un'istanza della classe Converter e fornisci al file il percorso completo",
      "step_2": "Crea e imposta ConvertOptions per il tipo di destinazione desiderato.",
      "step_3": "Chiama il metodo Converter.Convert e passa il percorso completo e il formato come parametro",
      "title2": "Leggi il documento dall'URL o dal percorso per la conversione",
      "content2": "Utilizzando l'API {{ProductFullName}}, puoi leggere il documento di input da un percorso file e da un URL. Mentre puoi salvare il documento di output come file o inviare l'output direttamente in un flusso.",
      "title3": "Supporto tecnico completo",
      "content3": "{{ProductFullName}} è un'API semplice e mirata che puoi integrare facilmente nelle tue applicazioni basate su Java. Tuttavia, per essere subito operativi, forniamo anche esempi di codice facili da seguire e una documentazione API completa."
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion offre API di conversione dei documenti per altri ambienti di sviluppo popolari",
    "solution": {
      "img_alt": "GroupDocs.Conversion per .NET",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".RETE",
      "link": "/conversione/rete/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Carica il file di origine {{FROM}} per la conversione",
      "prepare_comment": "Prepara le opzioni di conversione per il formato target {{TO}}",
      "convert_comment": "Converti nel formato {{TO}}"
    }
  }
}