{
  "head": {
    "title": "{{ProgLang}} .NET Document Conversion API | پی ڈی ایف ورڈ ایکسل پی پی ٹی ایکس ایچ ٹی ایم ایل امیجز کو تبدیل کریں۔",
    "description": "{{ProgLang}} .NET Document Conversion API۔ PDF Word DOC DOCX، Excel Spreadsheets PPT PPTX، HTML، PSD، MPT MPP، ای میل MSG EMLX، AutoCAD اور امیج فائل فارمیٹس میں تبدیل کریں۔"
  },
  "header": {
    "title": ".NET API 80+ فائل فارمیٹس میں تبدیل کرنے کے لیے",
    "description": "کسی بھی بیرونی سافٹ ویئر کو انسٹال کیے بغیر .NET ایپلی کیشنز میں دستاویز اور تصویری تبدیلی کی فعالیت کو ضم کرنے کے لیے سادہ API۔",
    "button": {
      "label": "مفت ٹرائل ڈاؤن لوڈ کریں۔",
      "link": "https://downloads.groupdocs.com/conversion/net"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "جائزہ"
      },
      "button2": {
        "text": "خصوصیات"
      },
      "button3": {
        "text": "حمایت"
      },
      "button4": {
        "text": "لائیو ڈیمو"
      },
      "button5": {
        "text": "قیمتوں کا تعین"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} APIs کا سادہ سیٹ پیش کرتا ہے، جو ڈیولپرز کو {{ProgLang}}، ASP.NET اور دیگر .NET سے متعلقہ ٹیکنالوجیز میں دستاویزی تبدیلی کی طاقتور ایپلی کیشنز بنانے کے قابل بناتا ہے۔ {{ProductFullName}} API آپ کے اختتامی صارفین کو تیز، موثر اور قابل اعتماد فائل کنورژن حل فراہم کرتا ہے۔ یہ تمام مشہور کاروباری دستاویز فارمیٹس کے درمیان درست تبادلوں کو انجام دینے میں معاونت کرتا ہے بشمول: PDF، HTML، ای میل، Microsoft Word دستاویزات، Excel اسپریڈ شیٹس، پاورپوائنٹ پریزنٹیشنز، پروجیکٹ، Photoshop، CorelDraw، AutoCAD، diagrams، raster image file formats اور بہت کچھ۔ دستاویز کنورٹر لائبریری ماخذ دستاویز کی شکل کا خود بخود پتہ لگاتی ہے اور آپ کو پوری دستاویز یا مخصوص صفحات کو مطلوبہ آؤٹ پٹ فارمیٹ میں تبدیل کرنے کا تمام کنٹرول فراہم کرتی ہے۔ گمشدہ فونٹس کو ترجیحی فونٹس سے بدلنا اور کسی بھی دستاویز کے صفحہ پر متن یا تصویری واٹر مارکس شامل کرنا آسان ہے۔",
    "content2": "{{ProductFullName}} کو کسی بھی ترقیاتی ماحول میں ایپلی کیشنز تیار کرنے کے لیے استعمال کیا جا سکتا ہے جو .NET پلیٹ فارم کو نشانہ بناتا ہے۔ یہ تمام .NET پر مبنی زبانوں کے ساتھ مطابقت رکھتا ہے اور مقبول آپریٹنگ سسٹم (ونڈوز، لینکس، MacOS) کو سپورٹ کرتا ہے جہاں مونو یا .NET فریم ورک (بشمول .NET کور) انسٹال کیے جا سکتے ہیں۔",
    "tab_one": {
      "description": "ذیل میں {{ProductFullName}} کا ایک جائزہ ہے:",
      "right": {
        "title": "جائزہ",
        "content1": "* فائل کی قسم کا خود بخود پتہ لگائیں۔",
        "content2": "* دستاویزات کو تبدیل کریں۔",
        "content3": "* پیشکشوں کو تبدیل کریں۔",
        "content4": "* اسپریڈشیٹ کو تبدیل کریں۔",
        "content5": "* راسٹر امیجز کو تبدیل کریں۔",
        "content6": "* پی ڈی ایف دستاویزات کو تبدیل کریں۔",
        "content7": "* دوسرے فارمیٹس کو تبدیل کریں۔",
        "content8": "* واٹر مارک لگائیں۔",
        "content9": "* فائل پاس ورڈ کی وضاحت کریں۔",
        "content10": "* تبادلوں کو اپنی مرضی کے مطابق بنائیں"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} تمام مقبول اور عام طور پر استعمال ہونے والے [دستاویز فائل فارمیٹس](https://docs.groupdocs.com/conversion/net/supported-document-formats/) کے درمیان تبدیل کرنے کی حمایت کرتا ہے۔",
      "left": {
        "title": "سے تبدیل کریں:",
        "content1": "* **دستاویزات**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **اسپریڈ شیٹس**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **پریزنٹیشنز**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **تصاویر**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "** پورٹیبل**: PDF، XPS، OXPS، EPUB",
        "content6": "**HTML**: ایچ ٹی ایم، ایچ ٹی ایم ایل، ایم ایچ ٹی ایم ایل",
        "content7": "* **میٹا فائلز**: EMZ، WMZ",
        "content8": "* **فوٹو شاپ**: پی ایس ڈی",
        "content9": "**پروجیکٹ**: MPP، MPT، MPX",
        "content10": "*** آؤٹ لک**: PST، OST",
        "content11": "* **ای میل**: MSG، EML، EMLX",
        "content12": "* **ڈیاگرام**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **آٹو کیڈ**: ڈی ایکس ایف، ڈی ڈبلیو جی، ڈی ڈبلیو ایف، ایس ٹی ایل، آئی ایف سی، ڈی ڈبلیو ٹی",
        "content14": "* **پوسٹ اسکرپٹ**: EPS، PS، PSL، CGM",
        "content15": "* **کورل ڈرا**: سی ڈی آر، سی ایم ایکس",
        "content16": "* **دیگر**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "میں تبدیل کریں:",
        "content1": "* **دستاویزات**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **اسپریڈ شیٹس**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **پریزنٹیشنز**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **تصاویر**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **میٹا فائلز**: EMF، WMF، EMZ، WMZ",
        "content6": "* **ڈائیگرامس**: SVGZ",
        "content7": "** پورٹیبل**: پی ڈی ایف، ایکس پی ایس",
        "content8": "**HTML**: ایچ ٹی ایم، ایچ ٹی ایم ایل، ایم ایچ ٹی ایم ایل",
        "content9": "*** دیگر**: ایم ڈی"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} درج ذیل آپریٹنگ سسٹمز، فریم ورکس اور پیکیج مینیجرز کو سپورٹ کرتا ہے:",
      "left": {
        "title1": "آپریٹنگ سسٹمز",
        "title2": "تعاون یافتہ فریم ورک"
      },
      "right": {
        "title1": "پیکیج مینیجر",
        "title2": "ترقیاتی ماحول"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} خصوصیات",
    "content1": "آسان انضمام اور میٹرڈ لائسنسنگ",
    "content2": "الفاظ، سلائیڈز یا سیلز میں تبدیل کرتے وقت ڈیفالٹ زوم آپشن سیٹ کریں۔",
    "content3": "تمام مقبول راسٹر امیج فارمیٹس میں/سے تبدیل کریں اور تصویر ڈی پی آئی، اونچائی اور چوڑائی تفویض کریں",
    "content4": "پی ڈی ایف اور امیج کو گرے اسکیل میں تبدیل کریں اور ویب کے لیے پی ڈی ایف دستاویز کو لکیری بنائیں",
    "content5": "ورڈ میں بک مارک لیول، ہیڈنگ لیول اور توسیعی سطح کو پی ڈی ایف/ایکس پی ایس کنورژن میں بیان کریں",
    "content6": "متن کے پیچھے ڈسپلے کرنے کے لیے کنورٹڈ دستاویز میں واٹر مارک کو بیک گراؤنڈ کے طور پر ترتیب دیں اور رکھیں",
    "content7": "ای میل سے تبادلوں کے دوران ای میل ہیڈر پیش کریں۔",
    "content8": "دستاویز کی تبدیلی کے دوران حسب ضرورت فونٹ ڈائریکٹریز اور واضح طور پر لوڈ/متبادل فونٹ سیٹ کریں۔",
    "content9": "دستاویزات، سلائیڈز اور اسپریڈ شیٹس کی تبدیلی کے لیے گمشدہ فونٹس کو تبدیل کرنے کے لیے ڈیفالٹ فونٹ سیٹ کریں",
    "content10": "آؤٹ پٹ کو پاتھ یا IO سٹریم کے طور پر واپس کرنے کے لیے جدید تبادلوں کے طریقے",
    "content11": "اسپریڈشیٹ کو گرڈ لائنوں کے ساتھ تبدیل کریں اور تبدیلی کے دوران سلائیڈز سے تبصرے ہٹا دیں۔",
    "content12": "مخصوص دستاویز کے صفحات کو پی ڈی ایف فارمیٹ میں تبدیل کریں اور اسپریڈ شیٹس میں مخصوص سیل رینج کو تبدیل کریں",
    "content13": "پوشیدہ شیٹس دکھائیں اور اسپریڈ شیٹس کو تبدیل کرتے وقت خالی قطاریں اور کالم چھوڑ دیں۔",
    "content14": "کسی دستاویز کے کل صفحات شمار کریں اور تبدیلی کے دوران غیر محفوظ دستاویز پر پاس ورڈ سیٹ کریں",
    "content15": "پی ڈی ایف سے تشریحات اور ایمبیڈڈ فائلوں کو ہٹانے کا اختیار",
    "content16": "HTML میں تبدیل کرتے وقت HTML 5 کے مطابق مارک اپ بنائیں",
    "content17": "سٹریم سے تبدیل ہونے پر ماخذ کی قسم کا خود بخود پتہ لگائیں اور تمام ممکنہ تبادلوں کو لوٹائیں",
    "content18": "پی ڈی ایف یا ایچ ٹی ایم ایل میں تبدیل کرتے وقت ہر صفحہ کو علیحدہ سٹریم میں واپس کرنے کی صلاحیت",
    "content19": "ورڈ سے بدلتے وقت مارک اپ، تبصرے اور ٹریک تبدیلیاں دکھائیں/چھپائیں۔",
    "content20": "شیڈنگ آپشن کے ساتھ DOCX سے Tiff G3 کی تبدیلی",
    "content21": "CAD دستاویز سے تبدیل کرتے وقت مخصوص لے آؤٹ کو تبدیل کریں۔",
    "content22": "تبدیل شدہ دستاویز کو فائل میں محفوظ کرتے وقت خودکار نام دینا",
    "content23": "API کے استعمال کی بنیاد پر بل کیے جانے کے لیے میٹرڈ لائسنسنگ کی حمایت کی جاتی ہے۔",
    "content24": "ڈایاگرام کو ورڈ پروسیسنگ فائل فارمیٹس میں تبدیل کریں۔",
    "content25": "HTML کو ورڈ پروسیسنگ دستاویز میں تبدیل کرتے وقت صفحہ نمبر شامل کریں۔",
    "content26": "XML دستاویزات کو بغیر کسی تبدیلی کے کسی بھی شکل میں تبدیل کریں۔",
    "content27": "براہ راست کلائنٹ سائڈ ایپلی کیشن سے فائل کی تبدیلی کی پیشرفت (شروع، اختتام) کی نگرانی کریں",
    "more_feature": {
      "title1": "دستاویز کی شکلوں کو آسانی سے تبدیل کریں۔",
      "content1": "{{ProductFullName}} کا استعمال کرتے ہوئے، دستاویز کی فائل فارمیٹ کو تبدیل کرنا بہت آسان ہے۔ مندرجہ ذیل مثال آپ کو دکھاتی ہے کہ {{ProgLang}} کا استعمال کرتے ہوئے PDF فائل کو DOC فائل میں کیسے تبدیل کیا جائے:",
      "step_1": "کنورٹر کلاس کی ایک مثال بنائیں اور فائل کو مکمل راستہ فراہم کریں۔",
      "step_2": "مطلوبہ ہدف کی قسم کے لیے ConvertOptions بنائیں اور سیٹ کریں۔",
      "step_3": "Converter.Convert طریقہ کو کال کریں اور مکمل راستہ اور فارمیٹ کو بطور پیرامیٹر پاس کریں۔",
      "title2": "تصویری فارمیٹس میں تبدیلی",
      "content2": "{{ProductFullName}} کو کسی بھی ترقیاتی ماحول میں ایپلی کیشنز تیار کرنے کے لیے استعمال کیا جا سکتا ہے جو .NET پلیٹ فارم کو نشانہ بناتا ہے۔ یہ تمام .NET پر مبنی زبانوں کے ساتھ مطابقت رکھتا ہے اور مقبول آپریٹنگ سسٹم (ونڈوز، لینکس، MacOS) کو سپورٹ کرتا ہے جہاں مونو یا .NET فریم ورک (بشمول .NET کور) انسٹال کیے جا سکتے ہیں۔",
      "title3": "پی ڈی ایف فارمیٹ کی مختلف اقسام کو سپورٹ کرتا ہے۔",
      "content3": "{{ProductFullName}} API درج ذیل PDF اقسام/فارمیٹس میں دستاویز کی تبدیلی کو سپورٹ کرتا ہے:"
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion دیگر مقبول ترقیاتی ماحول کے لیے دستاویز کی تبدیلی APIs پیش کرتا ہے۔",
    "solution": {
      "img_alt": "جاوا کے لیے GroupDocs.Conversion",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-java.png",
      "platform": "جاوا",
      "link": "/conversion/java/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "تبدیلی کے لیے سورس فائل {{FROM}} لوڈ کریں۔",
      "prepare_comment": "ٹارگٹ فارمیٹ {{TO}} کے لیے تبادلوں کے اختیارات تیار کریں",
      "convert_comment": "{{TO}} فارمیٹ میں تبدیل کریں۔"
    }
  }
}