{
  "head": {
    "title": "{{ProgLang}} दस्तावेज़ रूपांतरण API | पीडीएफ वर्ड एक्सेल पीपीटीएक्स एचटीएमएल इमेज कन्वर्ट करें",
    "description": "{{ProgLang}} दस्तावेज़ रूपांतरण API. पीडीएफ वर्ड DOC DOCX, एक्सेल स्प्रेडशीट पीपीटी पीपीटीएक्स, एचटीएमएल, पीएसडी, एमपीटी एमपीपी, ईमेल एमएसजी ईएमएलएक्स, ऑटोकैड और छवि फ़ाइल स्वरूपों को कनवर्ट करें।"
  },
  "header": {
    "title": "{{ProgLang}} 80+ फ़ाइल स्वरूपों को कनवर्ट करने के लिए API",
    "description": "दस्तावेज़ और छवि रूपांतरण कार्यक्षमता को {{ProgLang}} अनुप्रयोगों में एकीकृत करने के लिए सरल एपीआई बिना किसी बाहरी सॉफ़्टवेयर को स्थापित किए।",
    "button": {
      "label": "नि: शुल्क परीक्षण डाउनलोड करें",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "अवलोकन"
      },
      "button2": {
        "text": "विशेषताएँ"
      },
      "button3": {
        "text": "सहायता"
      },
      "button4": {
        "text": "लाइव डेमो"
      },
      "button5": {
        "text": "मूल्य निर्धारण"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} अतिरिक्त सॉफ़्टवेयर इंस्टॉल किए बिना आपके जावा एप्लिकेशन में छवियों और दस्तावेज़ स्वरूपों को प्रदर्शित करने के लिए दस्तावेज़ रूपांतरण API के एक शक्तिशाली सेट को जोड़ती है। यह मूल रूप से दस्तावेज़ों को रास्टराइज़ करता है और एक ट्रू-टेक्स्ट, उच्च-निष्ठा आउटपुट प्रदान करते हुए दस्तावेज़ देखने की गुणवत्ता बढ़ाने के लिए उन्हें SVG+HTML+CSS में परिवर्तित करता है। दस्तावेज़ रेंडरिंग एपीआई का उपयोग करना - पीडीएफ, एचटीएमएल, एक्सएमएल, माइक्रोसॉफ्ट ऑफिस वर्ड, एक्सेल वर्कशीट, पावरपॉइंट प्रेजेंटेशन, आउटलुक ईमेल, विसिओ डायग्राम, प्रोजेक्ट, मेटाफाइल्स, इमेज और विभिन्न अन्य फाइल फॉर्मेट को आसानी से और कम प्रोग्रामिंग खतरों के साथ देखें। यह पासवर्ड से सुरक्षित फाइलों को भी प्रदर्शित कर सकता है और प्रतिपादन के बाद HTML, छवि या पीडीएफ फॉर्म के रूप में दस्तावेज़ प्रतिनिधित्व प्राप्त करने की अनुमति देता है। हमारी फ़ाइल रूपांतरण लाइब्रेरी काफी अनुकूलन योग्य है, क्योंकि यह आपको पूरे दस्तावेज़ को प्रदर्शित करने की अनुमति देती है, या प्रक्रिया को गति देने के लिए इसे आंशिक रूप से प्रस्तुत करती है। Java API के लिए GroupDocs.Conversion के माध्यम से, आप एक स्प्रेडशीट में पृष्ठ, विशिष्ट सेल श्रेणी देख सकते हैं या यहां तक ​​कि PDF और CAD जैसे स्वरूपों में एक व्यक्तिगत दस्तावेज़ परत प्रस्तुत कर सकते हैं।",
    "content2": "{{ProductFullName}} API आपको समर्थित फ़ाइल स्वरूपों के लिए एनोटेशन या टिप्पणियों के साथ/बिना दस्तावेज़ प्रस्तुत करने की अनुमति देता है। यह आपको कस्टम फ़ॉन्ट निर्देशिका जोड़ने और मूल दस्तावेज़ जानकारी जैसे फ़ाइल टाइप, एक्सटेंशन, नाम, पेजकाउंट इत्यादि निकालने में सक्षम बनाता है।",
    "tab_one": {
      "description": "{{ProductFullName}} का अवलोकन निम्नलिखित है:",
      "right": {
        "title": "अवलोकन",
        "content1": "* ऑटो-डिटेक्ट फ़ाइल प्रकार",
        "content2": "* दस्तावेज़ कनवर्ट करें",
        "content3": "* प्रस्तुतियों को रूपांतरित करें",
        "content4": "* स्प्रेडशीट कन्वर्ट करें",
        "content5": "* रेखापुंज छवियों को कनवर्ट करें",
        "content6": "* पीडीएफ दस्तावेजों को कनवर्ट करें",
        "content7": "* अन्य प्रारूपों में कनवर्ट करें",
        "content8": "* वॉटरमार्क लागू करें",
        "content9": "* फ़ाइल पासवर्ड निर्दिष्ट करें",
        "content10": "* रूपांतरण अनुकूलित करें"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} सभी लोकप्रिय और आमतौर पर उपयोग किए जाने वाले [दस्तावेज़ फ़ाइल स्वरूपों](https://docs.groupdocs.com/conversion/net/supported-document-formats/) के बीच रूपांतरण का समर्थन करता है।",
      "left": {
        "title": "से कनवर्ट करें:",
        "content1": "* **दस्तावेज़**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **स्प्रेडशीट**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **प्रस्तुतिकरण**: पीपीटी, पीपीटीएक्स, पीपीएस, पीपीएसएक्स, ओडीपी, पीओटी, पीओटीएक्स, पीओटीएम, पीपीटीएम, पीपीएसएम, एफओडीपी",
        "content4": "* **छवियां**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "**पोर्टेबल**: पीडीएफ, एक्सपीएस, ओएक्सपीएस, ईपीयूबी",
        "content6": "* **एचटीएमएल**: एचटीएम, एचटीएमएल, एमएचटीएम",
        "content7": "**मेटाफाइल**: ईएमजेड, डब्ल्यूएमजेड",
        "content8": "**फोटोशॉप**: PSD",
        "content9": "**परियोजना**: एमपीपी, एमपीटी, एमपीएक्स",
        "content10": "**आउटलुक**: पीएसटी, ओएसटी",
        "content11": "**ईमेल**: एमएसजी, ईएमएल, ईएमएलएक्स",
        "content12": "* **आरेख**: वीएसडी, वीएसडीएक्स, वीएसडीएम, वीएसएस, वीएसएसएम, वीएसटी, वीएसटीएम, वीएसएक्स, वीटीएक्स, वीडीडब्ल्यू, वीडीएक्स, एसवीजी, एसवीजीजेड",
        "content13": "* **ऑटोकैड**: डीएक्सएफ, डीडब्ल्यूजी, डीडब्ल्यूएफ, एसटीएल, आईएफसी, डीडब्ल्यूटी",
        "content14": "**पोस्टस्क्रिप्ट**: ईपीएस, पीएस, पीएसएल, सीजीएम",
        "content15": "**कोरलड्रा**: सीडीआर, सीएमएक्स",
        "content16": "**अन्य**: वीसीएफ, पीएलटी, एलजीएस, ओटीजी, एमडी, एआई, लॉग"
      },
      "right": {
        "title": "में बदलो:",
        "content1": "* **दस्तावेज़**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **स्प्रेडशीट**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "**प्रस्तुतिकरण**: पीपीटी, पीपीटीएक्स, पीपीएस, पीपीएसएक्स, ओडीपी, पीओटीएक्स, पीओटीएम, पीपीटीएम, पीपीएसएम, एफओडीपी",
        "content4": "* **छवियां**: टीआईएफ, टीआईएफएफ, जेपीजी, जेपीईजी, पीएनजी, जीआईएफ, बीएमपी, आईसीओ, जेपीईजी2000",
        "content5": "* **मेटाफाइल**: EMF, WMF, EMZ, WMZ",
        "content6": "* **आरेख**: एसवीजीजेड",
        "content7": "**पोर्टेबल**: पीडीएफ, एक्सपीएस",
        "content8": "* **एचटीएमएल**: एचटीएम, एचटीएमएल, एमएचटीएम",
        "content9": "**अन्य**: एमडी"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} निम्नलिखित ऑपरेटिंग सिस्टम, फ्रेमवर्क और पैकेज मैनेजरों का समर्थन करता है:",
      "left": {
        "title1": "ऑपरेटिंग सिस्टम",
        "title2": "समर्थित चौखटे"
      },
      "right": {
        "title1": "पैकेज प्रबंधक",
        "title2": "विकास का माहौल"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} विशेषताएं",
    "content1": "आसान एकीकरण और पैमाइश लाइसेंसिंग",
    "content2": "शब्दों, स्लाइड या सेल में कनवर्ट करते समय डिफ़ॉल्ट ज़ूम विकल्प सेट करें",
    "content3": "सभी लोकप्रिय रेखापुंज छवि प्रारूपों में/से कनवर्ट करें और छवि डीपीआई, ऊंचाई और चौड़ाई असाइन करें",
    "content4": "पीडीएफ और छवि को ग्रेस्केल में बदलें और वेब के लिए पीडीएफ दस्तावेज़ को रैखिक करें",
    "content5": "Word में PDF/XPS रूपांतरण में बुकमार्क स्तर, शीर्षक स्तर और विस्तारित स्तर निर्दिष्ट करें",
    "content6": "पाठ के पीछे प्रदर्शित करने के लिए परिवर्तित दस्तावेज़ में वॉटरमार्क को पृष्ठभूमि के रूप में कॉन्फ़िगर करें और रखें",
    "content7": "ईमेल से रूपांतरण के दौरान ईमेल हैडर प्रस्तुत करें",
    "content8": "दस्तावेज़ रूपांतरण के दौरान कस्टम फ़ॉन्ट निर्देशिकाएँ और स्पष्ट रूप से लोड / स्थानापन्न फ़ॉन्ट सेट करें",
    "content9": "दस्तावेज़, स्लाइड और स्प्रेडशीट रूपांतरण के लिए गुम फ़ॉन्ट्स को बदलने के लिए डिफ़ॉल्ट फ़ॉन्ट सेट करें",
    "content10": "आउटपुट को पथ या आईओ स्ट्रीम के रूप में वापस करने के लिए उन्नत रूपांतरण विधियां",
    "content11": "स्प्रैडशीट को ग्रिड-लाइनों के साथ कनवर्ट करें और रूपांतरण के दौरान स्लाइड से टिप्पणियां निकालें",
    "content12": "पीडीएफ प्रारूप के रूप में विशिष्ट दस्तावेज़ पृष्ठों को कनवर्ट करें और स्प्रेडशीट में विशिष्ट सेल रेंज को कनवर्ट करें",
    "content13": "स्प्रैडशीट परिवर्तित करते समय छिपी हुई शीट दिखाएं और खाली पंक्तियों और स्तंभों को छोड़ें",
    "content14": "दस्तावेज़ के कुल पृष्ठों की गणना करें और रूपांतरण के दौरान असुरक्षित दस्तावेज़ में पासवर्ड सेट करें",
    "content15": "पीडीएफ से एनोटेशन और एंबेडेड फाइलों को हटाने का विकल्प",
    "content16": "HTML में कनवर्ट करते समय HTML 5 अनुरूप मार्कअप बनाएं",
    "content17": "स्रोत प्रकार का स्वतः पता लगाएं और स्ट्रीम से कनवर्ट करते समय सभी संभावित रूपांतरण लौटाएं",
    "content18": "पीडीएफ या एचटीएमएल में कनवर्ट करते समय प्रत्येक पृष्ठ को अलग स्ट्रीम में वापस करने की क्षमता",
    "content19": "Word से कनवर्ट करते समय मार्कअप, टिप्पणियां और ट्रैक परिवर्तन दिखाएं/छुपाएं",
    "content20": "छायांकन विकल्प के साथ DOCX से Tiff G3 रूपांतरण",
    "content21": "सीएडी दस्तावेज़ से कनवर्ट करते समय विशिष्ट लेआउट कनवर्ट करें",
    "content22": "फ़ाइल में कनवर्ट किए गए दस्तावेज़ को सहेजते समय स्वचालित नामकरण",
    "content23": "एपीआई के उपयोग के आधार पर बिल किए जाने के लिए समर्थित मीटर्ड लाइसेंसिंग",
    "content24": "डायग्राम को वर्ड प्रोसेसिंग फाइल फॉर्मेट में बदलें",
    "content25": "HTML को वर्डप्रोसेसिंग दस्तावेज़ में कनवर्ट करते समय पेज नंबर जोड़ें",
    "content26": "XML दस्तावेज़ों को बिना परिवर्तन के किसी भी प्रारूप में कनवर्ट करें",
    "content27": "क्लाइंट-साइड एप्लिकेशन से सीधे फ़ाइल रूपांतरण प्रगति की निगरानी करें (प्रारंभ, समाप्ति)",
    "more_feature": {
      "title1": "जावा का उपयोग करके आसान दस्तावेज़ प्रारूप रूपांतरण",
      "content1": "आप {{ProductFullName}} API का उपयोग करके अनेक प्रकार के दस्तावेज़ों के फ़ाइल स्वरूप को रूपांतरित कर सकते हैं। यहां आपको जावा का उपयोग करके मूल दस्तावेज़ रूपांतरण करने के लिए कोड की कुछ पंक्तियों के साथ प्रस्तुत किया गया है।",
      "step_1": "कनवर्टर वर्ग का एक उदाहरण बनाएं और फ़ाइल को पूर्ण पथ प्रदान करें",
      "step_2": "वांछित लक्ष्य प्रकार के लिए ConvertOptions बनाएं और सेट करें।",
      "step_3": "कन्वर्टर को कॉल करें। कन्वर्ट विधि और पैरामीटर के रूप में पूर्ण पथ और प्रारूप को पास करें",
      "title2": "URL से दस्तावेज़ पढ़ें या रूपांतरण के लिए पथ",
      "content2": "{{ProductFullName}} API का उपयोग करके, आप फ़ाइल पथ के साथ-साथ URL से इनपुट दस्तावेज़ पढ़ सकते हैं। जबकि आप आउटपुट दस्तावेज़ को फ़ाइल के रूप में सहेज सकते हैं या आउटपुट को सीधे स्ट्रीम में भेज सकते हैं।",
      "title3": "व्यापक तकनीकी सहायता",
      "content3": "{{ProductFullName}} एक सरल और सटीक एपीआई है जिसे आप अपने जावा-आधारित अनुप्रयोगों में बहुत आसानी से एकीकृत कर सकते हैं। हालांकि, आपको कुछ ही समय में तैयार करने और चलाने के लिए, हम कोड नमूने और व्यापक एपीआई दस्तावेज का पालन करने में आसान भी प्रदान करते हैं।"
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion अन्य लोकप्रिय विकास परिवेशों के लिए दस्तावेज़ रूपांतरण API प्रदान करता है",
    "solution": {
      "img_alt": "GroupDocs. .NET के लिए रूपांतरण",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": "।जाल",
      "link": "/रूपांतरण/नेट/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "रूपांतरण के लिए स्रोत फ़ाइल {{FROM}} लोड करें",
      "prepare_comment": "लक्ष्य प्रारूप {{TO}} के लिए रूपांतरण विकल्प तैयार करें",
      "convert_comment": "{{TO}} प्रारूप में कनवर्ट करें"
    }
  }
}