{
  "head": {
    "title": "{{ProgLang}} Құжатты түрлендіру API | PDF Word Excel PPTX HTML кескіндерін түрлендіру",
    "description": "{{ProgLang}} Құжатты түрлендіру API. PDF Word DOC DOCX, Excel электрондық кестелері PPT PPTX, HTML, PSD, MPT MPP, MSG EMLX электрондық поштасы, AutoCAD және кескін файл пішімдерін түрлендіру."
  },
  "header": {
    "title": "80+ файл пішімдерін түрлендіруге арналған {{ProgLang}} API",
    "description": "Ешбір сыртқы бағдарламалық құралды орнатпай, құжат пен кескінді түрлендіру функционалдығын {{ProgLang}} қолданбаларына біріктіруге арналған қарапайым API.",
    "button": {
      "label": "Тегін сынақ нұсқасын жүктеп алыңыз",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Шолу"
      },
      "button2": {
        "text": "Ерекше өзгешеліктері"
      },
      "button3": {
        "text": "Қолдау"
      },
      "button4": {
        "text": "Тікелей демо"
      },
      "button5": {
        "text": "Баға белгілеу"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} қосымша бағдарламалық құралды орнатуды қажет етпей-ақ Java қолданбаларында кескіндер мен құжат пішімдерін көрсету үшін құжаттарды түрлендіру API интерфейстерінің қуатты жинағын біріктіреді. Ол нақты мәтінді, жоғары дәлдіктегі шығысты беру кезінде құжаттарды қарау сапасын жақсарту үшін құжаттарды табиғи түрде растризациялайды және оларды SVG+HTML+CSS түрлендіреді. Құжатты көрсету API пайдалану – PDF, HTML, XML, Microsoft Office Word, Excel жұмыс парақтарын, PowerPoint презентацияларын, Outlook электрондық пошталарын, Visio диаграммаларын, Жобаны, метафайлдарды, кескіндерді және әртүрлі басқа файл пішімдерін оңай және азырақ бағдарламалау қаупімен жылдам қараңыз. Сондай-ақ, ол парольмен қорғалған файлдарды көрсете алады және рендерингтен кейін HTML, кескін немесе PDF пішіні ретінде құжат көрінісін алуға мүмкіндік береді. Біздің файлды түрлендіру кітапханамыз өте теңшеуге болады, себебі ол бүкіл құжатты көрсетуге немесе процесті жылдамдату үшін оны ішінара көрсетуге мүмкіндік береді. Java API үшін GroupDocs.Conversion арқылы сіз беттерді, электрондық кестедегі нақты ұяшық ауқымын көре аласыз немесе тіпті PDF және CAD сияқты пішімдерде жеке құжат қабатын көрсете аласыз.",
    "content2": "{{ProductFullName}} API қолдау көрсетілетін файл пішімдері үшін аннотация немесе түсініктемесіз/аннотациясыз құжаттарды көрсетуге мүмкіндік береді. Ол сонымен қатар пайдаланушы қаріп каталогтарын қосуға және FileType, Extension, Name, PageCount және т.б. сияқты негізгі құжат ақпаратын шығаруға мүмкіндік береді.",
    "tab_one": {
      "description": "Төменде {{ProductFullName}} шолуы берілген:",
      "right": {
        "title": "Шолу",
        "content1": "* Файл түрін автоматты түрде анықтау",
        "content2": "* Құжаттарды түрлендіру",
        "content3": "* Презентацияларды түрлендіру",
        "content4": "* Электрондық кестелерді түрлендіру",
        "content5": "* Растрлық кескіндерді түрлендіру",
        "content6": "* PDF құжаттарын түрлендіру",
        "content7": "* Басқа пішімдерді түрлендіру",
        "content8": "* Су таңбасын қолданыңыз",
        "content9": "* Файл құпия сөзін көрсетіңіз",
        "content10": "* Түрлендіруді теңшеу"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} барлық танымал және жиі қолданылатын [құжат файлы пішімдері] (https://docs.groupdocs.com/conversion/net/supported-document-formats/) арасында түрлендіруді қолдайды.",
      "left": {
        "title": "Қайдан түрлендіру:",
        "content1": "* **Құжаттар**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Электрондық кестелер**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Презентациялар**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Суреттер**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Портативті**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Метафайлдар**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Жоба**: MPP, MPT, MPX",
        "content10": "* ** Болжам**: PST, OST",
        "content11": "* **Электрондық пошта**: MSG, EML, EMLX",
        "content12": "* **Диаграммалар**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Басқа**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Келесіге түрлендіру:",
        "content1": "* **Құжаттар**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Электрондық кестелер**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Презентациялар**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Суреттер**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Метафайлдар**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Диаграммалар**: SVGZ",
        "content7": "* ** Портативті**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Басқа**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} келесі операциялық жүйелерді, жақтауларды және пакет менеджерлерін қолдайды:",
      "left": {
        "title1": "Операциялық жүйелер",
        "title2": "Қолдау көрсетілетін жақтаулар"
      },
      "right": {
        "title1": "Пакет менеджері",
        "title2": "Даму орталары"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} мүмкіндіктері",
    "content1": "Оңай интеграция және есептелген лицензиялау",
    "content2": "Сөздерге, слайдтарға немесе ұяшықтарға түрлендіру кезінде әдепкі масштабтау опциясын орнатыңыз",
    "content3": "Барлық танымал растрлық кескін пішіміне түрлендіру/түрлендіру және кескіннің DPI, биіктігі мен енін тағайындау",
    "content4": "PDF және кескінді сұр реңкке түрлендіру және Интернетке арналған PDF құжатын сызықтыққа айналдыру",
    "content5": "Word бағдарламасында PDF/XPS түрлендіруге бетбелгі деңгейін, тақырып деңгейін және кеңейтілген деңгейді көрсетіңіз",
    "content6": "Мәтіннің артында көрсету үшін түрлендірілген құжатта су таңбасын конфигурациялаңыз және орналастырыңыз",
    "content7": "Электрондық поштадан түрлендіру кезінде электрондық пошта тақырыбын көрсетіңіз",
    "content8": "Теңшелетін қаріп каталогтарын орнатыңыз және құжатты түрлендіру кезінде қаріпті анық жүктеңіз/алмастырыңыз",
    "content9": "Құжаттар, слайдтар және электрондық кестелерді түрлендіру үшін жетіспейтін қаріптерді ауыстыру үшін әдепкі қаріпті орнату",
    "content10": "Шығысты жол немесе IO ағыны ретінде қайтару үшін кеңейтілген түрлендіру әдістері",
    "content11": "Тор сызықтары бар электрондық кестені түрлендіру және түрлендіру кезінде слайдтардан түсініктемелерді жою",
    "content12": "Арнайы құжат беттерін PDF пішімі ретінде түрлендіру және электрондық кестелердегі нақты ұяшық ауқымын түрлендіру",
    "content13": "Электрондық кестелерді түрлендіру кезінде жасырын парақтарды көрсету және бос жолдар мен бағандарды өткізіп жіберу",
    "content14": "Құжаттың жалпы беттерін санау және түрлендіру кезінде құпия сөзді қорғалмаған құжатқа орнату",
    "content15": "PDF файлынан аннотациялар мен ендірілген файлдарды жою опциясы",
    "content16": "HTML-ге түрлендіру кезінде HTML 5-мен үйлесімді белгілеу жасаңыз",
    "content17": "Дереккөз түрін автоматты түрде анықтау және ағыннан түрлендіру кезінде барлық мүмкін түрлендірулерді қайтару",
    "content18": "PDF немесе HTML түрлендіру кезінде әр бетті бөлек ағында қайтару мүмкіндігі",
    "content19": "Word бағдарламасынан түрлендіру кезінде белгілеуді, түсініктемелерді көрсету/жасыру және өзгертулерді бақылау",
    "content20": "DOCX-тен Tiff G3-ке көлеңкелеу опциясымен түрлендіру",
    "content21": "CAD құжатынан түрлендіру кезінде арнайы макеттерді түрлендіру",
    "content22": "Түрлендірілген құжатты файлға сақтау кезінде автоматты атау",
    "content23": "Есептелген лицензиялау API пайдалану негізінде есептелуге қолдау көрсетіледі",
    "content24": "Диаграммаларды мәтінді өңдеу файл пішіміне түрлендіру",
    "content25": "HTML мәтінін Word өңдеу құжатына түрлендіру кезінде бет нөмірлерін қосыңыз",
    "content26": "XML құжаттарын түрлендірусіз кез келген пішімге түрлендіру",
    "content27": "Файлды түрлендіру барысын (Бастау, Аяқтау) тікелей клиенттік қолданбадан бақылаңыз",
    "more_feature": {
      "title1": "Java көмегімен құжат форматын оңай түрлендіру",
      "content1": "{{ProductFullName}} API арқылы көптеген құжат түрлерінің файл пішімін түрлендіруге болады. Мұнда сізге Java көмегімен негізгі құжат түрлендіруді орындау үшін бірнеше код жолы ұсынылады.",
      "step_1": "Конвертер класының данасын жасаңыз және файлды толық жолмен қамтамасыз етіңіз",
      "step_2": "Қажетті мақсат түрі үшін ConvertOptions жасаңыз және орнатыңыз.",
      "step_3": "Converter.Convert әдісін шақырып, толық жолды және пішімді параметр ретінде жіберіңіз",
      "title2": "Құжатты URL мекенжайынан немесе түрлендіру жолынан оқыңыз",
      "content2": "{{ProductFullName}} API пайдалану арқылы кіріс құжатын файл жолынан, сондай-ақ URL мекенжайынан оқуға болады. Шығарылған құжатты файл ретінде сақтауға немесе шығысты тікелей ағынға жіберуге болады.",
      "title3": "Кешенді техникалық қолдау",
      "content3": "{{ProductFullName}} — Java негізіндегі қолданбаларға оңай біріктіруге болатын қарапайым және нақты API. Дегенмен, сізді тез арада іске қосу үшін біз оңай орындалатын код үлгілерін және жан-жақты API құжаттамасын ұсынамыз."
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion басқа танымал әзірлеу орталары үшін құжаттарды түрлендіру API интерфейстерін ұсынады",
    "solution": {
      "img_alt": ".NET үшін GroupDocs.Conversion",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".NET",
      "link": "/конверсия/нетто/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Түрлендіру үшін {{FROM}} бастапқы файлын жүктеңіз",
      "prepare_comment": "{{TO}} мақсатты пішіміне түрлендіру опцияларын дайындаңыз",
      "convert_comment": "{{TO}} пішіміне түрлендіру"
    }
  }
}