{
  "head": {
    "title": "{{ProgLang}} დოკუმენტის კონვერტაციის API | გადაიყვანეთ PDF Word Excel PPTX HTML სურათები",
    "description": "{{ProgLang}} დოკუმენტის კონვერტაციის API. გადაიყვანეთ PDF Word DOC DOCX, Excel ცხრილები PPT PPTX, HTML, PSD, MPT MPP, ელფოსტა MSG EMLX, AutoCAD და გამოსახულების ფორმატები."
  },
  "header": {
    "title": "{{ProgLang}} API 80+ ფაილის ფორმატის კონვერტაციისთვის",
    "description": "მარტივი API დოკუმენტისა და სურათის კონვერტაციის ფუნქციების ინტეგრირებისთვის {{ProgLang}} აპლიკაციებში გარე პროგრამული უზრუნველყოფის ინსტალაციის გარეშე.",
    "button": {
      "label": "ჩამოტვირთეთ უფასო საცდელი",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "მიმოხილვა"
      },
      "button2": {
        "text": "მახასიათებლები"
      },
      "button3": {
        "text": "მხარდაჭერა"
      },
      "button4": {
        "text": "ცოცხალი დემო"
      },
      "button5": {
        "text": "ფასი"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} აერთიანებს დოკუმენტების კონვერტაციის API-ების მძლავრ კომპლექტს, რათა აჩვენოს სურათები და დოკუმენტის ფორმატები თქვენს Java აპლიკაციებში დამატებითი პროგრამული უზრუნველყოფის დაყენების საჭიროების გარეშე. ის ბუნებრივად აქცევს დოკუმენტებს და გარდაქმნის მათ SVG+HTML+CSS-ად, რათა გააუმჯობესოს დოკუმენტის ნახვის ხარისხი, ხოლო ჭეშმარიტი ტექსტის, მაღალი სიზუსტის გამომავალი მიწოდების დროს. API-ის რენდერინგის დოკუმენტის გამოყენებით - სწრაფად იხილეთ PDF, HTML, XML, Microsoft Office Word, Excel სამუშაო ფურცლები, PowerPoint პრეზენტაციები, Outlook ელ.წერილები, Visio დიაგრამები, პროექტი, მეტაფაილები, სურათები და სხვა ფაილების ფორმატები მარტივად და ნაკლები პროგრამირების საშიშროებით. მას ასევე შეუძლია აჩვენოს პაროლით დაცული ფაილები და დაუშვას დოკუმენტის წარმოდგენა, როგორც HTML, სურათი ან PDF ფორმა რენდერის შემდეგ. ჩვენი ფაილების კონვერტაციის ბიბლიოთეკა საკმაოდ კონფიგურირებადია, რადგან ის გაძლევთ საშუალებას აჩვენოთ მთელი დოკუმენტი ან ნაწილობრივ გადაიტანოთ იგი პროცესის დასაჩქარებლად. GroupDocs.Conversion for Java API-ის საშუალებით შეგიძლიათ ნახოთ გვერდები, უჯრედების კონკრეტული დიაპაზონი ელცხრილში ან თუნდაც ინდივიდუალური დოკუმენტის ფენის გადაცემა ფორმატებში, როგორიცაა PDF და CAD.",
    "content2": "{{ProductFullName}} API გაძლევთ საშუალებას გამოაქვეყნოთ დოკუმენტები ანოტაციით ან კომენტარების გარეშე, მხარდაჭერილი ფაილის ფორმატებისთვის. ის ასევე საშუალებას გაძლევთ დაამატოთ მორგებული შრიფტის დირექტორიები და ამოიღოთ დოკუმენტის ძირითადი ინფორმაცია, როგორიცაა FileType, Extension, Name, PageCount და ა.შ.",
    "tab_one": {
      "description": "ქვემოთ მოცემულია {{ProductFullName}}-ის მიმოხილვა:",
      "right": {
        "title": "მიმოხილვა",
        "content1": "* ფაილის ტიპის ავტომატური ამოცნობა",
        "content2": "* დოკუმენტების კონვერტაცია",
        "content3": "* პრეზენტაციების კონვერტაცია",
        "content4": "* ცხრილების გადაკეთება",
        "content5": "* რასტრული სურათების კონვერტაცია",
        "content6": "* გადაიყვანეთ PDF დოკუმენტები",
        "content7": "* სხვა ფორმატების კონვერტაცია",
        "content8": "* წყლის ნიშნის გამოყენება",
        "content9": "* მიუთითეთ ფაილის პაროლი",
        "content10": "* კონვერტაციის მორგება"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} მხარს უჭერს კონვერტაციას ყველა პოპულარულ და ხშირად გამოყენებულ [დოკუმენტის ფაილის ფორმატებს] შორის (https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "კონვერტაცია მდებარეობა:",
        "content1": "* **დოკუმენტები**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **ელცხრილები**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **პრეზენტაციები**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **გამოსახულებები**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **პორტატული **: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **მეტაფაილები**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **პროექტი**: MPP, MPT, MPX",
        "content10": "* ** Outlook **: PST, OST",
        "content11": "* **ელფოსტა**: MSG, EML, EMLX",
        "content12": "* **დიაგრამები**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* ** CorelDRAW **: CDR, CMX",
        "content16": "* **სხვა **: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "კონვერტაცია:",
        "content1": "* **დოკუმენტები**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **ელცხრილები**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **პრეზენტაციები**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **გამოსახულებები**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **მეტაფაილები**: EMF, WMF, EMZ, WMZ",
        "content6": "* **დიაგრამები**: SVGZ",
        "content7": "* **პორტატული **: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **სხვა **: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} მხარს უჭერს შემდეგი ოპერაციული სისტემების, ჩარჩოების და პაკეტის მენეჯერებს:",
      "left": {
        "title1": "Ოპერატიული სისტემა",
        "title2": "მხარდაჭერილი ჩარჩოები"
      },
      "right": {
        "title1": "პაკეტის მენეჯერი",
        "title2": "განვითარების გარემო"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} ფუნქციები",
    "content1": "მარტივი ინტეგრაცია და გაზომილი ლიცენზირება",
    "content2": "დააყენეთ ნაგულისხმევი მასშტაბირების ვარიანტი სიტყვებზე, სლაიდებზე ან უჯრედებზე გადაყვანისას",
    "content3": "გადაიყვანეთ ყველა პოპულარულ რასტერული გამოსახულების ფორმატში და მიანიშნეთ სურათის DPI, სიმაღლე და სიგანე",
    "content4": "გადაიყვანეთ PDF და გამოსახულება ნაცრისფერ ფერში და განაახლეთ PDF დოკუმენტი ინტერნეტისთვის",
    "content5": "მიუთითეთ სანიშნეების დონე, სათაურის დონე და გაფართოებული დონე Word-ში PDF/XPS კონვერტაციაში",
    "content6": "კონფიგურაცია და მოათავსეთ ჭვირნიშანი კონვერტირებულ დოკუმენტში, როგორც ფონი ტექსტის უკან საჩვენებლად",
    "content7": "ელ.ფოსტის სათაურის რენდერი ელფოსტიდან კონვერტაციის დროს",
    "content8": "დააყენეთ მორგებული შრიფტის დირექტორიები და აშკარად ჩატვირთეთ/შეცვალეთ შრიფტი დოკუმენტის კონვერტაციის დროს",
    "content9": "დააყენეთ ნაგულისხმევი შრიფტი, რათა შეცვალოს დაკარგული შრიფტები დოკუმენტების, სლაიდების და ცხრილების კონვერტაციისთვის",
    "content10": "გაფართოებული კონვერტაციის მეთოდები გამომავალი ბილიკად ან IO ნაკადად დასაბრუნებლად",
    "content11": "გადაიყვანეთ ცხრილები ქსელის ხაზებით და წაშალეთ კომენტარები სლაიდებიდან კონვერტაციისას",
    "content12": "კონკრეტული დოკუმენტის გვერდების PDF ფორმატად გადაქცევა და უჯრედების სპეციფიკური დიაპაზონის ელცხრილებში",
    "content13": "ფარული ფურცლების ჩვენება და ცარიელი რიგებისა და სვეტების გამოტოვება ელცხრილების კონვერტაციისას",
    "content14": "დაითვალეთ დოკუმენტის მთლიანი გვერდები და დააყენეთ პაროლი დაუცველ დოკუმენტზე კონვერტაციის დროს",
    "content15": "ანოტაციების და ჩაშენებული ფაილების PDF-დან წაშლის ვარიანტი",
    "content16": "შექმენით HTML 5-ის შესაბამისი მარკირება HTML-ზე გადაყვანისას",
    "content17": "წყაროს ტიპის ავტომატური ამოცნობა და ყველა შესაძლო კონვერტაციის დაბრუნება ნაკადიდან კონვერტაციისას",
    "content18": "PDF ან HTML-ში გადაყვანისას თითოეული გვერდის ცალკე სტრიმში დაბრუნების შესაძლებლობა",
    "content19": "აჩვენეთ/დამალეთ მარკირება, კომენტარები და თვალყური ადევნეთ ცვლილებებს Word-დან კონვერტაციისას",
    "content20": "DOCX-ში Tiff G3-ის კონვერტაცია დაჩრდილვის ოფციით",
    "content21": "კონკრეტული განლაგების კონვერტაცია CAD დოკუმენტიდან კონვერტაციისას",
    "content22": "ავტომატური დასახელება კონვერტირებული დოკუმენტის ფაილში შენახვისას",
    "content23": "გაზომილი ლიცენზირება მხარდაჭერილია ბილინგისთვის API-ის გამოყენების საფუძველზე",
    "content24": "გადაიყვანეთ დიაგრამები ტექსტის დამუშავების ფაილის ფორმატებში",
    "content25": "დაამატეთ გვერდის ნომრები HTML-ის Wordprocessing დოკუმენტად გადაქცევისას",
    "content26": "გადაიყვანეთ XML დოკუმენტები ნებისმიერ ფორმატში ტრანსფორმაციის გარეშე",
    "content27": "დააკვირდით ფაილების კონვერტაციის პროგრესს (დაწყება, დასრულება) პირდაპირ კლიენტის მხარის აპლიკაციიდან",
    "more_feature": {
      "title1": "მარტივი დოკუმენტის ფორმატის კონვერტაცია ჯავის გამოყენებით",
      "content1": "თქვენ შეგიძლიათ დააკონვერტიროთ ფაილის ფორმატის მრავალი დოკუმენტის ტიპი {{ProductFullName}} API-ის გამოყენებით. აქ წარმოგიდგენთ კოდის რამდენიმე ხაზს Java-ს გამოყენებით ძირითადი დოკუმენტის კონვერტაციის შესასრულებლად.",
      "step_1": "შექმენით Converter კლასის მაგალითი და მიაწოდეთ ფაილს სრული გზა",
      "step_2": "შექმენით და დააყენეთ ConvertOptions სასურველი სამიზნე ტიპისთვის.",
      "step_3": "გამოიძახეთ Converter.Convert მეთოდი და გადაიტანეთ სრული გზა და ფორმატი პარამეტრად",
      "title2": "წაიკითხეთ დოკუმენტი URL-დან ან კონვერტაციის ბილიკიდან",
      "content2": "{{ProductFullName}} API-ის გამოყენებით შეგიძლიათ წაიკითხოთ შეყვანის დოკუმენტი ფაილის ბილიკიდან, ასევე URL-დან. მიუხედავად იმისა, რომ თქვენ შეგიძლიათ შეინახოთ გამომავალი დოკუმენტი ფაილად ან გაგზავნოთ გამოსავალი პირდაპირ ნაკადში.",
      "title3": "ყოვლისმომცველი ტექნიკური მხარდაჭერა",
      "content3": "{{ProductFullName}} არის მარტივი და ზუსტი API, რომლის ინტეგრირებაც შეგიძლიათ Java-ზე დაფუძნებულ აპლიკაციებში საკმაოდ მარტივად. თუმცა, იმისთვის, რომ დროულად ამოქმედდეთ, ჩვენ ასევე გთავაზობთ ადვილად თვალყურს ადევნებთ კოდის ნიმუშებს და ყოვლისმომცველ API დოკუმენტაციას."
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion გთავაზობთ დოკუმენტის კონვერტაციის API-ებს განვითარების სხვა პოპულარულ გარემოში",
    "solution": {
      "img_alt": "GroupDocs.Conversion .NET-ისთვის",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".NET",
      "link": "/კონვერტაცია/ქსელი/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "ჩატვირთეთ საწყისი ფაილი {{FROM}} კონვერტაციისთვის",
      "prepare_comment": "მოამზადეთ კონვერტაციის ვარიანტები სამიზნე ფორმატისთვის {{TO}}",
      "convert_comment": "გადაიყვანეთ {{TO}} ფორმატში"
    }
  }
}