{
  "head": {
    "title": "{{ProgLang}} Documentconversie-API | Converteer PDF Word Excel PPTX HTML-afbeeldingen",
    "description": "{{ProgLang}} Documentconversie-API. Converteer PDF Word DOC DOCX, Excel Spreadsheets PPT PPTX, HTML, PSD, MPT MPP, E-mail MSG EMLX, AutoCAD & afbeeldingsbestandsformaten."
  },
  "header": {
    "title": "{{ProgLang}} API om 80+ bestandsformaten te converteren",
    "description": "Eenvoudige API om document- en beeldconversiefunctionaliteit te integreren in {{ProgLang}}-applicaties zonder externe software te installeren.",
    "button": {
      "label": "Download gratis proefversie",
      "link": "https://downloads.groupdocs.com/conversion/java"
    }
  },
  "submenu": {
    "middle": {
      "button1": {
        "text": "Overzicht"
      },
      "button2": {
        "text": "Functies"
      },
      "button3": {
        "text": "Steun"
      },
      "button4": {
        "text": "Live demonstratie"
      },
      "button5": {
        "text": "Prijzen"
      }
    }
  },
  "overview": {
    "content1": "{{ProductFullName}} combineert een krachtige set documentconversie-API's om afbeeldingen en documentindelingen in uw Java-toepassingen weer te geven zonder dat u extra software hoeft te installeren. Het rastert de documenten van nature en converteert ze naar SVG+HTML+CSS om de kwaliteit van het bekijken van documenten te verbeteren en tegelijkertijd een echte tekst, high-fidelity-uitvoer te leveren. Met behulp van de documentrendering-API - bekijk snel PDF, HTML, XML, Microsoft Office Word, Excel-werkbladen, PowerPoint-presentaties, Outlook-e-mails, Visio-diagrammen, Project, metabestanden, afbeeldingen en verschillende andere bestandsindelingen met gemak en minder programmeerrisico's. Het kan ook met een wachtwoord beveiligde bestanden weergeven en het mogelijk maken om na de weergave een documentweergave als HTML-, afbeeldings- of PDF-vorm te krijgen. Onze bestandsconversiebibliotheek is behoorlijk aanpasbaar, omdat u het hele document kunt weergeven of het gedeeltelijk kunt weergeven om het proces te versnellen. Via GroupDocs.Conversion voor Java API kunt u pagina's, specifieke celbereiken in een spreadsheet bekijken of zelfs een afzonderlijke documentlaag weergeven in formaten, zoals PDF en CAD.",
    "content2": "Met de {{ProductFullName}} API kunt u documenten weergeven met/zonder annotaties of opmerkingen voor ondersteunde bestandsindelingen. Het stelt u ook in staat om aangepaste lettertypemappen toe te voegen en basisdocumentinformatie te extraheren, zoals FileType, Extension, Name, PageCount, enz.",
    "tab_one": {
      "description": "Hieronder volgt een overzicht van {{ProductFullName}}:",
      "right": {
        "title": "Overzicht",
        "content1": "* Automatisch bestandstype detecteren",
        "content2": "* Documenten converteren",
        "content3": "* Presentaties converteren",
        "content4": "* Spreadsheets converteren",
        "content5": "* Rasterafbeeldingen converteren",
        "content6": "* PDF-documenten converteren",
        "content7": "* Andere formaten converteren",
        "content8": "* Watermerk toepassen",
        "content9": "* Specificeer bestandswachtwoord",
        "content10": "* Conversie aanpassen"
      }
    },
    "tab_two": {
      "description": "{{ProductFullName}} ondersteunt conversie tussen alle populaire en veelgebruikte [documentbestandsindelingen](https://docs.groupdocs.com/conversion/net/supported-document-formats/).",
      "left": {
        "title": "Converteren van:",
        "content1": "* **Documenten**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Spreadsheets**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, ODS, TSV, XLT, XLTX, XLTM, XLAM, FODS, SXC",
        "content3": "* **Presentaties**: PPT, PPTX, PPS, PPSX, ODP, POT, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Afbeeldingen**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, DIB, JPC, JPEG-LS, JPEG2000",
        "content5": "* **Draagbaar**: PDF, XPS, OXPS, EPUB",
        "content6": "* **HTML**: HTM, HTML, MHTML",
        "content7": "* **Metabestanden**: EMZ, WMZ",
        "content8": "* **PhotoShop**: PSD",
        "content9": "* **Project**: MPP, MPT, MPX",
        "content10": "* **Outlook**: PST, OST",
        "content11": "* **E-mail**: MSG, EML, EMLX",
        "content12": "* **Diagrammen**: VSD, VSDX, VSDM, VSS, VSSM, VST, VSTM, VSX, VTX, VDW, VDX, SVG, SVGZ",
        "content13": "* **AutoCAD**: DXF, DWG, DWF, STL, IFC, DWT",
        "content14": "* **PostScript**: EPS, PS, PSL, CGM",
        "content15": "* **CorelDRAW**: CDR, CMX",
        "content16": "* **Overig**: VCF, PLT, LGS, OTG, MD, AI, LOG"
      },
      "right": {
        "title": "Omzetten naar:",
        "content1": "* **Documenten**: DOC, DOCX, DOCM, DOT, DOTX, DOTM, RTF, TXT, ODT, OTT",
        "content2": "* **Spreadsheets**: XLS, XLSX, XLSM, XLSB, CSV, XLS2003, TSV, XLTX, ODS, XLAM, FODS, DIF, SXC",
        "content3": "* **Presentaties**: PPT, PPTX, PPS, PPSX, ODP, POTX, POTM, PPTM, PPSM, FODP",
        "content4": "* **Afbeeldingen**: TIF, TIFF, JPG, JPEG, PNG, GIF, BMP, ICO, JPEG2000",
        "content5": "* **Metabestanden**: EMF, WMF, EMZ, WMZ",
        "content6": "* **Diagrammen**: SVGZ",
        "content7": "* **Draagbaar**: PDF, XPS",
        "content8": "* **HTML**: HTM, HTML, MHTML",
        "content9": "* **Overig**: MD"
      }
    },
    "tab_three": {
      "description": "{{ProductFullName}} ondersteunt de volgende besturingssystemen, frameworks en pakketbeheerders:",
      "left": {
        "title1": "Besturingssystemen",
        "title2": "Ondersteunde kaders"
      },
      "right": {
        "title1": "Pakket manager",
        "title2": "Ontwikkelomgevingen"
      }
    }
  },
  "features": {
    "title": "{{ProductFullName}} Functies",
    "content1": "Eenvoudige integratie en licenties op maat",
    "content2": "Standaard zoomoptie instellen bij het converteren naar woorden, dia's of cellen",
    "content3": "Converteer naar/van alle populaire rasterafbeeldingsindelingen en wijs afbeelding DPI, hoogte en breedte toe",
    "content4": "PDF en afbeelding converteren naar grijswaarden en PDF-document voor het web lineariseren",
    "content5": "Specificeer bladwijzerniveau, kopniveau en uitgebreid niveau in Word naar PDF/XPS-conversie",
    "content6": "Configureer en plaats watermerk in geconverteerd document als achtergrond om achter tekst weer te geven",
    "content7": "E-mailheader renderen tijdens conversie van e-mail",
    "content8": "Stel aangepaste lettertypemappen in en laad/vervang lettertype expliciet tijdens documentconversie",
    "content9": "Standaardlettertype instellen om ontbrekende lettertypen te vervangen voor conversie van documenten, dia's en spreadsheets",
    "content10": "Geavanceerde conversiemethoden om de uitvoer als pad of IO-stream te retourneren",
    "content11": "Converteer spreadsheet met rasterlijnen en verwijder opmerkingen van dia's tijdens conversie",
    "content12": "Converteer specifieke documentpagina's als PDF-formaat en converteer specifiek celbereik in spreadsheets",
    "content13": "Verborgen bladen weergeven en lege rijen en kolommen overslaan tijdens het converteren van spreadsheets",
    "content14": "Tel het totale aantal pagina's van een document en stel het wachtwoord in op onbeveiligd document tijdens conversie",
    "content15": "Optie om annotaties en ingesloten bestanden uit PDF te verwijderen",
    "content16": "HTML 5 compatibele markeringen maken bij het converteren naar HTML",
    "content17": "Automatisch brontype detecteren en alle mogelijke conversies retourneren bij het converteren van stream",
    "content18": "Mogelijkheid om elke pagina in een aparte stream terug te sturen tijdens het converteren naar PDF of HTML",
    "content19": "Toon/verberg markeringen, opmerkingen en volg wijzigingen tijdens het converteren vanuit Word",
    "content20": "DOCX naar Tiff G3-conversie met schaduwoptie",
    "content21": "Converteer specifieke lay-outs bij het converteren van een CAD-document",
    "content22": "Automatische naamgeving bij het opslaan van een geconverteerd document naar een bestand",
    "content23": "Metered Licensing Ondersteund om te worden gefactureerd op basis van het gebruik van de API",
    "content24": "Diagrammen converteren naar bestandsindelingen voor tekstverwerking",
    "content25": "Paginanummers toevoegen tijdens het converteren van HTML naar tekstverwerkingsdocument",
    "content26": "Converteer XML-documenten naar elk formaat zonder transformatie",
    "content27": "Volg de voortgang van de bestandsconversie (start, einde) rechtstreeks vanuit de clienttoepassing",
    "more_feature": {
      "title1": "Eenvoudige conversie van documentindelingen met Java",
      "content1": "U kunt bestandsindelingen van een groot aantal documenttypen converteren met behulp van de {{ProductFullName}} API. Hier krijgt u een paar regels code te zien om een ​​eenvoudige documentconversie met Java uit te voeren.",
      "step_1": "Maak een instantie van de klasse Converter en geef het bestand het volledige pad",
      "step_2": "Maak en stel ConvertOptions in voor het gewenste doeltype.",
      "step_3": "Roep de methode Converter.Convert aan en geef het volledige pad en formaat door als parameter",
      "title2": "Document lezen van URL of pad voor conversie",
      "content2": "Met behulp van de {{ProductFullName}} API kunt u het invoerdocument lezen van zowel een bestandspad als een URL. Terwijl u het uitvoerdocument als een bestand kunt opslaan of de uitvoer rechtstreeks naar een stream kunt verzenden.",
      "title3": "Uitgebreide technische ondersteuning",
      "content3": "{{ProductFullName}} is een eenvoudige en to-the-point API die u vrij eenvoudig kunt integreren in uw op Java gebaseerde applicaties. Om u echter in een mum van tijd aan de slag te helpen, bieden we ook eenvoudig te volgen codevoorbeelden en uitgebreide API-documentatie."
    }
  },
  "solutions": {
    "title": "GroupDocs.Conversion biedt documentconversie-API's voor andere populaire ontwikkelomgevingen",
    "solution": {
      "img_alt": "GroupDocs.Conversion voor .NET",
      "image": "https://www.groupdocs.cloud/templates/groupdocs/images/product-logos/groupdocs-conversion-net.png",
      "platform": ".NETTO",
      "link": "/conversie/netto/"
    }
  },
  "steps": {
    "code": {
      "load_comment": "Laad bronbestand {{FROM}} voor conversie",
      "prepare_comment": "Bereid conversie-opties voor voor doelformaat {{TO}}",
      "convert_comment": "Converteren naar {{TO}} formaat"
    }
  }
}