{
  "features": {
    "title": "คุณสมบัติ GroupDocs.Conversion",
    "description": "แปลงเอกสาร PDF และ Office เป็น HTML, JPG, PNG, BMP, TIFF, SVG และรูปแบบอื่น ๆ ได้อย่างราบรื่น GroupDocs.Conversion สำหรับ Java API ได้รับการออกแบบมาให้ใช้งานง่ายและผสานรวมเข้ากับโปรเจ็กต์ของคุณ รองรับรูปแบบเอกสารยอดนิยมทั้งหมดพร้อมความสามารถในการปรับแต่งกระบวนการแปลง",
    "feature_1": {
      "title": "การแปลงหลายรูปแบบ",
      "content": "แปลงไฟล์ระหว่างรูปแบบต่างๆ รวมถึง PDF, DOCX, XLSX, PPTX และอื่นๆ ได้อย่างง่ายดาย"
    },
    "feature_2": {
      "title": "เอาต์พุตความเที่ยงตรงสูง",
      "content": "รักษาคุณภาพต้นฉบับและการจัดรูปแบบของเอกสารในระหว่างกระบวนการแปลง"
    },
    "feature_3": {
      "title": "การแปลงไฟล์หลายไฟล์",
      "content": "แปลงไฟล์หลายไฟล์และรวมเข้าด้วยกันเป็นไฟล์เก็บถาวร ช่วยลดความยุ่งยากในการจัดระเบียบเนื้อหาที่แปลงแล้ว"
    },
    "feature_4": {
      "title": "เอกสารหลายหน้าเป็นรูปภาพ",
      "content": "แปลงเอกสารหลายหน้าเป็นรูปภาพทีละหน้า ช่วยให้สามารถควบคุมกระบวนการแปลงได้อย่างแม่นยำ และอำนวยความสะดวกในการแยกและวิเคราะห์เอกสารตามรูปภาพ"
    },
    "feature_5": {
      "title": "การตั้งค่าที่ปรับแต่งได้",
      "content": "ปรับแต่งพารามิเตอร์การแปลงอย่างละเอียด เช่น ความละเอียด คุณภาพ และเค้าโครงเพื่อให้ตรงตามข้อกำหนดเฉพาะ"
    },
    "feature_6": {
      "title": "การประมวลผลที่ปลอดภัย",
      "content": "รับประกันความเป็นส่วนตัวของข้อมูลด้วยตัวเลือกการแปลงไฟล์ที่ป้องกันด้วยรหัสผ่าน"
    },
    "feature_7": {
      "title": "บูรณาการ API",
      "content": "ผสานรวมความสามารถในการแปลงเข้ากับแอปพลิเคชัน Java ของคุณได้อย่างราบรื่น ทำให้เป็นส่วนหนึ่งของขั้นตอนการทำงานของคุณได้อย่างราบรื่น"
    },
    "feature_8": {
      "title": "การแปลงที่แข็งแกร่ง",
      "content": "รับประกันการแปลงไฟล์ที่เชื่อถือได้และปราศจากข้อผิดพลาด รับประกันความถูกต้องและความสมบูรณ์ของเอกสารที่ถูกแปลงของคุณ"
    },
    "feature_9": {
      "title": "แปลงเอกสารจากเอกสารสำคัญ",
      "content": "แยกและแปลงเอกสารจากไฟล์เก็บถาวร ช่วยให้สามารถแปลงเนื้อหาที่จัดเก็บไว้ในไฟล์บีบอัดได้"
    }
  }
}