{
  "features": {
    "title": "GroupDocs.Conversion کی خصوصیات",
    "description": "بغیر کسی رکاوٹ کے پی ڈی ایف اور آفس دستاویزات کو ایچ ٹی ایم ایل، جے پی جی، پی این جی، بی ایم پی، ٹی آئی ایف ایف، ایس وی جی، اور بہت سے دوسرے فارمیٹس میں تبدیل کریں۔ جاوا API کے ذریعے Node.js کے لیے GroupDocs.Conversion کو اس لیے ڈیزائن کیا گیا ہے کہ آپ کے پروجیکٹ میں استعمال اور انضمام میں آسانی ہو۔ یہ تبادلوں کے عمل کو اپنی مرضی کے مطابق کرنے کی صلاحیت کے ساتھ تمام مشہور دستاویز فارمیٹس کی حمایت کرتا ہے۔",
    "feature_1": {
      "title": "ملٹی فارمیٹ کی تبدیلی",
      "content": "فائلوں کو مختلف فارمیٹس کے درمیان تبدیل کریں، بشمول PDF، DOCX، XLSX، PPTX، اور مزید، آسانی کے ساتھ۔"
    },
    "feature_2": {
      "title": "اعلی مخلص پیداوار",
      "content": "تبادلوں کے عمل کے دوران دستاویزات کے اصل معیار اور فارمیٹنگ کو محفوظ رکھیں۔"
    },
    "feature_3": {
      "title": "متعدد فائلوں کو تبدیل کرنا",
      "content": "متعدد فائلوں کو تبدیل کریں اور انہیں ایک آرکائیو میں یکجا کریں، تبدیل شدہ مواد کی تنظیم کو آسان بنائیں۔"
    },
    "feature_4": {
      "title": "تصاویر سے ملٹی پیج دستاویز",
      "content": "ملٹی پیج دستاویزات کو صفحہ بہ صفحہ تصاویر میں تبدیل کریں، تبدیلی کے عمل پر درست کنٹرول کو فعال کرتے ہوئے اور تصویر پر مبنی دستاویز نکالنے اور تجزیہ میں سہولت فراہم کریں۔"
    },
    "feature_5": {
      "title": "حسب ضرورت ترتیبات",
      "content": "تبادلوں کے پیرامیٹرز جیسے کہ ریزولوشن، کوالٹی، اور لے آؤٹ مخصوص ضروریات کو پورا کرنے کے لیے ٹھیک ٹیون کریں۔"
    },
    "feature_6": {
      "title": "محفوظ پروسیسنگ",
      "content": "پاس ورڈ سے محفوظ فائل کنورژن کے اختیارات کے ساتھ ڈیٹا پرائیویسی کو یقینی بنائیں۔"
    },
    "feature_7": {
      "title": "API انضمام",
      "content": "بغیر کسی رکاوٹ کے تبادلوں کی صلاحیتوں کو اپنی JavaScript ایپلیکیشنز میں ضم کریں، اسے آپ کے ورک فلو کا ایک ہموار حصہ بنائیں۔"
    },
    "feature_8": {
      "title": "مضبوط تبدیلی",
      "content": "آپ کے تبدیل شدہ دستاویزات کی درستگی اور سالمیت کی ضمانت دیتے ہوئے قابل اعتماد اور غلطی سے پاک فائل کی تبدیلی کو یقینی بنائیں۔"
    },
    "feature_9": {
      "title": "آرکائیوز سے دستاویزات کو تبدیل کریں۔",
      "content": "آرکائیوز سے دستاویزات کو نکالیں اور تبدیل کریں، کمپریسڈ فائلوں میں محفوظ مواد کی تبدیلی کو فعال کرتے ہوئے"
    }
  }
}