{
  "features": {
    "title": "GroupDocs.Ciri penukaran",
    "description": "Tukar dokumen PDF dan pejabat dengan lancar kepada HTML, JPG, PNG, BMP, TIFF, SVG dan banyak lagi format lain. GroupDocs.Conversion for Java API direka bentuk agar mudah digunakan dan disepadukan ke dalam projek anda. Ia menyokong semua format dokumen popular dengan keupayaan untuk menyesuaikan proses penukaran.",
    "feature_1": {
      "title": "Penukaran pelbagai format",
      "content": "Tukar fail antara pelbagai format, termasuk PDF, DOCX, XLSX, PPTX dan banyak lagi, dengan mudah."
    },
    "feature_2": {
      "title": "Output kesetiaan tinggi",
      "content": "Kekalkan kualiti asal dan pemformatan dokumen semasa proses penukaran."
    },
    "feature_3": {
      "title": "Menukar berbilang fail",
      "content": "Tukar berbilang fail dan gabungkannya ke dalam arkib, memudahkan penyusunan kandungan yang ditukar."
    },
    "feature_4": {
      "title": "Dokumen berbilang halaman kepada imej",
      "content": "Tukar dokumen berbilang halaman kepada imej halaman demi halaman, membolehkan kawalan tepat ke atas proses transformasi dan memudahkan pengekstrakan dan analisis dokumen berasaskan imej."
    },
    "feature_5": {
      "title": "Tetapan boleh disesuaikan",
      "content": "Perhalusi parameter penukaran seperti resolusi, kualiti dan reka letak untuk memenuhi keperluan khusus."
    },
    "feature_6": {
      "title": "Pemprosesan selamat",
      "content": "Pastikan privasi data dengan pilihan penukaran fail yang dilindungi kata laluan."
    },
    "feature_7": {
      "title": "Penyepaduan API",
      "content": "Sepadukan dengan lancar keupayaan penukaran ke dalam aplikasi Java anda, menjadikannya sebahagian lancar aliran kerja anda."
    },
    "feature_8": {
      "title": "Penukaran yang mantap",
      "content": "Pastikan penukaran fail yang boleh dipercayai dan bebas ralat, menjamin ketepatan dan integriti dokumen anda yang diubah."
    },
    "feature_9": {
      "title": "Tukar dokumen daripada arkib",
      "content": "Ekstrak dan tukar dokumen daripada arkib, membolehkan transformasi kandungan yang disimpan dalam fail termampat."
    }
  }
}