{
  "features": {
    "title": "ویژگی های GroupDocs.Conversion",
    "description": "تبدیل یکپارچه PDF و اسناد اداری به HTML، JPG، PNG، BMP، TIFF، SVG و بسیاری از فرمت های دیگر. GroupDocs.Conversion برای Node.js از طریق Java API طوری طراحی شده است که استفاده از آن و ادغام در پروژه شما آسان باشد. از تمام فرمت های سند محبوب با قابلیت سفارشی سازی فرآیند تبدیل پشتیبانی می کند.",
    "feature_1": {
      "title": "تبدیل چند فرمتی",
      "content": "تبدیل فایل ها بین فرمت های مختلف، از جمله PDF، DOCX، XLSX، PPTX، و غیره، به راحتی."
    },
    "feature_2": {
      "title": "خروجی با کیفیت بالا",
      "content": "حفظ کیفیت اصلی و قالب بندی اسناد در طول فرآیند تبدیل."
    },
    "feature_3": {
      "title": "تبدیل چندین فایل",
      "content": "چندین فایل را تبدیل کنید و آنها را در یک آرشیو ترکیب کنید و سازماندهی محتوای تبدیل شده را ساده کنید."
    },
    "feature_4": {
      "title": "سند چند صفحه ای به تصاویر",
      "content": "تبدیل اسناد چند صفحه ای به تصاویر صفحه به صفحه، امکان کنترل دقیق بر فرآیند تبدیل و تسهیل استخراج و تجزیه و تحلیل اسناد مبتنی بر تصویر را فراهم می کند."
    },
    "feature_5": {
      "title": "تنظیمات قابل تنظیم",
      "content": "پارامترهای تبدیل مانند وضوح، کیفیت و طرح را برای برآوردن نیازهای خاص تنظیم کنید."
    },
    "feature_6": {
      "title": "پردازش ایمن",
      "content": "از حریم خصوصی داده ها با گزینه های تبدیل فایل محافظت شده با رمز عبور اطمینان حاصل کنید."
    },
    "feature_7": {
      "title": "یکپارچه سازی API",
      "content": "به طور یکپارچه قابلیت های تبدیل را در برنامه های جاوا اسکریپت خود ادغام کنید و آن را به بخشی یکپارچه از گردش کار خود تبدیل کنید."
    },
    "feature_8": {
      "title": "تبدیل قوی",
      "content": "از تبدیل فایل های قابل اعتماد و بدون خطا اطمینان حاصل کنید و صحت و یکپارچگی اسناد تبدیل شده خود را تضمین کنید."
    },
    "feature_9": {
      "title": "تبدیل اسناد از بایگانی",
      "content": "استخراج و تبدیل اسناد از بایگانی، امکان تبدیل محتوای ذخیره شده در فایل های فشرده را فراهم می کند."
    }
  }
}